[
  {
    "title": "Moyes & Pickford share favourite Goodison Park memories",
    "url": "https://www.bbc.com/sport/football/videos/cly101v1dz3o",
    "summary": "Everton's David Moyes and Jordan Pickford tell Football Focus their favourite memories of being at Goodison Park as the club gets ready to move to a new stadium next season.",
    "date": "2025-05-03T12:53:14",
    "source": "BBC"
  },
  {
    "title": "'He can do it all' - Palace's Eze wins chess tournament",
    "url": "https://www.bbc.com/sport/football/articles/c24q01vye5vo",
    "summary": "Crystal Palace and England forward Eberechi Eze pockets $20,000 (£15,000) in prize money after winning an online chess tournament.",
    "date": "2025-05-03T11:16:13",
    "source": "BBC"
  },
  {
    "title": "FA Cup final kick-off time confirmed",
    "url": "https://www.bbc.com/sport/football/articles/cgjl9ll5ggxo",
    "summary": "The FA confirm the 2024-25 FA Cup final between Manchester City and Crystal Palace will kick off at 16:30 BST on Saturday, 17 May.",
    "date": "2025-05-03T12:36:16",
    "source": "BBC"
  },
  {
    "title": "Little at stake yet loaded with meaning for Old Firm managers",
    "url": "https://www.bbc.com/sport/football/articles/c3evqxv05yvo",
    "summary": "There may be nothing at stake in the last Old Firm derby of the season but both managers have records in mind, writes Liam McLeod.",
    "date": "2025-05-03T09:19:55",
    "source": "BBC"
  },
  {
    "title": "WSL promotion shootout as London City Lionesses take on Birmingham City",
    "url": "https://www.bbc.com/sport/football/articles/cj45jv94zdeo",
    "summary": "London City Lionesses stand on the brink of promotion as the Women's Championship season ends with a straight shootout for a place in the WSL.",
    "date": "2025-05-03T08:35:17",
    "source": "BBC"
  },
  {
    "title": "Ex-Wycombe owner Couhig agrees Reading takeover",
    "url": "https://www.bbc.com/sport/football/articles/c8493nkjlyyo",
    "summary": "Former Wycombe Wanderers owner Rob Couhig agrees takeover at Reading, ending the controversial reign of previous owner Dai Yongge.",
    "date": "2025-05-03T09:41:21",
    "source": "BBC"
  },
  {
    "title": "'Simplicity is genius' - From the Premier League to Irish Cup",
    "url": "https://www.bbc.com/sport/football/articles/clyq7jqy3gqo",
    "summary": "Dungannon Swifts midfielder Gael Bigirimana tells BBC Sport NI about his journey from the Premier League to Irish Cup final.",
    "date": "2025-05-03T06:08:45",
    "source": "BBC"
  },
  {
    "title": "Football Daily",
    "url": "https://www.bbc.co.uk/sounds/play/p0l8054k",
    "summary": "Justin Kluivert speaks to Kelly Somers on his career and Bournemouth's season.",
    "date": "2025-05-03T09:00:00",
    "source": "BBC"
  },
  {
    "title": "Tielemans sees off Fulham to keep Villa's CL hopes alive",
    "url": "https://www.skysports.com/football/aston-villa-vs-fulham/report/506148",
    "summary": "Youri Tielemans' first-half header was enough to earn Aston Villa a 1-0 win over Fulham to keep alive their hopes of Champions League football next season.",
    "date": "Sat, 03 May 2025 14:30:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Leeds win the title at Home Park as Plymouth are relegated",
    "url": "https://www.skysports.com/watch/video/13360607/plymouth-1-2-leeds-championship-highlights",
    "summary": "Highlights of the Sky Bet Championship match between Plymouth and Leeds.",
    "date": "Sat, 03 May 2025 14:48:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Access all areas! Incredible dressing room insight before Magic Weekend clash!",
    "url": "https://www.skysports.com/watch/video/13360624/access-all-areas-incredible-dressing-room-insight-before-super-league-magic-weekend-clash",
    "summary": "Steve McNamara's insightful dressing room talk before Catalans Dragons' match against Leigh Leopards on Magic Weekend!",
    "date": "Sat, 03 May 2025 14:52:00 BST",
    "source": "SkySports"
  },
  {
    "title": "EFL final day: Orient eyeing L1 play-offs; Doncaster on course for L2 title LIVE on Sky!",
    "url": "https://www.skysports.com/football/live-blog/12040/13359211/league-one-and-league-two-final-day-live",
    "summary": "",
    "date": "Sat, 03 May 2025 14:20:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Rabada 'serving suspension' for 'recreational drug use'",
    "url": "https://www.skysports.com/cricket/news/12040/13360529/kagiso-rabada-south-africa-bowler-serving-provisional-suspension-for-recreational-drug-use",
    "summary": "South Africa fast bowler Kagiso Rabada has revealed he is serving a provisional suspension after testing positive for a recreational drug.",
    "date": "Sat, 03 May 2025 14:13:00 BST",
    "source": "SkySports"
  },
  {
    "title": "SCENES! Late Solomon goal wins Championship title for Leeds!",
    "url": "https://www.skysports.com/watch/video/13360544/scenes-late-manor-solomon-goal-wins-championship-title-for-leeds",
    "summary": "Manor Solomon scores a superb goal at Plymouth to win the Championship title for Leeds!",
    "date": "Sat, 03 May 2025 14:26:00 BST",
    "source": "SkySports"
  },
  {
    "title": "WBC wants Canelo vs Crawford super fight: 'It would be monumental!'",
    "url": "https://www.skysports.com/boxing/news/12040/13358581/wbc-wants-canelo-alvarez-vs-terence-crawford-super-fight-says-president-mauricio-sulaiman",
    "summary": "WBC president Mauricio Sulaiman has welcomed a 'monumental' super fight between pound-for-pound greats Canelo Alvarez and Terence Crawford.&#160;",
    "date": "Sat, 03 May 2025 13:00:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Blow for Leeds in title race as own goal gifts Plymouth lead!",
    "url": "https://www.skysports.com/watch/video/13360438/plymouth-vs-leeds-lifeline-for-plymouth-as-leeds-gift-own-goal",
    "summary": "Leeds' Sam Byram gifted Plymouth an own goal to take the lead.",
    "date": "Sat, 03 May 2025 12:57:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Miss of the season contender on dramatic final day!",
    "url": "https://www.skysports.com/watch/video/13360455/burnley-vs-millwall-miss-of-the-season-contender-and-it-could-cost-a-play-off-spot",
    "summary": "Josh Coburn has a moment to forget for Millwall as he fails to hit the target from a few yards out against Burnley.",
    "date": "Sat, 03 May 2025 13:18:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Championship highlights: Leeds CHAMPIONS; Bristol C & Coventry in play-offs & Luton relegated",
    "url": "https://www.skysports.com/football/live-blog/12040/13359210/championship-final-day-live-free-in-game-clips-updates-and-latest-scores",
    "summary": "",
    "date": "Sat, 03 May 2025 11:00:00 BST",
    "source": "SkySports"
  },
  {
    "title": "O'Sullivan casts doubt over future after Crucible exit",
    "url": "https://www.skysports.com/snooker/news/12040/13360421/ronnie-osullivan-casts-doubt-over-future-after-world-snooker-championship-semi-final-exit",
    "summary": "Ronnie O'Sullivan cast fresh doubt over his future after crashing out of the World Snooker Championship with a heavy semi-final defeat.",
    "date": "Sat, 03 May 2025 12:20:00 BST",
    "source": "SkySports"
  },
  {
    "title": "West Brom lead Luton but Hatters instantly equalise through superb Alli effort",
    "url": "https://www.skysports.com/watch/video/13360434/west-brom-lead-luton-but-hatters-instantly-equalise-through-superb-millenic-alli-effort",
    "summary": "Millenic Alli finds a vital equaliser for Luton at the Hawthorns after Tom Fellows gave the home side the lead.",
    "date": "Sat, 03 May 2025 12:52:00 BST",
    "source": "SkySports"
  },
  {
    "title": "McNeil doubles Everton's lead vs Ipswich LIVE!",
    "url": "https://www.skysports.com/football/everton-vs-ipswich-town/live/506153",
    "summary": "",
    "date": "Thu, 01 May 2025 14:04:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Was it a low blow? Dubois and Usyk debate rages on",
    "url": "https://www.skysports.com/boxing/news/12040/13359809/oleksandr-usyk-and-daniel-dubois-teams-divided-in-low-blow-debate-ahead-of-undisputed-heavyweight-show",
    "summary": "Was it a low blow? Daniel Dubois believes so, Frank Warren thinks so, Oleksandr Usyk and his team disagree, nor do they feel it is their problem. Either way, the debate rages on.&#160;",
    "date": "Sat, 03 May 2025 07:00:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Merse left in DISBELIEF after Watkins misses chance to double Villa's lead!",
    "url": "https://www.skysports.com/watch/video/13360473/aston-villa-vs-fulham-paul-merson-left-in-disbelief-after-ollie-watkins-missed-chance",
    "summary": "Watch Paul Merson's reaction to Ollie Watkins' missed opportunity to double Aston Villa's lead against Fulham.",
    "date": "Sat, 03 May 2025 13:40:00 BST",
    "source": "SkySports"
  },
  {
    "title": "'Don't mess with Huw!' | Referee warns crowd!",
    "url": "https://www.skysports.com/watch/video/13360363/pdc-european-tour-dont-mess-with-huw-referee-warns-crowd",
    "summary": "Referee Huw Ware was not best pleased with the crowd during Friday's PDC European Tour match between Martin Schindler and Callan Rydz.",
    "date": "Sat, 03 May 2025 09:50:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Vardy scores 199th Leicester goal vs Southampton LIVE!",
    "url": "https://www.skysports.com/football/leicester-city-vs-southampton/live/506154",
    "summary": "",
    "date": "Thu, 01 May 2025 14:08:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Superb Scheffler storms into six-shot Byron Nelson lead",
    "url": "https://www.skysports.com/golf/news/12040/13360325/the-cj-cup-byron-nelson-scottie-scheffler-storms-into-six-stroke-lead-after-second-round",
    "summary": "Scottie Scheffler carded a stellar round of 63 on Friday to take a six-shot lead after the second day of The CJ Cup Byron Nelson.",
    "date": "Sat, 03 May 2025 07:25:00 BST",
    "source": "SkySports"
  },
  {
    "title": "'Ready for the challenge' - Draper bidding for clay breakthrough in Madrid",
    "url": "https://www.skysports.com/tennis/news/12040/13360347/jack-draper-seeks-madrid-open-glory-as-clay-breakthrough-beckons-live-on-sky-sports",
    "summary": "Jack Draper faces Casper Ruud in Sunday's Madrid Open final - live on<em> Sky Sports </em>- seeking his second ATP Masters 1000 title in as many months.",
    "date": "Sat, 03 May 2025 11:40:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Leicester v Southampton, Everton v Ipswich, and more: football updates – live",
    "url": "https://www.theguardian.com/football/live/2025/may/03/leicester-v-southampton-everton-v-ipswich-and-more-football-updates-live",
    "summary": "<ul><li>All the latest news from 3pm BST around the grounds</li><li><a href=\"https://www.theguardian.com/football/live\">Live scoreboard</a> | <a href=\"https://www.theguardian.com/football/tables\">Latest tables</a> | <a href=\"mailto:simon.burnton@guardian.co.uk\">And email Simon</a></li></ul><p><strong>Will you bounce straight back next season? Will they?</strong><br />\n CW: “I doubt we will. The only hope I have is that the gap has become so big that we end up being promoted again simply by being less rubbish than 21 other teams. Southampton and Ipswich will probably be the top two.”</p><p>SG: “We should be there or thereabouts, so long as the managerial appointment is a sound one. The one appointment the owners got right since buying the club was done via the previously-mentioned Wilcox, so hopefully his replacement, Johannes Spors, can repeat that trick this summer. As for Leicester, I get the unhappiness that fills the air there at the moment, but barring any significant EFL penalties, they’ll be title favourites again.”<br /><br /><strong>Anything you envy about your opponents? </strong><br />\n CW: “At least they can score goals. I’ve seen us score three in this calendar year and I’m a season ticket holder and regular away dayer. Honestly, getting relegated to League One for the first and only time in our history in 2008 was about ten times more enjoyable than this.”</p> <a href=\"https://www.theguardian.com/football/live/2025/may/03/leicester-v-southampton-everton-v-ipswich-and-more-football-updates-live\">Continue reading...</a>",
    "date": "2025-05-03T14:29:44",
    "source": "Guardian"
  },
  {
    "title": "Tielemans winner keeps Villa racing for Champions League as Fulham falter",
    "url": "https://www.theguardian.com/football/2025/may/03/aston-villa-fulham-premier-league-match-report",
    "summary": "<p>This was a narky, gnarly narrow victory but Aston Villa will not mind. After missing out on a Champions League semi-final and an FA Cup final over the previous two matches, Unai Emery’s team enhanced their chances of the top-five finish in the Premier League that would return them to Europe’s elite competition after Youri Tielemans’ first-half header dented Fulham’s own bid for continental competition.</p><p>Villa have now equalled their 17-match record unbeaten home run in the Premier League, set during Emery’s first season here two years ago, and are level on points with Nottingham Forest, who visit Crystal Palace on Monday, and Chelsea, at home to Liverpool on Sunday, on 60 points.</p> <a href=\"https://www.theguardian.com/football/2025/may/03/aston-villa-fulham-premier-league-match-report\">Continue reading...</a>",
    "date": "2025-05-03T13:38:24",
    "source": "Guardian"
  },
  {
    "title": "Championship final day: Leeds crowned champions and Luton relegated",
    "url": "https://www.theguardian.com/football/2025/may/03/championship-final-day-leeds-crowned-champions-and-luton-relegated",
    "summary": "<ul><li>Injury-time winner against Plymouth seals top spot</li><li>Luton down, Bristol City and Coventry in playoffs</li></ul><p><strong>Leeds</strong> were crowned Championship champions in dramatic fashion after Manor Solomon’s injury-time winner against <strong>Plymouth</strong> at Home Park meant Daniel Farke’s side held off <strong>Burnley</strong>, who beat <strong>Millwall</strong> 3-1, on goal difference to seal top spot with a century of points. At the other end of the table, <strong>Luton</strong> suffered a second successive relegation after a 5-3 loss at <strong>West Brom</strong>.</p><p>It is the first time two sides have reached 100 points in the same Championship season. But it looked uncertain early in the day, with Mihailo Ivanovic giving the Lions an early lead at Turf Moor and a Sam Byram own goal doing likewise for Argyle.</p> <a href=\"https://www.theguardian.com/football/2025/may/03/championship-final-day-leeds-crowned-champions-and-luton-relegated\">Continue reading...</a>",
    "date": "2025-05-03T13:36:20",
    "source": "Guardian"
  },
  {
    "title": "Bristol City end Championship playoffs wait and Preston dodge the drop",
    "url": "https://www.theguardian.com/football/2025/may/03/bristol-city-preston-north-end-championship-match-report",
    "summary": "<p>The cider will taste that little bit sweeter in these parts tonight, after Bristol City secured a place in the Championship playoffs for the first time in 17 years. At the final whistle, everyone of a Bristol City persuasion had to wait a little longer for confirmation. Liam Manning, his assistant Chris Hogg and several players huddled around Harry Cornick, the striker not in the squad, whose phone carried updates from Bramall Lane, where a Blackburn goal would have changed everything.</p><p>Then came the roar, news that Blackburn could not find a winner in more than 10 minutes of stoppage time at Sheffield United. The home fans flooded the pitch, many presumably relaying the message to the players of what this all means. Bristol City will play Chris Wilder’s side in the playoffs, the first leg at home next Thursday.</p><p><em>Full report to follow shortly</em></p> <a href=\"https://www.theguardian.com/football/2025/may/03/bristol-city-preston-north-end-championship-match-report\">Continue reading...</a>",
    "date": "2025-05-03T13:44:53",
    "source": "Guardian"
  },
  {
    "title": "Rudoni double sends Coventry past Middlesbrough and into the playoffs",
    "url": "https://www.theguardian.com/football/2025/may/03/coventry-middlesbrough-championship-match-report",
    "summary": "<p></p><p>Coventry stepped up and did the job on the final day of the Championship season, securing a spot in the playoffs with victory over a Middlesbrough side who never abandoned their hopes of promotion until the final whistle blew on a captivating contest.</p><p>A brace for Coventry’s all-action playmaker Jack Rudoni earned the three points that confirmed a two-legged encounter with Sunderland that begins next week. For Sky Blues manager Frank Lampard, who joined in November when the club was in 17th position and two points off the relegation places, it is an unlikely achievement that has also rehabilitated his managerial reputation.</p> <a href=\"https://www.theguardian.com/football/2025/may/03/coventry-middlesbrough-championship-match-report\">Continue reading...</a>",
    "date": "2025-05-03T13:55:36",
    "source": "Guardian"
  },
  {
    "title": "Tonali’s transformation to midfield maestro mirrors Howe’s tactical shift",
    "url": "https://www.theguardian.com/football/2025/may/03/tonali-transformation-midfield-maestro-mirrors-eddie-howe-tactical-shift-newcastle-united",
    "summary": "<p>The Newcastle manager believes that developing the Italian as a playmaker has been his ‘most important decision’</p><p>Eddie Howe’s birthday falls on 29 November but, in a professional context, a couple of his best presents have arrived a day later. By happy coincidence, two of the most productive tactical gambles of the Newcastle manager’s tenure centred on 1-1 draws staged on 30 November. Although the first was enforced and the second voluntary, both experiments involved midfielders and would prove watershed moments in Newcastle’s evolution into one of England’s most feared teams.</p><p>Like his predecessor, Steve Bruce, Howe struggled to transform Joelinton from a £40m flop into a free-scoring centre-forward but when Ciaran Clark was sent-off against Norwich everything changed. To widespread amazement, the Brazilian responded to moving into midfield by discovering his inner Patrick Vieira and playing a key part in securing a creditable draw. Since then there has been no turning back.</p> <a href=\"https://www.theguardian.com/football/2025/may/03/tonali-transformation-midfield-maestro-mirrors-eddie-howe-tactical-shift-newcastle-united\">Continue reading...</a>",
    "date": "2025-05-03T11:00:37",
    "source": "Guardian"
  },
  {
    "title": "Liverpool’s mix of young blood and old heads is right model for Chelsea",
    "url": "https://www.theguardian.com/football/2025/may/03/liverpool-mix-of-young-blood-and-old-heads-is-right-model-for-enzo-maresca-chelsea",
    "summary": "<p>The champions have proved buying the best makes you the best – a hard lesson for the Blues’ struggling youngsters</p><p>If there is one key lesson from <a href=\"https://www.theguardian.com/football/2025/apr/27/liverpool-win-premier-league-title-by-beating-tottenham\">Liverpool’s title triumph</a> for Chelsea to absorb then it is surely the importance of sometimes paying the going rate for players capable of changing a team’s mentality and raising the level as soon as they join.</p><p>That is not to say there is no logic to Chelsea’s wider strategy of scouring the world for young talent and betting on their potential by handing out <a href=\"https://www.theguardian.com/football/2023/jun/25/chelsea-complete-signing-of-villarreal-striker-nicolas-jackson-for-32m\">heavily incentivised long contracts</a>. They have been ridiculed at times but believe vindication will arrive. The club are sticking with this approach and will be able to argue with some justification that the project is on schedule if Champions League qualification is in the bag at the end of the season.</p> <a href=\"https://www.theguardian.com/football/2025/may/03/liverpool-mix-of-young-blood-and-old-heads-is-right-model-for-enzo-maresca-chelsea\">Continue reading...</a>",
    "date": "2025-05-03T07:00:32",
    "source": "Guardian"
  },
  {
    "title": "Manchester rivals braced to battle for final WSL Champions League spot",
    "url": "https://www.theguardian.com/football/2025/may/03/manchester-rivals-braced-to-battle-for-final-wsl-champions-league-spot",
    "summary": "<p>United and City meet at Old Trafford on Sunday with European qualification on the line</p><p>If Manchester United’s women avoid defeat on Sunday, they will secure a place in Europe for only the second time and to make it even sweeter, would do so at the expense of Manchester City, who would be consigned to fourth spot and a season without Women’s Champions League football.</p><p>Throw in that City are the visitors to Old Trafford for Sunday’s midday kick-off and it becomes one of the most pivotal games of this WSL campaign and a decisive one for the clubs’ medium-term trajectories.</p> <a href=\"https://www.theguardian.com/football/2025/may/03/manchester-rivals-braced-to-battle-for-final-wsl-champions-league-spot\">Continue reading...</a>",
    "date": "2025-05-03T11:00:35",
    "source": "Guardian"
  },
  {
    "title": "Villa motivated to keep Champions league 'dream' alive - Emery",
    "url": "https://www.bbc.com/sport/football/videos/c86jzj4747go",
    "summary": "Aston Villa boss Unai Emery says his side remain motivated to achieve their \"dream\" of playing in the Champions League next season following their 1-0 win over Fulham.",
    "date": "2025-05-03T14:45:49",
    "source": "BBC"
  },
  {
    "title": "It feels great to be back to winning ways - Van Nistelrooy",
    "url": "https://www.bbc.com/sport/football/videos/c8rgzg4kd4do",
    "summary": "Ruud van Nistelrooy praises his Leicester City side after scoring at home for the first time since December 8th in a 2-0 win over struggling Southampton, he says \"it's good to finish the season with positivity.\"",
    "date": "2025-05-03T16:55:44",
    "source": "BBC"
  },
  {
    "title": "Moyes disappointed after letting two-goal lead slip",
    "url": "https://www.bbc.com/sport/football/videos/cvg909r18eyo",
    "summary": "Everton boss David Moyes says he is disappointed after Everton allow Ipswich to come from two goals down to draw 2-2 in the Toffees' penultimate game at Goodison Park.",
    "date": "2025-05-03T17:13:17",
    "source": "BBC"
  },
  {
    "title": "The players are still fighting for the club - McKenna",
    "url": "https://www.bbc.com/sport/football/videos/cn4je7q4glzo",
    "summary": "Ipswich manager Kieran McKenna is proud of his team's fighting performance after they came from two goals down to draw 2-2 against Everton at Goodison Park.",
    "date": "2025-05-03T17:13:15",
    "source": "BBC"
  },
  {
    "title": "Swifts beat Reds on penalties to win first Irish Cup",
    "url": "https://www.bbc.com/sport/articles/creqyq4n118o",
    "summary": "Ten-man Dungannon Swifts win their first ever Irish Cup 4-3 on penalties after a spirited display helps them beat Cliftonville in the final at Windsor Park in a game which ended 1-1 after extra-time.",
    "date": "2025-05-03T16:22:46",
    "source": "BBC"
  },
  {
    "title": "Fulham showed great spirit, commitment and attitude - Silva",
    "url": "https://www.bbc.com/sport/football/videos/cewgegnyvpko",
    "summary": "Fulham manager Marco Silva says his side showed \"great spirit, commitment and attitude\" despite losing 1-0 against Aston Villa at Villa Park.",
    "date": "2025-05-03T14:45:46",
    "source": "BBC"
  },
  {
    "title": "Leicester 'worthy winners' - Southampton's Rusk on defeat",
    "url": "https://www.bbc.com/sport/football/videos/cn91r21jn98o",
    "summary": "Southampton's caretaker manager, Simon Rusk says Leicester were \"worthy winners\" as the Foxes beat his side 2-0 in the Premier League at the King Power Stadium.",
    "date": "2025-05-03T16:55:41",
    "source": "BBC"
  },
  {
    "title": "Italian Open schedule: World No 1 Sinner returns after doping ban",
    "url": "https://www.skysports.com/tennis/news/12040/13360802/italian-open-2025-draw-and-schedule-for-emma-raducanu-jack-draper-jannik-sinner-plus-how-to-watch-on-sky-sports",
    "summary": "The wait is over as world No 1 Jannik Sinner returns to action in his first event following his three-month suspension after a doping ban.",
    "date": "Sat, 03 May 2025 17:25:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Vardy nets 199th Leicester goal to condemn Saints to bottom spot",
    "url": "https://www.skysports.com/football/leicester-city-vs-southampton/report/506154",
    "summary": "Jamie Vardy scored his 199th goal for Leicester as they earned a 2-0 win to confirm that relegated Southampton will finish bottom of the Premier League.",
    "date": "Sat, 03 May 2025 17:00:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Lulamba exacts revenge over Poniros at Punchestown",
    "url": "https://www.skysports.com/racing/news/12040/13360978/punchestown-lulamba-strikes-in-ballymore-champion-four-year-old-hurdle-for-nicky-henderson",
    "summary": "Lulamba turned the tables on his Cheltenham Festival conqueror Poniros to land the Ballymore Champion Four Year Old Hurdle at Punchestown.",
    "date": "Sat, 03 May 2025 17:46:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Norris wins Miami Sprint, Hamilton third, Verstappen demoted after Antonelli clash LIVE!",
    "url": "https://www.skysports.com/f1/live-blog/12040/13359962/f1-miami-gp-live-race-sprint-qualifying-practice-updates-results-stream-highlights-from-us-event",
    "summary": "",
    "date": "Fri, 02 May 2025 23:40:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Enciso stunner inspires Ipswich to comeback draw with Everton",
    "url": "https://www.skysports.com/football/everton-vs-ipswich-town/report/506153",
    "summary": "Julio Enciso's stunning long-range effort inspired Ipswich to come back from two goals down to draw 2-2 against Everton.",
    "date": "Sat, 03 May 2025 17:00:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Ruling Court grabs 2000 Guineas glory for Buick and Appleby",
    "url": "https://www.skysports.com/racing/news/12040/13360738/2000-guineas-ruling-court-grabs-classic-glory-for-william-buick-and-charlie-appleby-at-newmarket",
    "summary": "Ruling Court, trained by Charlie Appleby and ridden by William Buick, cane out on top in the Betfred 2000 Guineas at Newmarket.",
    "date": "Sat, 03 May 2025 15:56:00 BST",
    "source": "SkySports"
  },
  {
    "title": "DISASTER for Leclerc as he crashes out before Sprint even begins!",
    "url": "https://www.skysports.com/watch/video/13360803/miami-grand-prix-disaster-for-charles-leclerc-as-he-crashes-out-before-sprint-even-begins",
    "summary": "Charles Leclerc was caught in heavy rain and crashed into the wall before the Sprint started at the Miami Grand Prix.",
    "date": "Sat, 03 May 2025 16:38:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Leigh battle past Catalans in Magic Weekend opener",
    "url": "https://www.skysports.com/rugby-league/leigh-vs-catalans/report/61039",
    "summary": "Leigh Leopards battled past Catalans Dragons for a close 26-24 victory in the 2025 Magic Weekend opener at Newcastle United&#8217;s St James&#8217; Park.",
    "date": "Sat, 03 May 2025 12:16:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Access all areas! Incredible dressing room insight before Magic Weekend clash!",
    "url": "https://www.skysports.com/watch/video/13360624/magic-weekend-access-all-areas-incredible-dressing-room-insight-before-super-league-clash",
    "summary": "Steve McNamara's insightful dressing room talk before Catalans Dragons' match against Leigh Leopards on Magic Weekend!",
    "date": "Sat, 03 May 2025 14:52:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Tielemans header keeps Villa's Champions League hopes alive",
    "url": "https://www.skysports.com/watch/video/13360586/aston-villa-1-0-fulham-premier-league-highlights",
    "summary": "FREE TO WATCH: Highlights from Aston Villa's win against Fulham in the Premier League.",
    "date": "Sat, 03 May 2025 17:15:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Arsenal v Bournemouth: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/may/03/arsenal-v-bournemouth-premier-league-live",
    "summary": "<ul><li>Premier League updates from the 5.30pm BST kick-off</li><li><a href=\"https://www.theguardian.com/football/live\">Live scoreboard</a> | <a href=\"https://www.theguardian.com/football/tables\">Latest tables</a> | <a href=\"mailto:scott.murray.casual@theguardian.com\">And you can email Scott</a></li></ul><p><strong>Bournemouth get the ball rolling.</strong> Zabarnyi goes long down the right, looking for Tavernier. Too long. Goal kick.</p><p><strong>The teams are out!</strong> Arsenal in their famous red shirts with white sleeves, Bournemouth in a third kit which <em>[MBM reporter squints, adjusts pince-nez]</em> “draws its inspiration from our seaside roots, finished in deep lagoon green with an aquatic themed design on the front featuring subtle seashells and waves.” We’ll kick off after a verse or two of North London Forever.</p> <a href=\"https://www.theguardian.com/football/live/2025/may/03/arsenal-v-bournemouth-premier-league-live\">Continue reading...</a>",
    "date": "2025-05-03T17:05:07",
    "source": "Guardian"
  },
  {
    "title": "Hirst caps Ipswich fightback to spoil Everton’s Goodison farewell party",
    "url": "https://www.theguardian.com/football/2025/may/03/everton-ipswich-premier-league-match-report",
    "summary": "<p>The penultimate game at Goodison Park proved an occasion for relegated Ipswich to savour far more than their obliging hosts. Everton were two goals up and cruising towards a second win in 10 games when Julio Enciso changed the complexion of the contest with a stunning finish.</p><p>Substitute George Hirst completed the fightback by Kieran McKenna’s spirited side with a late header. This was a big opportunity squandered by David Moyes’ team. Everton’s energy and composure declined markedly after taking a two goal lead and Ipswich’s punishment, and point, was merited.</p> <a href=\"https://www.theguardian.com/football/2025/may/03/everton-ipswich-premier-league-match-report\">Continue reading...</a>",
    "date": "2025-05-03T16:19:33",
    "source": "Guardian"
  },
  {
    "title": "Vardy ends Leicester’s home drought to keep Southampton stuck on 11 points",
    "url": "https://www.theguardian.com/football/2025/may/03/leicester-southampton-premier-league-match-report",
    "summary": "<p>Jamie Vardy ended Leicester’s long wait for a home goal in the Premier League as they defeated Southampton 2-0 in a clash between two already relegated teams.</p><p>Vardy’s opener at the King Power Stadium was the 38-year-old’s 199th goal in a Leicester shirt and set Ruud van Nistelrooy’s side on their way to a first win since January. Jordan Ayew added a second before half-time for the Foxes to leave Southampton still needing one more point to avoid a share of the competition’s lowest-ever total – Derby’s 11 from 2007-08.</p> <a href=\"https://www.theguardian.com/football/2025/may/03/leicester-southampton-premier-league-match-report\">Continue reading...</a>",
    "date": "2025-05-03T16:16:38",
    "source": "Guardian"
  },
  {
    "title": "European football: Kane’s Bayern Bundesliga title party delayed again",
    "url": "https://www.theguardian.com/football/2025/may/03/european-football-bayern-munich-bundesliga-title-delay-barcelona-la-liga",
    "summary": "<ul><li>RB Leipzig’s Poulsen strikes in injury time to seal 3-3 draw</li><li>Bayern can still be crowned champions on Sunday</li></ul><p><strong>RB Leipzig</strong>’s Yussuf Poulsen scored a stoppage-time goal to snatch a 3-3 draw against Bundesliga leaders <strong>Bayern Munich</strong> on Saturday and delay the Bavarians’ title celebrations by at least a day. Poulsen struck seconds before the end to leave Bayern on 76 points, nine ahead of Leverkusen, who travel to Freiburg on Sunday. Bayern, with two games left to play, will secure their 34th league crown should Leverkusen fail to win.</p><p>It was supposed to be triumphant afternoon for Bayern, but they found themselves on the back foot from the start with the hosts piling on early pressure. Leipzig had two big chances before Benjamin Sesko completed a quick break with a superbly curled shot past Jonas Urbig in the 11th minute.</p> <a href=\"https://www.theguardian.com/football/2025/may/03/european-football-bayern-munich-bundesliga-title-delay-barcelona-la-liga\">Continue reading...</a>",
    "date": "2025-05-03T15:47:16",
    "source": "Guardian"
  },
  {
    "title": "Eze does it: England footballer wins celebrity chess tournament",
    "url": "https://www.theguardian.com/football/2025/may/03/eze-does-it-england-footballer-wins-celebrity-chess-tournament",
    "summary": "<ul><li>Eberechi Eze beats YouTuber Sapnap in final</li><li>Crystal Palace player was taught chess by Michael Olise</li></ul><p>Eberechi Eze has followed up his starring role in Crystal Palace’s <a href=\"https://www.theguardian.com/football/2025/apr/26/crystal-palace-aston-villa-fa-cup-semi-final-match-report\">FA Cup semi-final win</a> with another personal success: first place in an online celebrity chess tournament. The 26-year-old England international, who scored as Palace beat Villa 3-0 at Wembley last Saturday, won Chess.com’s four-day, 12-player amateur PogChamps tournament, involving athletes and content creators.</p><p><a href=\"https://www.twitch.tv/chess/clip/ColorfulFrailSmoothieArsonNoSexy-BAmW7_HJqRqg0gVZ\">Eze beat the American YouTuber</a><strong><a href=\"https://www.twitch.tv/chess/clip/ColorfulFrailSmoothieArsonNoSexy-BAmW7_HJqRqg0gVZ\"> </a></strong><a href=\"https://www.twitch.tv/chess/clip/ColorfulFrailSmoothieArsonNoSexy-BAmW7_HJqRqg0gVZ\">Sapnap</a> 2-0 in the final, livestreamed on Twitch, winning the $20,000 (£15,000) top prize. Chess.com said Eze “showed that he’s as good at defending as he is at attacking”, taking advantage of Sapnap who “missed a key attacking idea, which led to an unfortunate brain fart and piece blunder”.</p> <a href=\"https://www.theguardian.com/football/2025/may/03/eze-does-it-england-footballer-wins-celebrity-chess-tournament\">Continue reading...</a>",
    "date": "2025-05-03T14:55:36",
    "source": "Guardian"
  },
  {
    "title": "Lamine Yamal: the perfect dopamine-hit footballer for our terminally online world | Barney Ronay",
    "url": "https://www.theguardian.com/football/2025/may/03/lamine-yamal-barcelona-dopamine-hit-footballer",
    "summary": "<p>Barcelona’s 17-year-old forward is a once-every-20-years talent who is causing the internet to spasm with man-worship</p><p>There’s always that guy. Never be that guy. Fight the urge to become that guy, to yearn always for the old, good, safe things, to feel headphone-panic and selfie-disgust, to see moral decay in haircuts. Except, sometimes it turns out you just are that guy, propped up in your easy chair, eyes blazing, smelling slightly of damp laundry, and holding forth on a theme as old as all human life.</p><p>That theme is always the same. You know that thing you like? Well, it’s actually bad. And in a way that I will now explain at great length. So here he comes again, that guy. And this time he’s talking about Lamine Yamal. Enjoyed that, did you?</p> <a href=\"https://www.theguardian.com/football/2025/may/03/lamine-yamal-barcelona-dopamine-hit-footballer\">Continue reading...</a>",
    "date": "2025-05-03T07:00:33",
    "source": "Guardian"
  },
  {
    "title": "Vardy the best £1m ever spent - Shearer",
    "url": "https://www.bbc.com/sport/football/videos/c2kve49e8neo",
    "summary": "Match of the Day pundits Alan Shearer and Joe Hart heap praise on departing Leicester striker Jamie Vardy after his goal against Southampton.",
    "date": "2025-05-03T22:50:46",
    "source": "BBC"
  },
  {
    "title": "How Bournemouth turned tables on set-piece specialists Arsenal",
    "url": "https://www.bbc.com/sport/football/videos/cly2ed2kze9o",
    "summary": "Match of the Day pundit Joe Hart shows how \"streetwise\" Bournemouth punished Arsenal from set-pieces.",
    "date": "2025-05-03T22:40:19",
    "source": "BBC"
  },
  {
    "title": "It's been everything to me - Vardy on Leicester career",
    "url": "https://www.bbc.com/sport/football/videos/cj9ekzep910o",
    "summary": "Leicester striker Jamie Vardy tells Match of the Day host Gary Lineker what his time at the club has meant to him after he scored his 199th goal for the Foxes.",
    "date": "2025-05-03T19:25:34",
    "source": "BBC"
  },
  {
    "title": "Arsenal to use 'anger and rage' of Bournemouth loss against PSG",
    "url": "https://www.bbc.com/sport/football/articles/cz01v8kee24o",
    "summary": "Arsenal will use the \"anger, rage and frustration\" from their home loss to Bournemouth against PSG on Wednesday, says boss Mikel Arteta.",
    "date": "2025-05-03T21:00:01",
    "source": "BBC"
  },
  {
    "title": "'Pretty special' - Leeds and Burnley's fight for Championship title",
    "url": "https://www.bbc.com/sport/football/articles/cdjlv2e02dyo",
    "summary": "Leeds United and Burnley both reached 100 points in the Championship, a first in a season for the division. BBC Sport explores why both sides were so dominant.",
    "date": "2025-05-03T18:05:56",
    "source": "BBC"
  },
  {
    "title": "Nkunku wants to leave Chelsea - Sunday's gossip",
    "url": "https://www.bbc.com/sport/football/articles/ckg2envl30xo",
    "summary": "Chelsea's Christopher Nkunku wants to leave the club, Aston Villa may struggle to sign Marcus Rashford if they do not qualify for Champions League football and Bournemouth centre-back Dean Huijsen has interest from multiple clubs.",
    "date": "2025-05-03T19:27:47",
    "source": "BBC"
  },
  {
    "title": "'Painful but we'll be back' - Luton's rise and fall",
    "url": "https://www.bbc.com/sport/football/articles/cm2x6ky8x24o",
    "summary": "Luton's relegation last year was forgivable but there will be less understanding after they went down again, this time to League One.",
    "date": "2025-05-03T18:04:01",
    "source": "BBC"
  },
  {
    "title": "Milestone-chasing Vardy not ready to blow whistle on Leicester career",
    "url": "https://www.bbc.com/sport/football/articles/c1me4pdpl32o",
    "summary": "Jamie Vardy is not quite ready to blow the whistle on his legendary Leicester City career, after reaching 199 goals for the club.",
    "date": "2025-05-03T19:23:40",
    "source": "BBC"
  },
  {
    "title": "How Eustace's 'huge risk' kept Derby in Championship",
    "url": "https://www.bbc.com/sport/football/articles/c9qwzx92w1go",
    "summary": "Boss John Eustace discusses Derby County's Premier League ambition after keeping them in the Championship.",
    "date": "2025-05-03T17:51:11",
    "source": "BBC"
  },
  {
    "title": "Watch: Saturday's Scottish Premiership highlights",
    "url": "https://www.bbc.com/sport/videos/c0783m44937o",
    "summary": "Watch highlights of Saturday's five Scottish Premiership games, all with significance in the race to finish third and to avoid relegation.",
    "date": "2025-05-03T21:38:01",
    "source": "BBC"
  },
  {
    "title": "Arteta vows Arsenal will turn ‘rage, anger, frustration’ of defeat on PSG",
    "url": "https://www.theguardian.com/football/2025/may/03/arteta-vows-arsenal-will-turn-their-frustration-on-paris-saint-germain",
    "summary": "<ul><li>Arsenal threw away lead in 2-1 defeat by Bournemouth</li><li>Manager demands ‘massive performance’ in Paris </li></ul><p>Mikel Arteta promised to channel the frustration of <a href=\"https://www.theguardian.com/football/2025/may/03/arsenal-bournemouth-premier-league-match-report\">Arsenal’s 2-1 home defeat against Bournemouth</a> on Saturday into the mission to beat Paris Saint-Germain in their Champions League semi-final.</p><p>The manager endured the worst preparations for Wednesday night’s second leg in Paris, where Arsenal will attempt to turn around <a href=\"https://www.theguardian.com/football/2025/apr/29/champions-league-semi-final-arsenal-psg-match-report\">a 1-0 deficit</a>, going strong with his starting lineup and watching Bournemouth come from behind in the second half.</p> <a href=\"https://www.theguardian.com/football/2025/may/03/arteta-vows-arsenal-will-turn-their-frustration-on-paris-saint-germain\">Continue reading...</a>",
    "date": "2025-05-03T20:49:25",
    "source": "Guardian"
  },
  {
    "title": "The league title is in the bag, so will Arne Slot ring the changes at Liverpool? | Andy Hunter",
    "url": "https://www.theguardian.com/football/2025/may/03/liverpool-premier-league-arne-slot-changes-conor-bradley-wataru-endo-harvey-elliott-federico-chiesa",
    "summary": "<p>The last four games can give Bradley, Endo, Elliott, Quansah and Chiesa the chance to shine in the Reds’ ‘certain rotation’</p><p>The celebrations have not finished yet and will crank back up when Liverpool are presented with and parade the Premier League trophy at the end of the month. However, Arne Slot’s thoughts are already turning towards next season’s title defence. “It’s the end of the season,” he said on Friday, “but we also have to look at this as the start of next season.”</p><p>With that in mind, the Liverpool head coach plans “a certain rotation” for the champions’ final four games against Chelsea, Arsenal, Brighton and Crystal Palace. Having stuck with the same core group throughout the title-winning campaign, here is a look at the changes Slot could, and should, have lined up:</p> <a href=\"https://www.theguardian.com/football/2025/may/03/liverpool-premier-league-arne-slot-changes-conor-bradley-wataru-endo-harvey-elliott-federico-chiesa\">Continue reading...</a>",
    "date": "2025-05-03T19:00:45",
    "source": "Guardian"
  },
  {
    "title": "Arteta’s refusal to ring Arsenal changes keeps doom spiral firmly locked in | Ed Aarons",
    "url": "https://www.theguardian.com/football/2025/may/03/artetas-refusal-ring-arsenal-changes-keeps-doom-spiral-locked-in",
    "summary": "<p>Head coach largely sticks with limp side that lost to PSG and is handed another defeat by Bournemouth for the privilege </p><p>As his side chased an equaliser in the dying moments, Mikel Arteta stood with his arms folded on the touchline and shook his head in utter disbelief.</p><p>Only the embrace of Andoni Iraola, his old friend from their days growing up at the local club Antiguoko Kirol Elkartea in San Sebastián, as the final whistle sounded broke the Arsenal manager’s stare as he contemplated <a href=\"https://www.theguardian.com/football/2025/may/03/arsenal-bournemouth-premier-league-match-report\">another frustrating afternoon</a> that summed up their disappointing Premier League campaign.</p> <a href=\"https://www.theguardian.com/football/2025/may/03/artetas-refusal-ring-arsenal-changes-keeps-doom-spiral-locked-in\">Continue reading...</a>",
    "date": "2025-05-03T19:48:36",
    "source": "Guardian"
  },
  {
    "title": "Real Madrid’s toxic targeting of referees is a symbol of the Spanish grandees’ decline | Jonathan Wilson",
    "url": "https://www.theguardian.com/football/2025/may/03/real-madrids-toxic-targeting-of-referees-is-a-symbol-of-the-spanish-grandees-decline",
    "summary": "<p>Super League patron Florentino Pérez sets the tone with his destructive acts of pettiness, dragging down a once noble club</p><p>Referees have never been so disdained and despised as they are now. Those who do not think they are corrupt, think they are incompetent. Standards, apparently, have never been lower. Clubs and their fans rage about conspiracies. But even in the present context, the scenes at the end of last <a href=\"https://www.theguardian.com/football/2025/apr/27/barcelona-real-madrid-copa-del-rey-match-report\">Saturday’s Copa del Rey final</a> were unprecedented as Antonio Rüdiger <a href=\"https://www.bbc.co.uk/sport/football/articles/ckge9rp8379o\">threw an ice-pack </a>at the referee Ricardo de Burgos Bengoetxea.</p><p>And to think this is a club that used to pride itself on its sense of its <em>señorio</em>, its gentlemanliness, to the extent that in Steve McManaman’s day players were given a code of conduct; the familiar line used to be whingeing about referees was for the <a href=\"https://www.mundodeportivo.com/20110429/real-madrid/chamartin-siempre-ha-llorado-por-los-arbitros_54147404976.html\">cry-babies of Barcelona</a>.</p> <a href=\"https://www.theguardian.com/football/2025/may/03/real-madrids-toxic-targeting-of-referees-is-a-symbol-of-the-spanish-grandees-decline\">Continue reading...</a>",
    "date": "2025-05-03T19:00:45",
    "source": "Guardian"
  },
  {
    "title": "MP calls for trials of lifting drinking ban in English football stands",
    "url": "https://www.theguardian.com/sport/2025/may/03/mp-luke-charters-calls-for-trials-of-lifting-drinking-ban-in-english-football-stands",
    "summary": "<p>Labour’s Luke Charters says allowing alcohol in the top five tiers of the men’s game would be the ‘modern approach’</p><p>A Labour MP has called for trials to assess the impact of lifting a decades-long ban on drinking alcohol in football stands.</p><p>York Outer MP Luke Charters said football needs to take a “modern approach” to the issue in a debate on the football governance bill earlier this week.</p> <a href=\"https://www.theguardian.com/sport/2025/may/03/mp-luke-charters-calls-for-trials-of-lifting-drinking-ban-in-english-football-stands\">Continue reading...</a>",
    "date": "2025-05-03T16:51:24",
    "source": "Guardian"
  },
  {
    "title": "How relegated clubs bouncing back to the Premier League makes the rich richer | Philippe Auclair",
    "url": "https://www.theguardian.com/football/2025/may/03/how-relegated-clubs-bouncing-back-to-the-premier-league-makes-the-rich-richer",
    "summary": "<p>Parachute payments system benefits the elite when teams such as Burnley and Leeds rejoin top tier within three years</p><p>For the second year running, all three clubs promoted from the Championship to the Premier League will make an immediate return to the second tier. It would be tempting to say this is the natural order of things given the financial challenges faced by clubs suddenly thrown into the world’s richest domestic football competition.</p><p>Even when they do spend huge amounts in order to give themselves a chance of survival, as Southampton and Ipswich did, <a href=\"https://www.theguardian.com/football/ng-interactive/2024/may/28/mens-transfer-window-summer-2024-premier-league-la-liga-serie-a-bundesliga-ligue-1\">respectively spending</a> £62.8m and £106m net in the summer of 2024, the gap appears too big to close. Yet what has happened to them used to be an exceptional occurrence.</p><p><em><strong>Do you have an opinion on the issues raised in this article? If you would like to submit a response of up to 300 words by email to be considered for publication in our<a href=\"https://www.theguardian.com/tone/letters\"> letters</a> section, please <a href=\"mailto:guardian.letters@theguardian.com?body=Please%20include%20your%20name,%20full%20postal%20address%20and%20phone%20number%20underneath%20your%20letter.%20Letters%20are%20usually%20published%20with%20the%20author%E2%80%99s%20name%20and%20city/town/village.%20The%20rest%20of%20the%20information%20is%20for%20verification%20only%20and%20to%20contact%20you%20if%20your%20letter%20is%20used.\">click here</a>.</strong></em></p> <a href=\"https://www.theguardian.com/football/2025/may/03/how-relegated-clubs-bouncing-back-to-the-premier-league-makes-the-rich-richer\">Continue reading...</a>",
    "date": "2025-05-03T07:00:32",
    "source": "Guardian"
  }
]