[
  {
    "title": "'If you don't prepare right, you will pay' - fears rise over Chelsea form",
    "url": "https://www.bbc.com/sport/football/articles/cz951g9vdxdo",
    "summary": "Chelsea may be through to the semi-finals of the Europa Conference League, but the boos that followed their surprise defeat by Legia Warsaw summed up the current mood of dissent at Stamford Bridge.",
    "date": "2025-04-17T23:51:09",
    "source": "BBC"
  },
  {
    "title": "Twenty unexpected stars of the season in the Premier League",
    "url": "https://www.theguardian.com/football/who-scored-blog/2025/apr/17/unexpected-stars-season-premier-league",
    "summary": "<p>They may not win end-of-year awards, but these players have been essential for their teams</p><p>By <a href=\"https://www.whoscored.com/\">WhoScored</a></p><p>Arsenal’s decision not to sign a striker in January could have come back to haunt them. Gabriel Jesus has been absent since the turn of the year and Kai Havertz suffered a torn hamstring in February, leaving them short in the final third. Mikel Merino filled the void admirably. Indeed, only Havertz (nine) has more league goals for the club this season than Merino (six), who scored in important wins over Leicester, Chelsea and Fulham. Fans will want the club to invest in the summer but Merino has done remarkably well, given he had not played up front since he was nine years old.</p> <a href=\"https://www.theguardian.com/football/who-scored-blog/2025/apr/17/unexpected-stars-season-premier-league\">Continue reading...</a>",
    "date": "2025-04-17T08:28:06",
    "source": "Guardian"
  },
  {
    "title": "Reality bites as Madrid’s Champions League remontada turns to dust",
    "url": "https://www.theguardian.com/football/2025/apr/17/real-madrid-remontada-champions-league-carlo-ancelotti-thibaut-courtois",
    "summary": "<p>Carlo Ancelotti’s pleas went unanswered with his side’s limp exit a damning indictment of collective failings this season</p><p>Jude Bellingham saw the videos, listened to the stories and <a href=\"https://www.theguardian.com/football/2025/apr/15/jude-bellingham-targets-remontada-on-night-thats-made-for-real-madrid\">heard the word </a><em><a href=\"https://www.theguardian.com/football/2025/apr/15/jude-bellingham-targets-remontada-on-night-thats-made-for-real-madrid\">remontada</a></em> “a million times”, but it was easier said than done. “There is no magic,” Carlo Ancelotti warned. In the end there was nothing really, just another glimpse of reality, the true story of their season: a chronicle of a death foretold. No epic, no comeback, not even much mystique, and certainly not much football. This time, <a href=\"https://www.theguardian.com/football/2025/apr/16/real-madrid-arsenal-champions-league-quarter-final-second-leg-match-report\">Real Madrid could not escape themselves</a>.</p><p>“This is the other side of football,” Ancelotti said after the match. “There’s a happy part, which we have experienced many times, and a sad part which is today. We have to accept it, and the ‘sticks’, the criticisms, that will come. Over the two games Arsenal were better than us.”</p> <a href=\"https://www.theguardian.com/football/2025/apr/17/real-madrid-remontada-champions-league-carlo-ancelotti-thibaut-courtois\">Continue reading...</a>",
    "date": "2025-04-17T14:20:24",
    "source": "Guardian"
  },
  {
    "title": "France’s Sakina Karchaoui: ‘If everyone brings their own little madness, it will make us win’",
    "url": "https://www.theguardian.com/football/2025/apr/17/france-psg-sakina-karchaoui-interview-moving-the-goalposts",
    "summary": "<p>PSG player on her reinvention in midfield, Euro 2025 confidence and how she embraces her role-model status</p><p>Sakina Karchaoui is one of the most popular players in the France team. Perhaps the most popular. But when she joins us at 9am at Clairefontaine, the national centre of French football, <em>Les Bleues’</em> No 7 appears quite shy. Wearing a blue tracksuit emblazoned with the French rooster, she smiles for the first time when Kenza Dali teases her: “Interview for the Guardian … in English please, Saki!”</p><p>Spring has finally sprung in the French capital and for the native of Salon-de-Provence, in southern France, the prospect of training in the sunshine is another reason to smile. “We are almost ready for the Euros,” Karchaoui says as she looks at the training ground below. “We work a lot tactically with the coach, we work technically, physically, all aspects of football. I think we can win many things together; we’ve got so much talent. And if everyone brings their own little madness, their own experience and their own qualities to the group, that’s what will make us win.”</p> <a href=\"https://www.theguardian.com/football/2025/apr/17/france-psg-sakina-karchaoui-interview-moving-the-goalposts\">Continue reading...</a>",
    "date": "2025-04-17T10:47:26",
    "source": "Guardian"
  },
  {
    "title": "'More than a miracle' - how Man Utd won in remarkable extra time",
    "url": "https://www.bbc.com/sport/football/articles/c2der373ww2o",
    "summary": "Manchester United complete a remarkable comeback against Lyon to reach the Europa League semi-finals.",
    "date": "2025-04-17T23:49:54",
    "source": "BBC"
  }
]