[
  {
    "title": "Widely mocked, wildly celebrated - how Chelsea won the Conference League",
    "url": "https://www.bbc.com/sport/football/articles/c1kv09gp3w9o",
    "summary": "Wholesale changes and 7,000-mile round trips - BBC Sport tells the story of how Chelsea won the Conference League.",
    "date": "2025-05-28T22:58:01",
    "source": "BBC"
  },
  {
    "title": "'Genius' Palmer 'made the difference' against Real Betis",
    "url": "https://www.bbc.com/sport/football/articles/c629vgwx5llo",
    "summary": "Cole Palmer was called a \"genius\" after inspiring Chelsea to victory against Real Betis in the Conference League final.",
    "date": "2025-05-28T23:32:48",
    "source": "BBC"
  },
  {
    "title": "Fans arrested after clashes before Conference League final",
    "url": "https://www.bbc.com/sport/football/articles/cgkdzk461jko",
    "summary": "Police arrest 28 fans in the Polish city of Wroclaw after clashes between Chelsea and Real Betis fans before the Uefa Conference League final.",
    "date": "2025-05-28T21:03:05",
    "source": "BBC"
  },
  {
    "title": "Zubimendi set for medical before £51m Arsenal move",
    "url": "https://www.bbc.com/sport/football/articles/c071mlpjxxko",
    "summary": "Real Sociedad midfielder Martin Zubimendi is set to have a medical before completing a £51m switch to Arsenal.",
    "date": "2025-05-28T11:31:32",
    "source": "BBC"
  },
  {
    "title": "Man Utd booed off after defeat in Malaysia",
    "url": "https://www.bbc.com/sport/football/articles/c79e79yq9q1o",
    "summary": "Manchester United head coach Ruben Amorim believes it will do his players good to leave Kuala Lumpur with the sound of boos ringing in their ears after a 1-0 loss to ASEAN All-Stars.",
    "date": "2025-05-28T18:13:31",
    "source": "BBC"
  },
  {
    "title": "Ancelotti positive after Rangers meeting - but could Modric follow?",
    "url": "https://www.bbc.com/sport/football/articles/cvgv4xvqe00o",
    "summary": "Davide Ancelotti held fresh talks with Rangers about their managerial vacancy in London last week and further discussions are planned over the next few days.",
    "date": "2025-05-28T14:28:27",
    "source": "BBC"
  },
  {
    "title": "England's Morris out of Euros after second ACL injury",
    "url": "https://www.bbc.com/sport/football/articles/cn7ze01n62po",
    "summary": "Defender Ella Morris has suffered an anterior cruciate ligament (ACL) injury in training with England and will miss Euro 2025.",
    "date": "2025-05-28T20:13:04",
    "source": "BBC"
  },
  {
    "title": "Earps retires - where does that leave England?",
    "url": "https://www.bbc.com/sport/football/articles/c3v5n0lgqqro",
    "summary": "Mary Earps' sudden retirement from international football leaves England in an unexpected situation with five weeks to go until Euro 2025. Where do they go from here?",
    "date": "2025-05-28T11:08:17",
    "source": "BBC"
  },
  {
    "title": "Head coach Muslic to leave Plymouth amid Schalke link",
    "url": "https://www.bbc.com/sport/football/articles/c308jl855jdo",
    "summary": "Plymouth Argyle head coach Miron Muslic is to leave the club after opening talks with a German side, reported to be Schalke.",
    "date": "2025-05-28T20:07:29",
    "source": "BBC"
  },
  {
    "title": "Real Madrid join Wirtz fight - Thursday's gossip",
    "url": "https://www.bbc.com/sport/football/articles/c8xg109qxj8o",
    "summary": "Liverpool face competition for Bayer Leverkusen winger Florian Wirtz from Real Madrid, Arsenal told fee for RB Leipzig striker Benjamin Sesko, while Manchester United and Chelsea pursuit of Ipswich forward Liam Delap intensifies.",
    "date": "2025-05-28T20:59:41",
    "source": "BBC"
  },
  {
    "title": "Police get more time to question Liverpool parade suspect",
    "url": "https://www.bbc.com/news/articles/c9wgvzyngn4o",
    "summary": "Police get an extension to continue questioning a man arrested on suspicion of attempted murder.",
    "date": "2025-05-28T17:07:02",
    "source": "BBC"
  },
  {
    "title": "Earps 'elevated levels of goalkeeping' - Brown-Finnis",
    "url": "https://www.bbc.com/sport/videos/ckgqkepk49lo",
    "summary": "Former England keeper Rachel Brown-Finnis says Mary Earps has \"elevated levels of goalkeeping\". \nEarps announced her retirement from international football on Tuesday.",
    "date": "2025-05-28T09:39:05",
    "source": "BBC"
  },
  {
    "title": "Chelsea fans ready for Conference League final",
    "url": "https://www.bbc.com/sport/videos/cx2qdzd414xo",
    "summary": "Chelsea fans speak to BBC Sport's Joe Wilson before their Conference League final against Real Betis on Wednesday in Wroclaw, Poland.",
    "date": "2025-05-28T11:24:46",
    "source": "BBC"
  },
  {
    "title": "Why does Cunha want Man Utd move and where does he fit?",
    "url": "https://www.bbc.com/sport/football/articles/cn4gjy3wxr3o",
    "summary": "With Matheus Cunha's transfer from Wolves to Manchester United at an advanced stage, BBC Sport looks at the impact the Brazil forward can make at Old Trafford.",
    "date": "2025-05-28T05:23:30",
    "source": "BBC"
  },
  {
    "title": "Ferdinand to step down from TNT Sports pundit role",
    "url": "https://www.bbc.com/sport/football/articles/cy5eqxn6049o",
    "summary": "Rio Ferdinand announces he is to step down from his role as a pundit on TNT Sports to focus on family and business interests.",
    "date": "2025-05-28T14:39:12",
    "source": "BBC"
  },
  {
    "title": "Football Daily",
    "url": "https://www.bbc.co.uk/sounds/play/p0lf1tnr",
    "summary": "Steve Crossman presents reaction to Chelsea winning the Conference League.",
    "date": "2025-05-28T22:59:00",
    "source": "BBC"
  },
  {
    "title": "Arteta's Arsenal have underachieved - Henry",
    "url": "https://www.bbc.com/sport/football/articles/cqj7wklgw7no",
    "summary": "Former Arsenal captain Thierry Henry says the club have underachieved under manager Mikel Arteta in the past three years.",
    "date": "2025-05-28T10:17:46",
    "source": "BBC"
  },
  {
    "title": "'One of Shankly's favourites' - Liverpool title winner Stevenson dies aged 85",
    "url": "https://www.bbc.com/sport/football/articles/cy8nvdv2x7jo",
    "summary": "Former Rangers and Liverpool midfielder Willie Stevenson - who won top-flight titles in Scotland and England - has died at the age of 85.",
    "date": "2025-05-28T07:45:13",
    "source": "BBC"
  },
  {
    "title": "Roma accuse Zaniolo of 'violent behaviour' towards youth players",
    "url": "https://www.bbc.com/sport/football/articles/cvg7mxd3l76o",
    "summary": "Former Aston Villa midfielder Nicolo Zaniolo is accused of physically striking a Roma youth-team player following a match on Monday.",
    "date": "2025-05-28T13:57:28",
    "source": "BBC"
  },
  {
    "title": "Lego and tattoos - Wales' role model goalkeeper",
    "url": "https://www.bbc.com/sport/football/articles/c628e468vwlo",
    "summary": "Manchester United and Wales goalkeeper Safia Middleton-Patel has already become a role model, despite being just 20 years of age.",
    "date": "2025-05-28T13:36:51",
    "source": "BBC"
  },
  {
    "title": "Teenager Kpakio in Wales squad for qualifiers",
    "url": "https://www.bbc.com/sport/football/articles/clyg992zvjdo",
    "summary": "Wales head coach Craig Bellamy names Cardiff City teenager Ronan Kpakio in his squad for next month's World Cup qualifiers against Liechtenstein and Belgium.",
    "date": "2025-05-28T11:32:13",
    "source": "BBC"
  },
  {
    "title": "Huddersfield appoint Ipswich coach Grant as manager",
    "url": "https://www.bbc.com/sport/football/articles/c4g2png8nz4o",
    "summary": "Huddersfield Town appoint Ipswich Town coach Lee Grant as their new manager on a three-year deal.",
    "date": "2025-05-28T15:34:21",
    "source": "BBC"
  },
  {
    "title": "Striker Kabangu joins Hearts on permanent deal",
    "url": "https://www.bbc.com/sport/football/articles/c3v5n00g522o",
    "summary": "Heart of Midlothian sign striker Elton Kabangu on a permanent deal from Union Saint-Gilloise for an undisclosed fee.",
    "date": "2025-05-28T09:56:25",
    "source": "BBC"
  },
  {
    "title": "Hearts face Dunfermline in League Cup - full draw",
    "url": "https://www.bbc.com/sport/football/articles/c7531007rwro",
    "summary": "Heart of Midlothian's new manager Derek McInnes will face Neil Lennon's Dunfermline Athletic in the group stage of the 2025-26 League Cup.",
    "date": "2025-05-28T12:34:19",
    "source": "BBC"
  },
  {
    "title": "Football Daily",
    "url": "https://www.bbc.co.uk/sounds/play/p0ldy7db",
    "summary": "Aaron Paul, Jobi McAnuff & Lyle Taylor react to the League One and Two play-off finals.",
    "date": "2025-05-28T13:30:00",
    "source": "BBC"
  },
  {
    "title": "The stats do not lie - ranking Africa's Premier League stars",
    "url": "https://www.bbc.com/sport/football/articles/cvgdkyjp84go",
    "summary": "Egypt's Mohamed Salah was the stand-out player in this season's Premier League - but what do the statistics say about other African stars?",
    "date": "2025-05-28T12:36:59",
    "source": "BBC"
  },
  {
    "title": "'Hard to envisage me not being back at Rangers' - Davis",
    "url": "https://www.bbc.com/sport/football/articles/cm26em8ml7ro",
    "summary": "Former Rangers midfielder Steven Davis tells BBC Sport NI that he finds it hard to imagine not returning to the club at some stage in the future in some capacity.",
    "date": "2025-05-28T15:42:11",
    "source": "BBC"
  },
  {
    "title": "Judge in Maradona case accused of behaving like 'actress'",
    "url": "https://www.bbc.com/news/articles/crk2l7r60k0o",
    "summary": "Judge Julieta Makintach has stood down after being criticised for taking part in a documentary.",
    "date": "2025-05-28T01:36:44",
    "source": "BBC"
  },
  {
    "title": "Eddie Howe's Freedom of Newcastle confirmed",
    "url": "https://www.bbc.com/news/articles/cwy7547wg3no",
    "summary": "Councillors grant the Magpies manager the ceremonial status, calling him \"forever a hero\".",
    "date": "2025-05-28T16:10:51",
    "source": "BBC"
  },
  {
    "title": "Incoming Rangers chief to meet contenders - gossip",
    "url": "https://www.bbc.com/sport/football/articles/czj4pn77kzpo",
    "summary": "American health tycoon Andrew Cavenagh, the driving force behind the proposed takeover of Rangers, will meet the frontrunners for the head coach job this week.",
    "date": "2025-05-28T06:58:36",
    "source": "BBC"
  },
  {
    "title": "Chelsea and Cole Palmer storm back at Real Betis to win Conference League",
    "url": "https://www.theguardian.com/football/2025/may/28/real-betis-chelsea-europa-conference-league-final-match-report",
    "summary": "<p>There were 65 minutes on the clock when a chill spread around Stadion Wroclaw and Real Betis’s flame fizzled out. That was the moment when Cold Palmer finally emerged, decided that enough was enough and took an icy hold on a final that was in danger of running away from Chelsea. That was the moment when disaster was averted, Betis’s hopes of winning the Uefa Conference League faded and it became clear that Todd Boehly, Behdad Eghbali and the rest of Chelsea’s leadership team would be on the pitch at full time, drinking it all in after claiming their first piece of silverware in the men’s game since their takeover in 2022.</p><p>The predictability of the outcome did not make the feeling any less sweet for Boehly and Eghbali after a season that began with their differences getting a very public airing. Really, though, this was all about one very special individual. There have been countless signings under this Chelsea ownership but none as smart as the £40m spent on buying Palmer from Manchester City.</p> <a href=\"https://www.theguardian.com/football/2025/may/28/real-betis-chelsea-europa-conference-league-final-match-report\">Continue reading...</a>",
    "date": "2025-05-28T21:07:05",
    "source": "Guardian"
  },
  {
    "title": "Men’s transfer window summer 2025: all deals from Europe’s top five leagues",
    "url": "https://www.theguardian.com/football/ng-interactive/2025/may/28/mens-transfer-window-summer-2025-premier-league-la-liga-bundesliga-serie-a-ligue-1",
    "summary": "<p>All the latest Premier League, La Liga, Bundesliga, Ligue 1 and Serie A deals and a club-by-club guide</p><ul><li><p><a href=\"https://www.theguardian.com/football/ng-interactive/2025/may/28/womens-transfer-window-summer-2025-nwsl-wsl-liga-f-frauen-bundesliga-premiere-ligue-serie-a-femminile\"><strong>Women’s transfers summer 2025: all the moves</strong></a></p></li></ul> <a href=\"https://www.theguardian.com/football/ng-interactive/2025/may/28/mens-transfer-window-summer-2025-premier-league-la-liga-bundesliga-serie-a-ligue-1\">Continue reading...</a>",
    "date": "2025-05-28T10:00:10",
    "source": "Guardian"
  },
  {
    "title": "Manchester United ‘choke’ in defeat by Asean All-Stars on end-of-season tour",
    "url": "https://www.theguardian.com/football/2025/may/28/manchester-united-embarrassed-by-kuala-lumpur-defeat-on-end-of-season-tour",
    "summary": "<ul><li><p>Asean All-Stars 1-0 Manchester United </p></li><li><p>Amorim: ‘We should win these kind of games’</p></li></ul><p>Manchester United’s post-season tour followed their late-season form as Ruben Amorim’s team lost 1-0 to a scratch team of Asean All-Stars in Kuala Lumpur.</p><p>United’s latest defeat, part of a lucrative end-of-season tour in the wake of their 15th-placed finish in the Premier League, came after the players had been paraded through the streets of the Malaysian capital.</p> <a href=\"https://www.theguardian.com/football/2025/may/28/manchester-united-embarrassed-by-kuala-lumpur-defeat-on-end-of-season-tour\">Continue reading...</a>",
    "date": "2025-05-28T16:30:00",
    "source": "Guardian"
  },
  {
    "title": "Sporting tell interested clubs Gyökeres is not leaving for less than €80m",
    "url": "https://www.theguardian.com/football/2025/may/28/sporting-tell-interested-clubs-gyokeres-is-not-leaving-for-less-than-80m",
    "summary": "<ul><li><p>Arsenal may make move for prolific Sweden forward</p></li><li><p>Gyökeres has scored 97 goals in 102 games for Sporting</p></li></ul><p>Sporting have told interested clubs – including Arsenal – that Viktor Gyökeres will cost a fee of €80m (£67m), the Guardian understands.</p><p>The Portuguese champions are prepared to cash in on Gyökeres, who has scored prolifically for them since his £20.5m move from Coventry in the summer of 2023. But although Sporting will not seek the full value of his €100m release clause, they have resolved to hold out for at least €80m.</p> <a href=\"https://www.theguardian.com/football/2025/may/28/sporting-tell-interested-clubs-gyokeres-is-not-leaving-for-less-than-80m\">Continue reading...</a>",
    "date": "2025-05-28T17:01:22",
    "source": "Guardian"
  },
  {
    "title": "Arsenal close to Martín Zubimendi deal after meeting £51m release clause",
    "url": "https://www.theguardian.com/football/2025/may/28/arsenal-close-to-martin-zubimendi-deal-after-agreeing-51m-release-clause-payment",
    "summary": "<ul><li><p>Real Sociedad midfielder has been Arteta’s main target</p></li><li><p>Arsenal remain in hunt for Sesko and Gyökeres</p></li></ul><p>Arsenal are closing in on the ­signing of Martín Zubimendi from Real Sociedad after agreeing to pay the £51m release clause for the Spain&nbsp;midfielder.</p><p>Zubimendi, who turned down a move to Liverpool last summer and has been linked with Real Madrid in recent weeks, is understood to be set for a medical having finalised personal terms for his move to the Premier League. Mikel Arteta made the 26-year-old his primary midfield target this summer as Arsenal attempt to bridge the gap after three successive runners-up finishes in the Premier League.</p> <a href=\"https://www.theguardian.com/football/2025/may/28/arsenal-close-to-martin-zubimendi-deal-after-agreeing-51m-release-clause-payment\">Continue reading...</a>",
    "date": "2025-05-28T12:58:11",
    "source": "Guardian"
  },
  {
    "title": "Transfer roundup: Liverpool’s Kelleher in demand, Everton in Alcaraz talks",
    "url": "https://www.theguardian.com/football/2025/may/28/premier-league-liverpool-caoimhin-kelleher-john-heitinga-ajax-football",
    "summary": "<ul><li><p>Brentford, West Ham and Leeds keen on goalkeeper</p></li><li><p>Assistant Heitinga could become Ajax head coach</p></li></ul><p>Liverpool have received inquiries from Brentford, West Ham and Leeds regarding the goalkeeper Caoimhín Kelleher and allowed John Heitinga to open talks with Ajax about becoming their new head coach. Kelleher will be allowed to leave this summer in his search for regular first-team football providing Liverpool’s valuation is met.</p><p>The Premier League champions want more than £20m for the Republic of Ireland international, <a href=\"https://www.theguardian.com/football/2024/oct/19/caoimhin-kelleher-arne-slot-liverpool-chelsea-football-alisson\">who has impressed</a> when deputising for Alisson and remains under contract until 2026. With <a href=\"https://www.theguardian.com/football/article/2024/sep/09/caoimhin-kelleher-liverpool-exit-mamardashvili-signing\">Giorgi Mamardashvili arriving</a> from Valencia this summer, Kelleher’s first-team opportunities are likely to reduce further next season should he remain at Liverpool.</p> <a href=\"https://www.theguardian.com/football/2025/may/28/premier-league-liverpool-caoimhin-kelleher-john-heitinga-ajax-football\">Continue reading...</a>",
    "date": "2025-05-28T16:41:29",
    "source": "Guardian"
  },
  {
    "title": "Women’s transfer window summer 2025: all deals from world’s top six leagues",
    "url": "https://www.theguardian.com/football/ng-interactive/2025/may/28/womens-transfer-window-summer-2025-nwsl-wsl-liga-f-frauen-bundesliga-premiere-ligue-serie-a-femminile",
    "summary": "<p>Every deal in the NWSL, WSL, Liga F, Frauen-Bundesliga, Première Ligue and Serie A Femminile as well as a club-by-club guide</p><ul><li><p><a href=\"https://www.theguardian.com/football/ng-interactive/2025/may/28/mens-transfer-window-summer-2025-premier-league-la-liga-bundesliga-serie-a-ligue-1\"><strong>Men’s transfers summer 2025: all the moves</strong></a></p></li></ul> <a href=\"https://www.theguardian.com/football/ng-interactive/2025/may/28/womens-transfer-window-summer-2025-nwsl-wsl-liga-f-frauen-bundesliga-premiere-ligue-serie-a-femminile\">Continue reading...</a>",
    "date": "2025-05-28T10:00:10",
    "source": "Guardian"
  },
  {
    "title": "‘Forget what you’ve done’: Bellamy wants Wales players to switch focus to World Cup",
    "url": "https://www.theguardian.com/football/2025/may/28/craig-bellamy-wales-switch-focus-world-cup",
    "summary": "<ul><li><p>Qualifiers are against Liechtenstein and Belgium</p></li><li><p>Manager heartbroken by events at Liverpool parade</p></li></ul><p>Craig Bellamy has said his Wales players must reset and focus on the World Cup qualifying double-header regardless of whether they finished the season “on a trampoline or with a ball around their neck”. Brennan Johnson and Ben Davies <a href=\"https://www.theguardian.com/football/2025/may/21/europa-league-final-tottenham-manchester-united-match-report\">won the Europa League with Tottenham</a>, while Bellamy’s squad for matches against Liechtenstein and Belgium also includes a quartet of Leeds players in Karl Darlow, Ethan Ampadu, Joe Rodon and Daniel James, who recently celebrated <a href=\"https://www.theguardian.com/football/2025/may/03/championship-final-day-leeds-crowned-champions-and-luton-relegated\">promotion to the Premier League</a>.</p><p>Connor Roberts was also promoted with Burnley, but Bellamy is mindful other players experienced disappointment. The Wales manager said: “It’s a positive [to have winners in the squad]. But when I was at a club, anyone who went away for international football and came back it was: ‘Forget about what you’ve just done. Focus on what we’re doing here. Every meeting, every part of football you thought you’d just learned there, forget about it. Get back on track here.’</p> <a href=\"https://www.theguardian.com/football/2025/may/28/craig-bellamy-wales-switch-focus-world-cup\">Continue reading...</a>",
    "date": "2025-05-28T12:44:07",
    "source": "Guardian"
  },
  {
    "title": "Football Daily | Mic drop: Rio Ferdinand leaves TNT Sports for ‘new chapter’",
    "url": "https://www.theguardian.com/football/2025/may/28/mic-drop-rio-ferdinand-leaves-tnt-sports-new-chapter-football-daily",
    "summary": "<p><a href=\"https://www.theguardian.com/info/2022/nov/14/football-daily-email-sign-up\"><strong>Sign up now! Sign up now! Sign up now? Sign up now!</strong></a></p><p>In the preliminaries before kick-off between Aston Villa and Paris Saint-Germain at Parc des Princes last month, TNT Sports landed something of a coup. Having got celebrity Villa fan Prince William to agree to <a href=\"https://www.youtube.com/watch?v=-IyWmyR30RM\">a pre-match interview</a>, Rio Ferdinand and Ally McCoist were dispatched to ask His Royal Highness The Duke of Cornwall and Cambridge for his thoughts on how the game might unfold. While both former footballers have reached an age where they no longer have forelocks worthy of the name left to tug, Rio was so impressed with William’s knowledge of gegenpressing, xG and heat maps that he issued a stark warning to the heir to the throne. “Do not go into a punditry job because I could be out of the game,” he joked, as those armchair viewers the length and breadth of the country who are forced to pay top dollar for TNT subscriptions if they want to watch European football dared to dream.</p><p>[Mikel Arteta] had time to get a nine, he had time … Manchester United played five finals in the last five years. The United that everyone laughs at played five finals. In the last three years of building that building, you didn’t reach a final, so I do understand when people ask the question. Surely you should compete for a trophy, being in the final?” – Thierry Henry doesn’t hold back in outlining frustrations at Arsenal’s failure to sign a goalscorer, reach a final or win a trophy this season.</p><p><em><strong>This is an extract from our daily football email … Football Daily. To get the full version,<a href=\"https://preview.gutools.co.uk/info/2016/jan/05/the-fiver-email-sign-up\"> </a><a href=\"https://www.theguardian.com/info/2022/nov/14/football-daily-email-sign-up\">just visit this page and follow the instructions</a>.</strong></em></p> <a href=\"https://www.theguardian.com/football/2025/may/28/mic-drop-rio-ferdinand-leaves-tnt-sports-new-chapter-football-daily\">Continue reading...</a>",
    "date": "2025-05-28T15:58:20",
    "source": "Guardian"
  },
  {
    "title": "The goals kept coming but no title – so what now for Cristiano Ronaldo?",
    "url": "https://www.theguardian.com/football/2025/may/28/cristiano-ronaldo-saudi-pro-league-al-nassr-club-world-cup",
    "summary": "<p>The Portuguese’s Al-Nassr chapter could end without silverware but whispers of a Club World Cup cameo means his Saudi Pro League story is far from over</p><p></p><p>For a social media post described around the world as “cryptic”, it doesn’t seem all that hard to decipher. Minutes after Al-Nassr’s last game of a disappointing season ended in defeat on Monday, Cristiano Ronaldo – who had previously said that he was happy to finish his career in Saudi Arabia – <a href=\"https://www.instagram.com/p/DKIV3S-AKAy/\">posted on social media</a>. “This chapter is over. The story? Still being written. Grateful to all.”</p><p>The biggest star in the Saudi Pro League looks to be on his way out of Riyadh after two and a half years of personal milestones but no major trophy with Al-Nassr. With the Yellows no closer to a first title since 2019 than when he joined in December 2022 and no place in Asia’s Champions League next season, the 40-year-old may not, as the club had long expected, extend his contract – which ends on 30 June – for another year.</p> <a href=\"https://www.theguardian.com/football/2025/may/28/cristiano-ronaldo-saudi-pro-league-al-nassr-club-world-cup\">Continue reading...</a>",
    "date": "2025-05-28T09:53:21",
    "source": "Guardian"
  },
  {
    "title": "Robbie Keane’s Ferencvaros hold off Orban-backed Puskas Akademia – for now",
    "url": "https://www.theguardian.com/football/2025/may/28/ferencvaros-puskas-akademia-vie-sporting-political-success",
    "summary": "<p>In the battle of state-backed clubs, the traditional powerhouse won the league last weekend – but what does it mean for the rest of the league?</p><p>“This is why I love football!” Robbie Keane yells through the smoky haze, addressing the raucous Ferencvaros faithful gathered in Budapest to celebrate the club’s 36th league title. “For moments like this. For you guys!”</p><p>Ferencvaros have looked far from convincing since his appointment in January, but they got the job done. Needing only a point on the final day, they beat Gyor 2–1 to deliver on Keane’s primary objective: securing a seventh consecutive league title for Hungary’s footballing powerhouse.</p> <a href=\"https://www.theguardian.com/football/2025/may/28/ferencvaros-puskas-akademia-vie-sporting-political-success\">Continue reading...</a>",
    "date": "2025-05-28T13:00:03",
    "source": "Guardian"
  },
  {
    "title": "Lionesses to be handed record £1.7m bonus package if they win Euro 2025",
    "url": "https://www.theguardian.com/football/2025/may/28/lionesses-to-be-handed-record-17m-bonus-package-if-they-win-euro-2025",
    "summary": "<ul><li><p>FA and players agree deal that eclipses 2022 payments</p></li><li><p>Amount more than double for reaching 2023 World Cup final</p></li></ul><p>The Football Association has agreed a record bonus package with England’s Lionesses worth up to £1.7m if they retain their European Championship title this summer.</p><p><a href=\"https://www.theguardian.com/football/2025/mar/22/disappointed-england-women-in-dispute-again-with-fa-over-bonuses\">Negotiations had reached an impasse</a>, risking <a href=\"https://www.theguardian.com/football/2023/jul/02/england-women-football-association-womens-world-cup\">a repeat of the standoff</a> that disrupted their preparations for the 2023 World Cup, but the discussions have concluded with the squad happy with the outcome.</p> <a href=\"https://www.theguardian.com/football/2025/may/28/lionesses-to-be-handed-record-17m-bonus-package-if-they-win-euro-2025\">Continue reading...</a>",
    "date": "2025-05-28T10:29:08",
    "source": "Guardian"
  },
  {
    "title": "Lamine Yamal insists on grandmother being present for Barcelona signing photos",
    "url": "https://www.theguardian.com/football/2025/may/28/fc-barcelona-17-year-old-lamine-yamal-grandmother",
    "summary": "<p>Deal with €1bn buyout clause will keep 17-year-old, rated by many pundits as best player in the world, at club until 2031</p><p>Lamine Yamal, Barcelona and Spain’s football sensation, has delayed the official photoshoot for the signing of his new club contract so that his grandmother can be present.</p><p>The 17-year-old, who has won hearts and minds not just with his talent on the pitch but for his humility, credits Fatima, his paternal grandmother, with keeping his feet on the ground after his parents separated when he was three years old.</p> <a href=\"https://www.theguardian.com/football/2025/may/28/fc-barcelona-17-year-old-lamine-yamal-grandmother\">Continue reading...</a>",
    "date": "2025-05-28T14:06:12",
    "source": "Guardian"
  },
  {
    "title": "Sunderland keen to keep Bellingham and consider Henderson approach",
    "url": "https://www.theguardian.com/football/2025/may/28/sunderland-jobe-bellingham-consider-jordan-henderson-approach",
    "summary": "<ul><li><p>Jobe Bellingham believed to have spoken with Frankfurt</p></li><li><p>Former Black Cat Jordan Henderson likely to leave Ajax</p></li></ul><p>The Sunderland owner, Kyril Louis-Dreyfus, is determined to keep Jobe Bellingham after the club’s promotion to the Premier League despite growing interest from Germany in the England Under-21 midfielder. Sunderland are also considering an attempt to re-sign Jordan Henderson 14 years after he was sold to Liverpool for £20m. The 34-year-old England midfielder was at Wembley to watch the <a href=\"https://www.theguardian.com/football/2025/may/24/sunderland-underdog-championship-playoff-final-sheffield-united\">playoff final victory</a> and is expected to be allowed to leave Ajax this summer.</p><p>Bellingham is believed to have held talks with Eintracht Frankfurt this week before heading to Ibiza to meet his brother, Jude, for a holiday. Borussia Dortmund and RB Leipzig are also interested in the 19-year-old, who scored four goals in 40 appearances in the Championship this season.</p> <a href=\"https://www.theguardian.com/football/2025/may/28/sunderland-jobe-bellingham-consider-jordan-henderson-approach\">Continue reading...</a>",
    "date": "2025-05-28T12:28:14",
    "source": "Guardian"
  },
  {
    "title": "USMNT greats Donovan, Howard criticize absence of top players from Gold Cup",
    "url": "https://www.theguardian.com/football/2025/may/28/usmnt-greats-donovan-howard-criticize-absence-of-top-players-from-gold-cup",
    "summary": "<ul><li><p>Donovan said he believes the US is not a priority for stars</p></li><li><p>Pulisic, Robinson, Musah all withdrew from summer tournament</p></li></ul><p>Former US men’s national team greats Landon Donovan and Tim Howard criticized some of the stars who asked to be left off the team’s Gold Cup roster this summer, with Donovan saying he believes that the national team is “not a priority” for them.</p><p>The Gold Cup is the last international tournament the US men’s national team will compete in before playing co-host for the 2026 World Cup next summer. Christian Pulisic, Antonee Robinson and Yunus Musah all <a href=\"https://www.theguardian.com/football/2025/may/22/usmnt-gold-cup-squad-christian-pulisic\">asked to be left off of the team</a> for various reasons, with Pulisic citing the workload of two straight 50-game campaigns with Milan, while Robinson was ruled out with a case of knee tendinopathy (an overuse injury that he had been managing for much of the second half of the Premier League season).</p> <a href=\"https://www.theguardian.com/football/2025/may/28/usmnt-greats-donovan-howard-criticize-absence-of-top-players-from-gold-cup\">Continue reading...</a>",
    "date": "2025-05-28T19:19:54",
    "source": "Guardian"
  },
  {
    "title": "From Linköping to Lisbon: retracing Blackstenius’ steps to Arsenal hero status",
    "url": "https://www.theguardian.com/football/2025/may/28/stina-blackstenius-arsenal-womens-champions-league",
    "summary": "<p>Sweden attacker has a knack for scoring in big games and her former coaches are not surprised</p><p>Of the many enduring images of Arsenal’s celebrations after their <a href=\"https://www.theguardian.com/football/2025/may/24/arsenal-grab-womens-champions-league-final-glory-against-barcelona\">Women’s Champions League triumph against Barcelona</a>, one in particular emphasised the magnitude and rarity of the contribution made by their goalscorer, Stina Blackstenius. The Arsenal striker was photographed holding the trophy aloft alongside Alex Scott, scorer of the only goal in their previous European final 18 years earlier. As the pair posed together, it hit home that Blackstenius had scored one of the two biggest goals in the club’s history.</p><p>The 29-year-old Sweden striker’s name will now be immortalised in Arsenal Women folklore and, despite predominantly playing as a substitute in the past two seasons, she has developed a knack for producing in the biggest moments, scoring the winning goal in both <a href=\"https://www.theguardian.com/football/2023/mar/05/arsenal-chelsea-womens-continental-cup-final-match-report\">the 2023</a> and <a href=\"https://www.theguardian.com/football/2024/mar/31/maanum-collapse-arsenal-continental-cup-final-win-chelsea\">2024 League Cup</a> finals.</p> <a href=\"https://www.theguardian.com/football/2025/may/28/stina-blackstenius-arsenal-womens-champions-league\">Continue reading...</a>",
    "date": "2025-05-28T07:03:32",
    "source": "Guardian"
  },
  {
    "title": "What is the furthest a footballer has been offside when scoring a goal? | The Knowledge",
    "url": "https://www.theguardian.com/football/2025/may/28/what-is-furthest-footballer-offside-when-scoring-goal-the-knowledge",
    "summary": "<p>Plus: actual champions in finals, No 10s between the sticks and European silverware bagged amid league stinkers</p><ul><li><p><a href=\"mailto:knowledge@theguardian.com\"><strong>Mail us</strong></a><strong> with your questions and answers</strong></p></li></ul><p><strong>“Leyton Orient’s Charlie Kelman was four yards offside <a href=\"https://www.theguardian.com/football/2025/may/10/leyton-orient-stockport-league-one-playoff-match-report\">when he scored against Stockport in the League One playoff semi-finals,</a>”</strong> begins Jessica Hibbert. <strong>“What’s the furthest a player has been indisputably offside before going on to score?”</strong></p><p>In the <a href=\"https://www.youtube.com/watch?v=kRGjWSr0TN4\">spirit of Annie Hall</a>, let’s get <strong>Jeff Astle</strong> out the way so that we can relax and digest our offside goals better. His <a href=\"https://www.youtube.com/watch?v=ikaXC8vOC1U\">infamous tap-in at Elland Road in April 1971</a> isn’t relevant here because Jessica asked specifically about goal scorers who were offside. In that case the controversy – “And Leeds will go mad! And they’ve every right to go mad!” – was about the position of Colin Suggett and whether he was interfering with play.</p><p><strong>Roberto Baggio</strong> (<a href=\"https://www.youtube.com/watch?v=9hp1cl5Igig\">Italy 2-1 England, 1990</a>, although he probably should have had a penalty seconds earlier, and don’t get us started on <a href=\"https://www.youtube.com/watch?v=0Umkss-UESg\">Nicola Berti’s disallowed goal </a>in the same game)</p><p><strong>Carlos Tevez</strong> (<a href=\"https://www.youtube.com/watch?v=f5UhP7rqwvg\">Argentina 3-1 Mexico, 2010</a>)</p> <a href=\"https://www.theguardian.com/football/2025/may/28/what-is-furthest-footballer-offside-when-scoring-goal-the-knowledge\">Continue reading...</a>",
    "date": "2025-05-28T07:00:03",
    "source": "Guardian"
  },
  {
    "title": "Wales boss Bellamy lets Man Utd's Biancheri explore options",
    "url": "https://www.bbc.com/sport/football/articles/cvg9rdmvpv7o",
    "summary": "Wales boss Craig Bellamy says he is happy for Manchester United striker Gabriele Biancheri to explore his international options.",
    "date": "2025-05-28T21:31:02",
    "source": "BBC"
  },
  {
    "title": "Chelsea’s billion-pound boys take charge and show clinical cutting edge | Nick Ames",
    "url": "https://www.theguardian.com/football/2025/may/29/chelseas-billion-pound-boys-take-charge-and-show-clinical-cutting-edge",
    "summary": "<p>Greater resources of the Premier League side prove crucial as their subs add quality and spark to clinch the trophy</p><p>A waft of Cole Palmer’s left foot; a clip from the right; <a href=\"https://www.theguardian.com/football/2025/may/28/real-betis-chelsea-europa-conference-league-final-match-report\">a convincing victory</a> that simultaneously made all the sense in the world and absolutely none. The biggest task Enzo Maresca faced in his first season at Chelsea had been, he suggested before this crowning moment, to convince his squad the Conference League mattered. As the entire playing staff streamed across the turf to hail Moisés Caicedo’s clincher, they offered up a convincing impression of a group that had firmly grasped the message.</p><p>Palmer did not quite dominate this final but he bent it in Chelsea’s direction, drifting this way and that until everything around him clicked. Before his delivery on to the primed head of Enzo Fernández, they had grasped for synthesis without threatening it. After he twisted a milky Jesús Rodríguez inside out and offered up an unorthodox finish for Nicolas Jackson’s collection they resembled giants against helpless waifs. For all the heated celebrations, which began in earnest once Jadon Sancho had scored their best goal, this was a title won in cold, dead-eyed Premier League blood.</p> <a href=\"https://www.theguardian.com/football/2025/may/29/chelseas-billion-pound-boys-take-charge-and-show-clinical-cutting-edge\">Continue reading...</a>",
    "date": "2025-05-28T23:04:35",
    "source": "Guardian"
  }
]