[
  {
    "title": "How Postecoglou abandoned 'Ange-ball' to win Europa League",
    "url": "https://www.bbc.com/sport/football/articles/czely53z689o",
    "summary": "From all-out attack to parking the bus - how Ange Postecoglou changed his style in order to guide Tottenham to Europa League glory.",
    "date": "2025-05-21T23:15:48",
    "source": "BBC"
  },
  {
    "title": "Belief in Amorim remains at Man Utd - but for how long?",
    "url": "https://www.bbc.com/sport/football/articles/c23mgk1xel4o",
    "summary": "Manchester United will keep faith with boss Ruben Amorim after their Europa League final loss - but for how long?",
    "date": "2025-05-21T23:58:03",
    "source": "BBC"
  },
  {
    "title": "'I don't feel I've completed the job... but que sera, sera'",
    "url": "https://www.bbc.com/sport/football/articles/czxywdk43pro",
    "summary": "Tottenham manager Ange Postecoglou insists he wants to stay in charge and says he had not \"completed the job\" after he guided Spurs to their first trophy in 17 years.",
    "date": "2025-05-21T23:51:01",
    "source": "BBC"
  },
  {
    "title": "Struggles down to off-field issues and injury - Foden",
    "url": "https://www.bbc.com/sport/football/articles/cpw779gy7jyo",
    "summary": "Manchester City midfielder Phil Foden says he has \"struggled\" this season because of off-field issues and an ankle injury suffered against Manchester United.",
    "date": "2025-05-21T16:00:15",
    "source": "BBC"
  },
  {
    "title": "'Creating history' - Barca extend Flick's contract until 2027",
    "url": "https://www.bbc.com/sport/football/articles/c5ygg1jdv5lo",
    "summary": "Barcelona extend manager Hansi Flick's deal at the club until June 2027 as the German is rewarded for winning the La Liga title among his three trophies in his first season in charge.",
    "date": "2025-05-21T18:23:46",
    "source": "BBC"
  },
  {
    "title": "Is Gerrard returning? And is he what Rangers need?",
    "url": "https://www.bbc.com/sport/football/articles/clynnrqz617o",
    "summary": "Would a return for Rangers' last title-winning manager Steven Gerrard be the best thing for the club?",
    "date": "2025-05-21T15:19:33",
    "source": "BBC"
  },
  {
    "title": "Bellingham to miss start of season after shoulder surgery",
    "url": "https://www.bbc.com/sport/football/articles/c7800k37v8po",
    "summary": "Real Madrid and England midfielder will undergo shoulder surgery after the Club World Cup and is set to miss the start of next season.",
    "date": "2025-05-21T09:58:19",
    "source": "BBC"
  },
  {
    "title": "Football Daily: Europa League debrief",
    "url": "https://www.bbc.co.uk/sounds/play/p0lcp2z2",
    "summary": "Tottenham Hotspur's 17-year wait for a trophy is over at the end of a tough season.",
    "date": "2025-05-21T23:25:00",
    "source": "BBC"
  },
  {
    "title": "Liverpool announce new Heysel Stadium tragedy memorial",
    "url": "https://www.bbc.com/sport/football/articles/cwy77dg2w1do",
    "summary": "Liverpool announce plans for a new memorial at Anfield to mark the 40th anniversary of the Heysel Stadium tragedy.",
    "date": "2025-05-21T16:15:12",
    "source": "BBC"
  },
  {
    "title": "Big Dunc - From Barlinnie hell to Goodison heaven",
    "url": "https://www.bbc.com/sport/football/articles/c15nv3qx7evo",
    "summary": "BBC Sport Scotland chief sportswriter Tom English speaks to football icon Duncan Ferguson.",
    "date": "2025-05-21T12:43:15",
    "source": "BBC"
  },
  {
    "title": "Aberdeen fan in court accused of throwing seat that struck own player",
    "url": "https://www.bbc.com/news/articles/cy8nn2rz8j8o",
    "summary": "Jack MacKenzie was hit by part of a seat after his side's defeat against Dundee United.",
    "date": "2025-05-21T12:58:19",
    "source": "BBC"
  },
  {
    "title": "Arsenal consider Rodrygo move - Thursday's gossip",
    "url": "https://www.bbc.com/sport/football/articles/czj44lrved1o",
    "summary": "Arsenal are looking into move for Real Madrid forward Rodrygo, Barcelona keen on Liverpool winger Luis Diaz, Chelsea determined to hold on to Enzo Fernandez amid Real Madrid links, plus more.",
    "date": "2025-05-21T21:40:29",
    "source": "BBC"
  },
  {
    "title": "Blackburn Women players felt 'devalued' over club withdrawal",
    "url": "https://www.bbc.com/sport/football/articles/c5y88zdgzp8o",
    "summary": "Blackburn Women defender Rachel Dugdale says players have been made to feel \"devalued\" by the \"lack of communication\" from the club over its withdrawal from the Championship.",
    "date": "2025-05-21T15:48:50",
    "source": "BBC"
  },
  {
    "title": "Emmanuel-Thomas admits plot to smuggle £600k of cannabis",
    "url": "https://www.bbc.com/news/articles/cwy772nj5n3o",
    "summary": "Former Aberdeen, Ipswich Town and Bristol City striker Jay Emmanuel-Thomas will be sentenced at a later date.",
    "date": "2025-05-21T15:34:35",
    "source": "BBC"
  },
  {
    "title": "This is one for the true believers - Postecoglou",
    "url": "https://www.bbc.com/sport/football/videos/cdedzngl073o",
    "summary": "Tottenham head coach Ange Postecoglou reacts to his side’s 1-0 win over Manchester United in the Europa League final.",
    "date": "2025-05-21T23:32:45",
    "source": "BBC"
  },
  {
    "title": "Fans at Tottenham's stadium celebrate Europa League triumph",
    "url": "https://www.bbc.com/sport/football/videos/cy8nk4m8r39o",
    "summary": "Tottenham fans at the Tottenham Hotspur Stadium celebrate on the pitch after their team win the Europa League by beating Manchester United 1-0 in Bilbao.",
    "date": "2025-05-21T22:12:36",
    "source": "BBC"
  },
  {
    "title": "Make a shorter squad, I will stay - Guardiola",
    "url": "https://www.bbc.com/sport/football/videos/cj933p21z2no",
    "summary": "Pep Guardiola says he will quit as manager if Manchester City not reduce the size of his squad this summer, saying leaving so many players out is \"impossible for my soul''.",
    "date": "2025-05-21T08:43:08",
    "source": "BBC"
  },
  {
    "title": "I'll go if board feel I'm not right, but I won't quit - Amorim",
    "url": "https://www.bbc.com/sport/football/videos/c2e3zde0rpko",
    "summary": "Manchester United head coach Ruben Amorim says he will leave \"without compensation\" if the club's board feel he is not right, but will not quit after his side lose 1-0 to Tottenham in the Europa League final.",
    "date": "2025-05-21T22:30:50",
    "source": "BBC"
  },
  {
    "title": "Extra spots should Euro 2028 hosts fail to qualify",
    "url": "https://www.bbc.com/sport/football/articles/cx2eedpnpqlo",
    "summary": "Joint-hosts England, Scotland, Wales and the Republic of Ireland will have to qualify for Euro 2028 - but two places will be reserved at the finals should any of those host nations fail to qualify.",
    "date": "2025-05-21T14:57:02",
    "source": "BBC"
  },
  {
    "title": "West Ham and Forest charged by FA over melee",
    "url": "https://www.bbc.com/sport/football/articles/c20nn74qk0ko",
    "summary": "West Ham and Nottingham Forest are both charged for failing to control their players during the final minutes of their Premier League meeting on Sunday.",
    "date": "2025-05-21T14:25:32",
    "source": "BBC"
  },
  {
    "title": "Is 'magic' Caldentey Arsenal's key in Champions League final?",
    "url": "https://www.bbc.com/sport/football/articles/cde21zxl567o",
    "summary": "'Magic' Maria Caldentey is facing her old club Barcelona for the first time - can she help deliver a Champions League trophy with Arsenal?",
    "date": "2025-05-21T07:46:59",
    "source": "BBC"
  },
  {
    "title": "Five guilty of hate crimes for racist abuse of Vinicius Jr",
    "url": "https://www.bbc.com/sport/football/articles/cy4kk5g97j7o",
    "summary": "Five people are handed suspended prison sentences for racially abusing Vinicius Jr in an \"unprecedented\" ruling in Spain, La Liga said on Wednesday.",
    "date": "2025-05-21T12:13:39",
    "source": "BBC"
  },
  {
    "title": "Republic of Ireland boss Ward 'turned down WSL job'",
    "url": "https://www.bbc.com/sport/football/articles/c4g22jzpky0o",
    "summary": "Republic of Ireland manager Carla Ward says she turned down an offer of a job from a Women's Super League club and is fully committed to her present role.",
    "date": "2025-05-21T07:26:07",
    "source": "BBC"
  },
  {
    "title": "One of my most successful seasons - Casemiro",
    "url": "https://www.bbc.com/sport/football/articles/cdj99kn11jpo",
    "summary": "Casemiro says this has been \"one of the most successful seasons\" of his career despite Manchester United's disappointing Premier League campaign.",
    "date": "2025-05-21T13:24:03",
    "source": "BBC"
  },
  {
    "title": "Man City's Rodri returns after eight months out",
    "url": "https://www.bbc.com/sport/football/articles/cdxkkpr29x8o",
    "summary": "Manchester City midfielder Rodri makes his return after eight months out with a knee injury.",
    "date": "2025-05-21T08:42:54",
    "source": "BBC"
  },
  {
    "title": "Football Daily",
    "url": "https://www.bbc.co.uk/sounds/play/p0lcjvl3",
    "summary": "EFL play-off finals preview with Aaron Paul, Jobi McAnuff & new Reading CEO Joe Jacobson.",
    "date": "2025-05-21T12:21:00",
    "source": "BBC"
  },
  {
    "title": "Smith, 16, balancing first NI call-up with GCSE exams",
    "url": "https://www.bbc.com/sport/articles/cqxeegv9v8po",
    "summary": "Goalkeeper Abbie Smith says her first call-up to the Northern Ireland senior squad was a \"big surprise\" as she looks to juggle international football with her GCSE exams.",
    "date": "2025-05-21T06:15:34",
    "source": "BBC"
  },
  {
    "title": "World Football",
    "url": "https://www.bbc.co.uk/sounds/play/p0lchzbs",
    "summary": "SV Elversberg, from a small town of around 13,000, could be hosting Bundesliga games.",
    "date": "2025-05-21T09:41:00",
    "source": "BBC"
  },
  {
    "title": "Timber out of Arsenal finale after ankle surgery",
    "url": "https://www.bbc.com/sport/football/articles/c62nnxkk8v6o",
    "summary": "Jurrien Timber will miss Arsenal's final Premier League game of the season against Southampton after undergoing ankle surgery on Tuesday.",
    "date": "2025-05-21T13:13:51",
    "source": "BBC"
  },
  {
    "title": "'You follow your badge' - Man Utd & Spurs fans ready for Europa League final",
    "url": "https://www.bbc.com/sport/football/videos/cp8dd4jd0pzo",
    "summary": "Manchester United and Tottenham fans speak to BBC Sport in Bilbao before Wednesday's Europa League final.",
    "date": "2025-05-21T15:08:40",
    "source": "BBC"
  },
  {
    "title": "Promotion would vindicate Black Cats plan - Speakman",
    "url": "https://www.bbc.com/sport/football/articles/c93yy0p17glo",
    "summary": "Sunderland sporting director Kristjaan Speakman says Premier League promotion would showcase their successful integration of young players.",
    "date": "2025-05-21T20:02:04",
    "source": "BBC"
  },
  {
    "title": "Glasgow City & Rangers seek cup cheer after title frustration",
    "url": "https://www.bbc.com/sport/football/articles/cj9339wvrrzo",
    "summary": "Glasgow City and Rangers meet in the Women's Scottish Cup final, having fallen short in the SWPL title race.",
    "date": "2025-05-21T20:09:21",
    "source": "BBC"
  },
  {
    "title": "Prolific winger Kyziridis to join Hearts from Zemplin",
    "url": "https://www.bbc.com/sport/football/articles/c20xxr9q4pzo",
    "summary": "Greek winger Alexandros Kyziridis will join Heart of Midlothian on a three-year contract when his current deal expires with Slovak top-flight club Zemplin Michalovce.",
    "date": "2025-05-21T16:03:16",
    "source": "BBC"
  },
  {
    "title": "Arfield agrees Falkirk stay for Premiership return",
    "url": "https://www.bbc.com/sport/football/articles/cr4zzg5y120o",
    "summary": "Scott Arfield opts to remain with Falkirk for their return to the Scottish Premiership return after signing a one-year deal.",
    "date": "2025-05-21T18:14:39",
    "source": "BBC"
  },
  {
    "title": "Brennan Johnson strikes to clinch Europa League glory for Tottenham",
    "url": "https://www.theguardian.com/football/2025/may/21/europa-league-final-tottenham-manchester-united-match-report",
    "summary": "<p>For Ange Postecoglou and Tottenham, there was only one story, one mission. It was not about what happens next with the manager; that can wait. It was about grasping an opportunity that does not come around very often, about emerging from what has felt like a generation’s worth of jibes; about winning.</p><p>On a golden night for their longsuffering followers, they chased the baggage from their backs, they changed the narrative. Yet again, Postecoglou won in his second season at a club. For the first time since 2008, Spurs got their hands on a trophy.</p> <a href=\"https://www.theguardian.com/football/2025/may/21/europa-league-final-tottenham-manchester-united-match-report\">Continue reading...</a>",
    "date": "2025-05-21T21:01:33",
    "source": "Guardian"
  },
  {
    "title": "‘Mate, I’m a winner’: Postecoglou keen to continue at Spurs after Europa League glory",
    "url": "https://www.theguardian.com/football/2025/may/21/tottenham-europa-league-ange-postecoglou-manchester-united-ruben-amorim",
    "summary": "<ul><li>‘We’re still building this team. We need to add to it’</li><li>Amorim will leave if Manchester United don’t want him</li></ul><p>Despite being under pressure to retain his job, Ange Postecoglou insisted he is a “winner” who wants to keep building after Tottenham beat Manchester United 1-0 to claim the Europa League, the club’s first piece of silverware since 2008.</p><p>And while Brennan Johnson’s 42nd-minute strike sealed Spurs’ first continental trophy in 41 years, Ruben Amorim stated he would quit as United head coach if the club’s executive and supporters no longer believed in him.</p> <a href=\"https://www.theguardian.com/football/2025/may/21/tottenham-europa-league-ange-postecoglou-manchester-united-ruben-amorim\">Continue reading...</a>",
    "date": "2025-05-21T22:55:14",
    "source": "Guardian"
  },
  {
    "title": "Tottenham 1-0 Manchester United: Europa League final player ratings",
    "url": "https://www.theguardian.com/football/2025/may/21/tottenham-manchester-united-europa-league-final-player-ratings",
    "summary": "<p>Romero and Van de Ven were rocks at the back for Spurs, while Højlund never looked like scoring for United</p><p>4-2-3-1</p> <a href=\"https://www.theguardian.com/football/2025/may/21/tottenham-manchester-united-europa-league-final-player-ratings\">Continue reading...</a>",
    "date": "2025-05-21T21:30:24",
    "source": "Guardian"
  },
  {
    "title": "Spurs prevail with Mourinho blueprint and ultra pragmatism in baffling final | Jonathan Wilson",
    "url": "https://www.theguardian.com/football/2025/may/21/spurs-mourinho-blueprint-manchester-united-europa-league-final",
    "summary": "<p>Ange Postecoglou moved away from his attacking style while Brennan Johnson earned the sweetest vindication</p><p>Finals are not for the playing; they’re for the winning. Who cares about the spectacle? Who cares about the quality? At some level football is always more about the narrative and the drama than technical mastery. Tottenham certainly will cheerily ignore what a shambolic game of football this was as they bask in their <a href=\"https://www.theguardian.com/football/2025/may/21/europa-league-final-tottenham-manchester-united-match-report\">first trophy since 2008</a>, their first in European competition in 40 years. Glory comes in many forms, and just because this might not be how Danny Blanchflower sanctioned it, does not mean this was not, in its own way, glorious.</p><p>But it was a baffling game. For the third round in a row, Tottenham prevailed with a sort of ultra pragmatism. Ange Postecoglou always wins a trophy in his second season, a fact of which he has delighted in reminding everybody. It just seems odd that it took him that long to move away from his characteristic attacking, high-pressing style to a blueprint José Mourinho might have left behind in a drawer. Ange stared into the Barclays, but the Barclays stared back far harder into him.</p> <a href=\"https://www.theguardian.com/football/2025/may/21/spurs-mourinho-blueprint-manchester-united-europa-league-final\">Continue reading...</a>",
    "date": "2025-05-21T22:13:53",
    "source": "Guardian"
  },
  {
    "title": "Misfiring Fernandes flops for Manchester United in Europa League final defeat | Jamie Jackson",
    "url": "https://www.theguardian.com/football/2025/may/21/misfiring-fernandes-flops-for-manchester-united-in-europa-league-final-defeat",
    "summary": "<p>Deployed in central midfield rather than a more familiar No 10 role, the playmaker failed to make his mark in Bilbao</p><p>Wanted desperately: a system that allows Manchester United to create a cornucopia of chances, plus a Bruno Fernandes who does not go missing precisely when this one-man Ruben Amorim outfit needs him - in a major European final.</p><p>Cumbersome, toothless and lacking flair: this has been Amorim’s 3-4-3 formation since he took over in early November, and was Fernandes on Wednesday night, alongside the (again) impotent Rasmus Højlund, plus the anonymous Mason Mount, Amad Diallo and too many others in United colours.</p> <a href=\"https://www.theguardian.com/football/2025/may/21/misfiring-fernandes-flops-for-manchester-united-in-europa-league-final-defeat\">Continue reading...</a>",
    "date": "2025-05-21T22:37:56",
    "source": "Guardian"
  },
  {
    "title": "Phil Foden admits to facing challenges ‘off the pitch mentally’ this season",
    "url": "https://www.theguardian.com/football/2025/may/21/phil-foden-admits-to-facing-challenges-off-the-pitch-mentally-this-season-manchester-city",
    "summary": "<ul><li>‘It’s been difficult,’ says Manchester City forward</li><li>Foden won PFA Player of the Year award a year ago</li></ul><p>Phil Foden has revealed he has faced challenges “off the pitch mentally” this season and that an ankle injury sustained against Manchester United in April has hampered him and is not 100% healed.</p><p>The Manchester City forward has struggled to recapture last term’s impressive form that featured a career-high 27 goals and being voted the Professional Footballers’ Association players’ player of the year and the football writers’ player of the year. He has managed only 10 goals, has not scored since January and was only a 76th-minute replacement in <a href=\"https://www.theguardian.com/football/2025/may/17/crystal-palace-manchester-city-fa-cup-final-match-report\">Saturday’s 1-0 FA Cup final defeat</a> by Crystal Palace.</p> <a href=\"https://www.theguardian.com/football/2025/may/21/phil-foden-admits-to-facing-challenges-off-the-pitch-mentally-this-season-manchester-city\">Continue reading...</a>",
    "date": "2025-05-21T16:00:33",
    "source": "Guardian"
  },
  {
    "title": "Chelsea and Newcastle in race with Manchester United to sign Liam Delap",
    "url": "https://www.theguardian.com/football/2025/may/21/chelsea-and-newcastle-in-race-with-manchester-united-to-sign-liam-delap",
    "summary": "<ul><li>Ipswich striker has release clause of £30m</li><li>Delap has spoken to United about potential switch</li></ul><p>Chelsea and Newcastle are providing fierce competition for Manchester United in the race to sign Liam Delap, who will hold discussions with all of his suitors before deciding who to join when he leaves Ipswich this summer.</p><p>Delap, whose <a href=\"https://www.theguardian.com/football/2025/apr/09/liam-delap-30m-release-clause-manchester-united-chelsea-target\">release clause drops to £30m</a> after Ipswich’s relegation from the Premier League, has already spoken to executives at United to gain a sense of what a move to Old Trafford would entail. A contract worth £150,000 a week has been put forward. Talks with several other clubs are anticipated and it is understood that Chelsea and Newcastle have been wooing the 22-year-old behind closed doors.</p> <a href=\"https://www.theguardian.com/football/2025/may/21/chelsea-and-newcastle-in-race-with-manchester-united-to-sign-liam-delap\">Continue reading...</a>",
    "date": "2025-05-21T15:57:20",
    "source": "Guardian"
  },
  {
    "title": "Footballer Jay Emmanuel-Thomas pleads guilty to £600,000 cannabis importation charge",
    "url": "https://www.theguardian.com/football/2025/may/21/jay-emmanuel-thomas-cannabis-charge-football",
    "summary": "<ul><li>Forward, 34, arrested at Stansted airport in 2024</li><li>Former Arsenal trainee sacked by Greenock Morton</li></ul><p>Footballer Jay Emmanuel-Thomas has pleaded guilty to a cannabis importation charge over an attempt to smuggle £600,000 of the drug through Stansted airport from Thailand.</p><p>The 34-year-old striker was sacked by Scottish Championship side Greenock Morton <a href=\"https://www.theguardian.com/uk-news/2024/sep/19/former-arsenal-player-charged-after-600000-of-cannabis-seized-at-stansted\">after his arrest last year</a>. The player who came through the Arsenal academy and was given his professional debut by Arsène Wenger in 2010, also played for Ipswich, Bristol City and QPR before moving north of the border. He changed his plea to guilty at a hearing on 7 May meaning his case can now be reported after reporting restrictions were lifted on Wednesday.</p> <a href=\"https://www.theguardian.com/football/2025/may/21/jay-emmanuel-thomas-cannabis-charge-football\">Continue reading...</a>",
    "date": "2025-05-21T16:27:49",
    "source": "Guardian"
  },
  {
    "title": "Liverpool unveil plans for new memorial to mark 40th anniversary of Heysel tragedy",
    "url": "https://www.theguardian.com/football/2025/may/21/liverpool-unveil-plans-for-new-memorial-to-mark-40th-anniversary-of-heysel-tragedy",
    "summary": "<ul><li>Current memorial’s location deemed unsuitable</li><li>Juventus to unveil their new tribute next week</li></ul><p>Liverpool have unveiled plans for a new Heysel memorial at Anfield to mark the 40th anniversary of the disaster that claimed 39 lives before <a href=\"https://www.theguardian.com/football/2020/jun/02/how-heysel-tragedy-changed-english-football-clubs-banned-europe\">the 1985 European Cup final</a>.</p><p>Entitled “Forever Bound”, the memorial will feature a Juventus scarf and a Liverpool scarf entwined in bronze, a dedication to the date and location of the tragedy and the names of the 39 people who were killed that night – 32 from Italy, four from Belgium, two from France and one from Northern Ireland – engraved on white Italian porcelain. It will replace the existing memorial that is located on the wall of the Sir Kenny Dalglish Stand.</p> <a href=\"https://www.theguardian.com/football/2025/may/21/liverpool-unveil-plans-for-new-memorial-to-mark-40th-anniversary-of-heysel-tragedy\">Continue reading...</a>",
    "date": "2025-05-21T14:19:30",
    "source": "Guardian"
  },
  {
    "title": "London City Lionesses fined £15,000 for approaching player through DMs",
    "url": "https://www.theguardian.com/football/2025/may/21/london-city-lionesses-fined-15000-for-approaching-player-through-dms",
    "summary": "<ul><li>Southampton said they were not prepared to discuss deal</li><li>London City apologised and cooperated with FA process</li></ul><p>London City Lionesses have been fined £15,000 for making an approach to a Southampton player via social media, without her club’s permission.</p><p>The club newly promoted to the Women’s Super League (WSL) admitted to the Football Association’s charge, which related to an attempt to sign the player from their Women’s Championship rivals during last summer’s transfer window. The player’s name was redacted from the published written findings of an independent regulatory commission. The hearing took place in March 2025.</p> <a href=\"https://www.theguardian.com/football/2025/may/21/london-city-lionesses-fined-15000-for-approaching-player-through-dms\">Continue reading...</a>",
    "date": "2025-05-21T14:09:24",
    "source": "Guardian"
  },
  {
    "title": "Premier League race for Europe: who’s in, who needs what and how 10 could qualify",
    "url": "https://www.theguardian.com/football/2025/may/21/premier-league-race-for-europe-whos-in-who-needs-what-and-how-10-could-qualify",
    "summary": "<p>While the top and bottom of the Premier League are resolved, European spots are very much up for grabs</p><p>Intrigue on the final day of the Premier League season is concentrated solely on who qualifies for Europe, but there is plenty of it. Seven clubs will enter the last round of matches unsure of which European competition they will be playing in next season, or in some cases whether they will be playing in Europe at all, with half of the division potentially competing in Uefa tournaments in 2025-26. Here is what is at stake on Sunday …</p> <a href=\"https://www.theguardian.com/football/2025/may/21/premier-league-race-for-europe-whos-in-who-needs-what-and-how-10-could-qualify\">Continue reading...</a>",
    "date": "2025-05-21T22:46:06",
    "source": "Guardian"
  },
  {
    "title": "Crystal Palace hopeful of Europa League participation despite Textor concerns",
    "url": "https://www.theguardian.com/football/2025/may/21/crystal-palace-europa-league-participation-lyon-john-textor-concerns",
    "summary": "<ul><li>John Textor-owned Lyon could also reach competition</li><li>Uefa’s club financial control body set to look into case</li></ul><p>Crystal Palace are confident they will be cleared to play in next season’s Europa League even if Lyon also qualify despite concerns that they could contravene Uefa’s rules about multi-club ownership.</p><p>No individual is permitted to control two clubs that are competing in the same Uefa-run competition, with Lyon owner John Textor also listed as Palace’s largest shareholder at 45%, through his company Eagle Football Holdings. Victory for Paris Saint-Germain against Reims in the French Cup final this weekend would confirm that Lyon qualify for the Europa League after finishing sixth in Ligue 1.</p> <a href=\"https://www.theguardian.com/football/2025/may/21/crystal-palace-europa-league-participation-lyon-john-textor-concerns\">Continue reading...</a>",
    "date": "2025-05-21T12:26:55",
    "source": "Guardian"
  },
  {
    "title": "Football Daily | High-concept farewells and why football loyalty is in the eye of the beholder",
    "url": "https://www.theguardian.com/football/2025/may/21/football-daily-email-high-concept-farewells",
    "summary": "<p>In the Selhurst Park stands on Tuesday, a celebration of Crystal Palace’s historic FA Cup win was awaited. It was duly delivered, after Eberechi Eze completed <a href=\"https://www.theguardian.com/football/2025/may/20/crystal-palace-wolves-premier-league-match-report\">a 4-2 win over Wolves</a> with one of those goals only he can score, all grace and precision, off-the-cuff football played with south London swing. To the final whistle then, and a chance for the FA Cup to be run round Selhurst, hopefully with a bit more care than when Graeme Souness and Liverpool chums were lobbing around the old Football League Championship trophy like they were Orrell back-row forwards. The silverware took a while to arrive but when it did, it was in the arms of Joel Ward, making his final appearance as a Palace player, his 364th game. So long, Joel, and thanks for all the fish.</p> <a href=\"https://www.theguardian.com/football/2025/may/21/football-daily-email-high-concept-farewells\">Continue reading...</a>",
    "date": "2025-05-21T13:54:26",
    "source": "Guardian"
  },
  {
    "title": "Kyiv’s League of the Mighty: how amputee football supports Ukraine’s survivors",
    "url": "https://www.theguardian.com/football/2025/may/21/kyiv-league-of-the-mighty-how-amputee-football-supports-ukraine-survivors",
    "summary": "<p>Veterans are using sport as a form of rehabilitation from severe injuries and, as one organiser explains: ‘It’s about emotional gain, helping them rediscover this will to live’</p><p>A little more than four months ago, Konstantyn Moskal arrived at a new position close to Ukraine’s frontline. He had been serving in the army for six years and, as a native of the almost entirely occupied Luhansk region, knew the price of war better than most. It was soon to take a horrifying toll from him. Moskal stepped on a landmine shortly after the rotation and life changed irrevocably. The evacuation procedure went smoothly, in the circumstances, but his lower left leg could not be saved. It was hard not to think dark thoughts after two operations; tougher still given a prosthetic was nowhere on the horizon.</p><p>Now it is mid-May. Wearing the red, yellow-trimmed shirt of FK Khrestonostsi, Moskal puffs out his cheeks before sitting in the dugout. He props his crutch against the neighbouring seat. The second half of the final is starting and he will take a breather. He smiles at his wife, Alina, who watches from the front row. This time he has remembered to wear his talisman, a metallic cross fastened around his neck, and he tells her it is the reason for his two goals. Soon he will almost certainly win his first football tournament. “Rest up or you won’t be able to lift the trophy,” a teammate advises.</p> <a href=\"https://www.theguardian.com/football/2025/may/21/kyiv-league-of-the-mighty-how-amputee-football-supports-ukraine-survivors\">Continue reading...</a>",
    "date": "2025-05-21T09:17:11",
    "source": "Guardian"
  },
  {
    "title": "What are the worst European football finals … based on league position? | The Knowledge",
    "url": "https://www.theguardian.com/football/2025/may/21/what-are-the-worst-european-football-finals-based-on-league-position-the-knowledge",
    "summary": "<p>Plus: more strange player-of-the-match awards and shot-shy winners; and did Brian Clough deliberately go down to 10 men?</p><ul><li><strong><a href=\"mailto:knowledge@theguardian.com\">Mail us</a> with your questions and answers</strong></li></ul><p><strong>“In terms of aggregate league position, will Tottenham v Manchester United be the worst European final ever?”</strong> asks Phil Taylor (and dozens of others).</p><p>Tottenham Hotspur and Manchester United, who meet in Bilbao tonight, put all their eggs in the Europa League basket sometime before the clocks went back. They are <a href=\"https://www.theguardian.com/football/premierleague/table\">17th and 16th</a> in the Premier League respectively, giving them an aggregate position of 33. It is, to take a couple of unashamedly gratuitous examples, equivalent to <strong>Oldham Athletic</strong> playing <strong>Southampton</strong> in the Uefa Cup final of 1992, or <strong>Sabadell</strong> meeting <strong>Racing Santander</strong> in the same competition in 1987.</p> <a href=\"https://www.theguardian.com/football/2025/may/21/what-are-the-worst-european-football-finals-based-on-league-position-the-knowledge\">Continue reading...</a>",
    "date": "2025-05-21T07:00:21",
    "source": "Guardian"
  },
  {
    "title": "Carlo Ancelotti and the vibes of Brazil: a match made in football heaven?",
    "url": "https://www.theguardian.com/football/2025/may/21/carlo-ancelotti-brazil-football-heaven",
    "summary": "<p>A partnership between the world’s best man-manager and the <em>Seleção</em> will be fun – and potentially glorious</p><p>The year is 2026 and Carlo Ancelotti is recreating <a href=\"https://www.theguardian.com/football/2025/may/13/carlo-ancelotti-brazil-life-lessons-football-daily-newsletter\">a famous Real Madrid photo</a>. Once more he finds himself on an open-top bus celebrating a landmark victory in sunglasses while smoking a cigar, accompanied by a smiling Rodrygo, Vinícius Júnior and Éder Militão. David Alaba is missing and there are confusing new additions, such as Casemiro and Raphinha.</p><p>Pan out and we realise we’re nowhere near the Cibeles Fountain in Madrid but are instead on Avenida Atlântica by Copacabana beach. Yellow and green confetti fills the sky and Neymar is showing off a record-extending sixth World Cup to an adoring crowd. He’s finally won them over for delivering the <em>hexa</em>, something expected of him since he rose to prominence as a spiky-haired Santos prodigy at the turn of the 2010s, and they have fallen in love with the <em>Seleção</em> again.</p> <a href=\"https://www.theguardian.com/football/2025/may/21/carlo-ancelotti-brazil-football-heaven\">Continue reading...</a>",
    "date": "2025-05-21T07:00:20",
    "source": "Guardian"
  },
  {
    "title": "Chelsea determined to keep Enzo Fernández despite Real Madrid interest",
    "url": "https://www.theguardian.com/football/2025/may/21/chelsea-determined-to-keep-enzo-fernandez-despite-real-madrid-interest",
    "summary": "<ul><li>La Liga club aiming to rebuild midfield before next season</li><li>Liverpool’s Alexis Mac Allister also on shortlist</li></ul><p>Chelsea have no intention of selling Enzo Fernández and are determined to see off any attempt by Real Madrid to sign the midfielder this summer.</p><p>Xabi Alonso, who is due to take over from Carlo Ancelotti as Madrid’s manager, is looking to add more control to his midfield and Fernández is one of the names on the club’s shortlist. The La Liga side are also tracking Liverpool’s Alexis Mac Allister and Eintracht Frankfurt’s Hugo Larsson. Madrid have considered trying to hijack Arsenal’s move for Real Sociedad’s Martin Zubimendi but the Premier League side are confident that a deal for the Spain international will be sealed soon.</p> <a href=\"https://www.theguardian.com/football/2025/may/21/chelsea-determined-to-keep-enzo-fernandez-despite-real-madrid-interest\">Continue reading...</a>",
    "date": "2025-05-21T11:30:13",
    "source": "Guardian"
  },
  {
    "title": "Teenage dream as Shelby McMahon puts Melbourne City into Asian Champions League final",
    "url": "https://www.theguardian.com/football/2025/may/21/melbourne-city-women-reach-asian-champions-league-final-after-last-minute-winner",
    "summary": "<ul><li>Late winner seals City women’s 1-0 win over Incheon Red Angels</li><li>City play Wuhan Jiangda for  $2m pay day in final on Saturday</li></ul><p>Teenager Shelby McMahon produced a wonder goal at the death to steer Melbourne City to a 1-0 win over Incheon Red Angels and into the Women’s Asian Champions League Final.</p><p>With a huge prize packet on the line, City appeared bound for extra-time against the South Koreans at the Wuhan Sports Center Stadium on Wednesday night.</p> <a href=\"https://www.theguardian.com/football/2025/may/21/melbourne-city-women-reach-asian-champions-league-final-after-last-minute-winner\">Continue reading...</a>",
    "date": "2025-05-21T15:56:53",
    "source": "Guardian"
  },
  {
    "title": "De Bruyne’s big City sendoff and a Europa League final preview: Football Weekly - podcast",
    "url": "https://www.theguardian.com/football/audio/2025/may/21/kevin-de-bruyne-manchester-city-sendoff-europa-league-football-weekly-extra-podcast",
    "summary": "<p>Max Rushden is joined by Barry Glendenning, Seb Hutchinson and Dan Bardell as Manchester City move closer to sealing Champions League football with a 3-1 win over Bournemouth</p><p><strong>Rate, review, share on <a href=\"https://itunes.apple.com/podcast/football-weekly-the-guardian/id188674007?mt=2\">Apple Podcasts</a>, <a href=\"https://soundcloud.com/guardianfootballweekly\">Soundcloud</a>, <a href=\"https://audioboom.com/channel/football-weekly\">Audioboom</a>, <a href=\"https://www.mixcloud.com/guardianfootballweekly/\">Mixcloud</a>, <a href=\"https://www.acast.com/footballweekly\">Acast</a> and <a href=\"http://www.stitcher.com/podcast/guardianuk/football-weekly\">Stitcher</a>, and join the conversation on <a href=\"https://www.facebook.com/GuardianPodcasts/\">Facebook</a>, <a href=\"https://twitter.com/guardianaudio\">Twitter</a> and <a href=\"mailto:footballweekly@theguardian.com\">email</a>.</strong></p><p>On the podcast today: Omar Marmoush scores a goal of the season contender as Manchester City move into third place in the Premier League, before the race for Champions League football concludes with the final round of fixtures this Sunday.</p> <a href=\"https://www.theguardian.com/football/audio/2025/may/21/kevin-de-bruyne-manchester-city-sendoff-europa-league-football-weekly-extra-podcast\">Continue reading...</a>",
    "date": "2025-05-21T11:28:09",
    "source": "Guardian"
  }
]