[
  {
    "title": "Arsenal beat Man Utd in seven-goal thriller",
    "url": "https://www.bbc.com/sport/videos/cdd243revr9o",
    "summary": "Arsenal secure second place in the WSL with a 4-3 win against Manchester United.",
    "date": "2025-05-10T13:49:17",
    "source": "BBC"
  },
  {
    "title": "Unbeaten Chelsea lift WSL trophy",
    "url": "https://www.bbc.com/sport/football/videos/c7801mkd28ko",
    "summary": "Chelsea lift their sixth successive title WSL trophy, after beating Liverpool 1-0 to become the first team to go unbeaten in a 22-game league season.",
    "date": "2025-05-10T14:09:37",
    "source": "BBC"
  },
  {
    "title": "Ramsdale checks out Southampton wellbeing project",
    "url": "https://www.bbc.com/sport/football/videos/cly8ygljzz7o",
    "summary": "Southampton goalkeeper Aaron Ramsdale visits a wellbeing project for male fans at St Mary's.",
    "date": "2025-05-10T05:14:57",
    "source": "BBC"
  },
  {
    "title": "'True inspiration' - Scotland great Ross to retire",
    "url": "https://www.bbc.com/sport/football/articles/c5y535njxwqo",
    "summary": "Scotland great Jane Ross will retire from football at the end of the season, the Rangers striker says.",
    "date": "2025-05-10T11:29:01",
    "source": "BBC"
  },
  {
    "title": "How to win the Championship play-offs - five golden rules",
    "url": "https://www.bbc.com/sport/football/articles/c6293qzep53o",
    "summary": "Who will win the Championship play-offs? BBC Sport crunches the numbers in an attempt to look for clues.",
    "date": "2025-05-10T14:52:19",
    "source": "BBC"
  },
  {
    "title": "Will 48-team Women's World Cup be good for the game?",
    "url": "https://www.bbc.com/sport/football/articles/c87p10p72q5o",
    "summary": "BBC Sport looks at the pros and cons of expanding the Women's World Cup from 32 teams to 48.",
    "date": "2025-05-10T09:53:42",
    "source": "BBC"
  },
  {
    "title": "Winner takes title? Sporting & Benfica in 'biggest derby for years'",
    "url": "https://www.bbc.com/sport/football/articles/ce398vldgq8o",
    "summary": "Sporting and Benfica meet in the fiercely contested Lisbon derby on Saturday in a game that could decide the championship.",
    "date": "2025-05-10T07:26:50",
    "source": "BBC"
  },
  {
    "title": "Footballer banned for trans comment wants FA apology",
    "url": "https://www.bbc.com/sport/football/articles/ckgnwgnge4yo",
    "summary": "A teenage amateur footballer banned by the Football Association over remarks she made to a transgender woman opponent demands an apology from the governing body after the case is dropped.",
    "date": "2025-05-10T06:00:34",
    "source": "BBC"
  },
  {
    "title": "Match of the Day - your questions answered",
    "url": "https://www.bbc.com/sport/articles/c62836we4xgo",
    "summary": "Match of the Day is a world-famous football show - but how are decisions made behind the scenes?",
    "date": "2025-05-10T06:38:47",
    "source": "BBC"
  },
  {
    "title": "In Focus with Newcastle winger Murphy",
    "url": "https://www.bbc.co.uk/sounds/play/p0l91bp1",
    "summary": "Jacob Murphy talks Newcastle, playing with Isak & chasing Champions League football",
    "date": "2025-05-10T09:00:00",
    "source": "BBC"
  },
  {
    "title": "Chelsea beat Liverpool to complete unbeaten WSL season",
    "url": "https://www.skysports.com/football/chelsea-women-vs-liverpool-women/report/520651",
    "summary": "Chelsea are the first WSL team to complete an unbeaten 22-game season after Aggie Beever-Jones' late goal secured a 1-0 victory over Liverpool on the final day of the season.",
    "date": "Sat, 10 May 2025 14:30:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Arsenal beat Man Utd to second in WSL after thrilling final-day win",
    "url": "https://www.skysports.com/football/arsenal-women-vs-manchester-united-women/report/520649",
    "summary": "Arsenal beat Manchester United to second place in the Women's Super League after a thrilling 4-3 win at the Emirates Stadium on the final day.",
    "date": "Sat, 10 May 2025 14:30:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Brentford lead at Ipswich LIVE!",
    "url": "https://www.skysports.com/football/ipswich-town-vs-brentford/live/506159",
    "summary": "",
    "date": "Thu, 08 May 2025 13:26:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Deflected Mykolenko effort draws Everton level at Fulham LIVE!",
    "url": "https://www.skysports.com/football/fulham-vs-everton/live/506158",
    "summary": "",
    "date": "Sat, 10 May 2025 13:30:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Welbeck penalty puts Brighton ahead at Wolves LIVE!",
    "url": "https://www.skysports.com/football/wolverhampton-wanderers-vs-brighton-and-hove-albion/live/506166",
    "summary": "",
    "date": "Thu, 08 May 2025 13:31:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Fearnley knocked out by strong Berrettini in Rome",
    "url": "https://www.skysports.com/watch/video/13364926/matteo-berrettini-vs-jacob-fearnley-rome-open-highlights",
    "summary": "Highlights of the ATP match between Matteo Berrettini and Jacob Fearnley in Rome.",
    "date": "Sat, 10 May 2025 12:16:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Quick-thinking UAE beat the rain and Qatar - as 10 batters retire out!",
    "url": "https://www.skysports.com/cricket/news/12040/13364948/ten-batters-retire-out-as-quick-thinking-uae-beat-the-rain-and-qatar-in-womens-t20-world-cup-qualifier",
    "summary": "Quick-thinking UAE beat the rain and Qatar in a Women's T20 World Cup qualifier as a remarkable 10 batters retired out en route to a crushing 163-run victory.",
    "date": "Sat, 10 May 2025 13:00:00 BST",
    "source": "SkySports"
  },
  {
    "title": "City struggling to break through Saints defence LIVE!",
    "url": "https://www.skysports.com/football/southampton-vs-manchester-city/live/506164",
    "summary": "",
    "date": "Thu, 08 May 2025 13:29:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Dortmund interested in signing Sunderland's Bellingham",
    "url": "https://www.skysports.com/football/news/12040/13364922/jobe-bellingham-transfer-borussia-dortmund-interested-in-signing-sunderland-midfielder",
    "summary": "Borussia Dortmund are interested in signing Jobe Bellingham from Sunderland, according to <em>Sky in Germany</em>.&#160;",
    "date": "Sat, 10 May 2025 11:49:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Why does Kohli want to quit Test matches now?",
    "url": "https://www.skysports.com/watch/video/13364909/virat-kohli-informs-bcci-he-wants-to-retire-from-test-cricket-why-now",
    "summary": "Matt Kabir Floyd discusses why now for Virat Kohli after the Indian superstar informed the BCCI he wants to retire from Test cricket.",
    "date": "Sat, 10 May 2025 11:26:00 BST",
    "source": "SkySports"
  },
  {
    "title": "India's Kohli wants to retire from Test cricket ahead of England series",
    "url": "https://www.skysports.com/cricket/news/12040/13364856/virat-kohli-india-great-tells-bcci-he-wants-to-retire-from-test-cricket-ahead-of-england-series",
    "summary": "Virat Kohli has told the Board of Control for Cricket in India (BCCI) that he wishes to retire from Test cricket ahead of this summer's series in England, Sky Sports News understands.",
    "date": "Sat, 10 May 2025 07:38:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Atherton: England should have picked Bethell against Zimbabwe",
    "url": "https://www.skysports.com/cricket/news/12040/13364588/england-should-have-picked-jacob-bethell-for-zimbabwe-test-and-ended-his-ipl-spell-early-says-michael-atherton",
    "summary": "Michael Atherton says England should have named Jacob Bethell in their squad for the one-off Test against Zimbabwe rather than let him continue his Indian Premier League spell.",
    "date": "Sat, 10 May 2025 07:00:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Today on Sky Sports Racing: Lingfield Classic trials & Ascot's Victoria Cup",
    "url": "https://www.skysports.com/racing/news/12040/13364271/today-on-sky-sports-racing-lingfield-classic-trials-ascots-victoria-cup-headline-on-jam-packed-saturday",
    "summary": "Classic contenders and competitive handicaps are the themes for a jam-packed Saturday on Sky Sports Racing with action from Lingfield, Ascot and Hexham.",
    "date": "Sat, 10 May 2025 07:00:00 BST",
    "source": "SkySports"
  },
  {
    "title": "FIFA to expand Women's World Cup from 2031",
    "url": "https://www.skysports.com/football/news/12040/13364634/womens-world-cup-to-expand-to-48-teams-after-fifa-agrees-move-from-2031-tournament",
    "summary": "The Women's World Cup will be expanded from 32 to 48 teams in time for the 2035 tournament in the United Kingdom.",
    "date": "Fri, 09 May 2025 18:00:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Lampard: No time to get down - second leg will be a different game",
    "url": "https://www.skysports.com/football/news/12040/13364662/frank-lampard-coventry-boss-says-its-no-time-to-get-down-after-championship-play-off-first-leg-defeat-to-sunderland",
    "summary": "Frank Lampard says now is not the time to get down about his Coventry side's Championship play-off semi-final first leg defeat to Sunderland.",
    "date": "Fri, 09 May 2025 23:00:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Late drama as Sunderland capitalise on error in costly night for Coventry",
    "url": "https://www.skysports.com/watch/video/13364819/coventry-city-1-2-sunderland-championship-play-off-highlights",
    "summary": "Highlights of the Sky Bet Championship play-off semi-final 1st leg match between Coventry City and Sunderland.",
    "date": "Fri, 09 May 2025 22:13:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Disaster! Mayenda pounces on huge Coventry mistake late on!",
    "url": "https://www.skysports.com/watch/video/13364801/disaster-mayenda-pounces-on-huge-coventry-mistake-late-on",
    "summary": "Sunderland take a late lead after a huge mistake late on from Coventry.",
    "date": "Fri, 09 May 2025 21:52:00 BST",
    "source": "SkySports"
  },
  {
    "title": "'Game on!' | Rudoni instantly responds with bullet header!",
    "url": "https://www.skysports.com/watch/video/13364795/jack-rudoni-instantly-responds-with-bullet-header",
    "summary": "Jack Rudoni brings things immediately level after Sunderland took the lead just two minutes earlier!",
    "date": "Fri, 09 May 2025 21:39:00 BST",
    "source": "SkySports"
  },
  {
    "title": "The race for eighth: Four teams hoping Man City win the FA Cup",
    "url": "https://www.skysports.com/football/news/12040/13363303/bournemouth-brentford-brighton-and-fulham-aiming-for-europa-conference-league-via-eighth-place-premier-league-finish",
    "summary": "The race for the Champions League is hugely competitive - but there is another mini-battle emerging in the middle of the table: the race for eighth spot and the UEFA Conference League.",
    "date": "Wed, 07 May 2025 13:03:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Isidor's superb finish stuns Coventry!",
    "url": "https://www.skysports.com/watch/video/13364791/isidors-superb-finish-stuns-coventry",
    "summary": "Sunderland take the lead at Coventry through Wilson Isidor.",
    "date": "Fri, 09 May 2025 21:32:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Southampton v Manchester City, Fulham v Everton, and more: football – live",
    "url": "https://www.theguardian.com/football/live/2025/may/10/southampton-v-manchester-city-fulham-v-everton-football-live-clockwatch",
    "summary": "<ul><li>Follow goal and news updates from around the grounds</li><li><a href=\"https://www.theguardian.com/football/live\">Live scores</a> | <a href=\"https://www.theguardian.com/football/tables\">Tables</a> | <a href=\"https://www.theguardian.com/football/2025/jan/14/premier-league-top-scorers-2024-25-who-is-leading-race-for-golden-boot\">Golden Boot race</a> | And <a href=\"mailto:barry.glendenning@theguardian.com\">mail Barry</a></li></ul><p><strong>League One playoff:</strong> Stockport County have gone ahead at Brisbane Road, with Norwood turning provider to tee up Fraser Horsfall for a back post header from close range that gives the visitors the advantage.</p><p><strong>League One playoff:</strong> Leyton Orient took the lead against Stockport County in their semi-final first leg courtesy of a strike from a preposterously offside Charlie Kelman that was allowed to stand, but the visitors have just equalised after Oliver Norwood scored from the spot. There’s about 30 minutes to play at Brisbane Road. Wycombe Wanderers and Charlton Athletic will contest the first leg of their semi-final at Adams Park tomorrow.</p> <a href=\"https://www.theguardian.com/football/live/2025/may/10/southampton-v-manchester-city-fulham-v-everton-football-live-clockwatch\">Continue reading...</a>",
    "date": "2025-05-10T14:51:44",
    "source": "Guardian"
  },
  {
    "title": "Arsenal WSL runners-up after resisting Manchester United fightback for 4-3 win",
    "url": "https://www.theguardian.com/football/2025/may/10/arsenal-manchester-united-wsl-match-report",
    "summary": "<p>It was more nervy than it needed to be but Arsenal secured a second-place finish ahead of Manchester United with the win in a seven-goal thriller. A point would have been enough for the home team to earn a place in the third round of qualifying for next season’s Champions League but a three-goal advantage with 20 minutes remaining was reduced to one in the space of six minutes to keep the jeopardy alive and the atmosphere among the 46,603 tense to the finish.</p><p>The Manchester United captain, Maya Le Tissier, had said Champions League football was “all that matters” before the tie, but the visiting team fought with the intensity of a team keen to avoid the third round of qualifying and put in a strong performance before their FA Cup final showdown with WSL champions, Chelsea.</p> <a href=\"https://www.theguardian.com/football/2025/may/10/arsenal-manchester-united-wsl-match-report\">Continue reading...</a>",
    "date": "2025-05-10T13:58:00",
    "source": "Guardian"
  },
  {
    "title": "Leyton Orient enjoy playoff fortune as Charlie Kelman double holds Stockport",
    "url": "https://www.theguardian.com/football/2025/may/10/leyton-orient-stockport-league-one-playoff-match-report",
    "summary": "<p>A pulsating and controversial League One playoff semi-final first leg ended all-square as Leyton Orient and Stockport shared four goals at Brisbane Road. Charlie Kelman gave the home side a first-half lead with an offside goal but a penalty by Ollie Norwood and a Fraser Horsfall header put the visitors in front before Kelman netted from the spot late on to leave the tie in the balance going into the second leg at Edgeley Park on Wednesday.</p><p>The visitors created the better chances in a competitively-fought first period, testing Josh Keeley in the home goal on a number of occasions. Kyle Wootton found himself free in the fifth minute but Keeley raced out to narrow the angle and avert the danger while Will Collar should have done better with a cross when he headed wide.</p> <a href=\"https://www.theguardian.com/football/2025/may/10/leyton-orient-stockport-league-one-playoff-match-report\">Continue reading...</a>",
    "date": "2025-05-10T13:34:14",
    "source": "Guardian"
  },
  {
    "title": "Newcastle v Chelsea: crucial questions in too-close-to-call race for Champions League",
    "url": "https://www.theguardian.com/football/2025/may/10/newcastle-chelsea-crucial-questions-race-for-champions-league-football",
    "summary": "<p>Alexander Isak’s form, Nicolas Jackson’s scoring touch and the big talking points heading into Sunday’s showdown</p><p><strong>Newcastle: </strong>If recent form seems encouraging – Newcastle are seeking an eighth victory in 10 games in all competitions – they will miss the combative presence of the injured Joelinton on the left of Eddie Howe’s midfield three. Joe Willock has not convinced entirely in that role since the Brazilian damaged a knee and much the same could be said of Alexander Isak. On his day the Sweden striker is unplayable but since <a href=\"https://www.theguardian.com/football/2025/mar/29/newcastle-revels-in-silverware-success-as-history-boys-parade-carabao-cup\">Newcastle’s Carabao Cup triumph</a> Isak has often been a shadow of his best self. Is it the minor groin injury he is carrying, or even a desire to move on to pastures new this summer? Given the importance of Kieran Trippier and Fabian Schär, Howe will be keeping everything crossed that those two key defenders pass late fitness tests. <strong>LT</strong></p> <a href=\"https://www.theguardian.com/football/2025/may/10/newcastle-chelsea-crucial-questions-race-for-champions-league-football\">Continue reading...</a>",
    "date": "2025-05-10T11:00:54",
    "source": "Guardian"
  },
  {
    "title": "Crunch clásico offers Madrid chance to salvage season despite Barcelona dominance",
    "url": "https://www.theguardian.com/football/2025/may/10/crunch-clasico-offers-madrid-chance-to-salvage-season-despite-barcelona-dominance",
    "summary": "<p>They have lost three times to their oldest rivals but a win would give Ancelotti’s men a path to retaining the league</p><p>Real Madrid’s players arrived at training on Wednesday morning to find seven teddy bears waiting for them. Lined up on a bush outside Valdebebas, they wore white shirts and a banner had been placed in front of them, alongside a couple of Spain flags with the club badge in the middle where the crown should go. “<em>Grazie</em>, Inter,” it said. The night before, <a href=\"https://www.theguardian.com/football/2025/may/06/champions-league-semi-final-inter-barcelona-match-report\">Simone Inzaghi’s side had done for them</a> what they had not been able to do for themselves, at least not yet. Now perhaps it can be their turn, one last chance to salvage something from what has been somebody else’s season.</p><p>Barcelona had been beaten: there would be no Champions League and no treble, reason alone to celebrate or at least seek consolation in Madrid, if not the only one. Because if it’s tempting to ask: “Is that all you’ve got?” somehow the answer may still be: “Actually, no.” Four days on from Barcelona’s European exit, Montjuïc hosts the fourth <em>clásico</em> of 2024-25 in a fourth stadium. Madrid have lost the <a href=\"https://www.theguardian.com/football/2024/oct/26/real-madrid-barcelona-la-liga-clasico-match-report\">previous three – 4-0</a>, 5-2 and 3-2, seeing their rivals go top of the table, <a href=\"https://www.theguardian.com/football/2025/jan/12/barcelona-v-real-madrid-spanish-super-cup-final-match-report\">win the Super Cup</a> and the Copa del Rey. Lose a fourth, and they will see them win the league title too, Hansi Flick’s team would be seven points clear with nine in play, a double within reach, while Madrid are left with&nbsp;nothing.</p> <a href=\"https://www.theguardian.com/football/2025/may/10/crunch-clasico-offers-madrid-chance-to-salvage-season-despite-barcelona-dominance\">Continue reading...</a>",
    "date": "2025-05-10T07:00:49",
    "source": "Guardian"
  },
  {
    "title": "‘The whole city was touched’: Bradford prepares to mark 40 years since Valley Parade fire",
    "url": "https://www.theguardian.com/football/2025/may/10/bradford-40-years-valley-parade-fire",
    "summary": "<p>On 11 May 1985, 56 football supporters lost their lives and hundreds more were injured. The city came together that day and its unity since has been a constant source of pride</p><p>Bradford is so often portrayed as a city divided. Sometimes, those descriptions can be correct. It is a place swamped with economic instability and problems that run deep, but over the past week, and again this weekend, the two things that unite its many communities have risen to the fore.</p><p>One is its football team. Bradford City, like the West Yorkshire city itself, have had their fair share of inauspicious moments, but their incredible escape from League Two last Saturday, scoring a 96th-minute winner to beat Fleetwood and secure automatic promotion for the first time this century, sparked jubilant scenes over the bank holiday weekend.</p> <a href=\"https://www.theguardian.com/football/2025/may/10/bradford-40-years-valley-parade-fire\">Continue reading...</a>",
    "date": "2025-05-10T07:00:47",
    "source": "Guardian"
  },
  {
    "title": "‘Fighting with nature’: Iceland’s Grindavík play again after 18-month seismic gap",
    "url": "https://www.theguardian.com/football/2025/may/10/fighting-with-nature-icelands-grindavik-play-again-after-18-month-seismic-gap",
    "summary": "<p>The town was ripped apart and the economy decimated. But now the football club will make an emotional return</p><p>It was about 7pm when UMF Grindavík’s players finished training in the club’s indoor hall. There had been seismic activity in the area all day but, in this harbour town to the south of Iceland’s famous Blue Lagoon, everybody had become wearily used to that. Earthquakes and volcanic eruptions had been a discomfiting, menacing backdrop to the previous three years. Everyday life had continued but now, on 10 November 2023, nature was to have its say. Four hours after its football team had completed their session, the danger had become intolerable and Grindavík was evacuated. Their once-thriving home quickly turned into a ghost town.</p><p>Nobody would dream of using the hall for football now. Its pitch is cleaved in two by a fissure up to 25 metres deep; one of the most striking images in a settlement that has been ripped apart. A chasm has destroyed their outdoor practice pitch too. But something remarkable will happen in Grindavík on Saturday: football will lead the way in a recovery few could have foreseen over the past 18 months. Grindavík will play at their Stakkavíkurvöllur home for the first time since the town’s abandonment, hosting Fjölnir in a second-tier fixture whose outcome feels distinctly secondary.</p> <a href=\"https://www.theguardian.com/football/2025/may/10/fighting-with-nature-icelands-grindavik-play-again-after-18-month-seismic-gap\">Continue reading...</a>",
    "date": "2025-05-10T07:00:49",
    "source": "Guardian"
  },
  {
    "title": "'Very violent' Mings elbow fractured Scott jaw - Iraola",
    "url": "https://www.bbc.com/sport/football/articles/cp3n97ll0ygo",
    "summary": "Bournemouth midfielder Alex Scott suffers a fractured jaw from what manager Andoni Iraola describes as a \"very violent\" elbow by Aston Villa's Tyrone Mings.",
    "date": "2025-05-10T21:50:20",
    "source": "BBC"
  },
  {
    "title": "Southampton troll Derby after avoiding unwanted record",
    "url": "https://www.bbc.com/sport/football/articles/c20q65z36n7o",
    "summary": "Southampton avoid becoming an addition to a pub quiz question after moving past Derby County's record low total of 11 points.",
    "date": "2025-05-10T18:57:57",
    "source": "BBC"
  },
  {
    "title": "How Man City's poor service frustrated Haaland",
    "url": "https://www.bbc.com/sport/football/videos/cvgdl18jvn8o",
    "summary": "Match of the Day pundit Ashley Williams criticises the service received by striker Erling Haaland on his return to the Manchester City team in their 0-0 draw at relegated Southampton.",
    "date": "2025-05-10T23:05:21",
    "source": "BBC"
  },
  {
    "title": "How 'brilliant' Pickford keeps delivering",
    "url": "https://www.bbc.com/sport/football/videos/cqxerd3780qo",
    "summary": "Former Republic of Ireland goalkeeper praises a \"brilliant\" Jordan Pickford as the England stopper helps Everton to a 3-1 Premier League win at Fulham.",
    "date": "2025-05-10T23:05:29",
    "source": "BBC"
  },
  {
    "title": "BBC Sport pick their WSL players of the year - plus have your say",
    "url": "https://www.bbc.com/sport/football/articles/c14x6dr42lro",
    "summary": "Who has been the standout performer in the WSL? BBC Sport's women's football pundits and reporters have their say.",
    "date": "2025-05-10T17:32:16",
    "source": "BBC"
  },
  {
    "title": "Zubimendi agrees to join Arsenal - Sunday's gossip",
    "url": "https://www.bbc.com/sport/football/articles/c39xlx73j8jo",
    "summary": "Martin Zubimendi verbally agrees to join Arsenal from Real Sociedad, Erik ten Hag and Cesc Fabregas in frame to replace Xabi Alonso at Bayer Leverkusen, Cristiano Ronaldo future at Al-Nassr in doubt, plus more.",
    "date": "2025-05-10T22:18:21",
    "source": "BBC"
  },
  {
    "title": "'Fantastic' record-breaker Watkins 'shows weight in gold'",
    "url": "https://www.bbc.com/sport/football/articles/cvgn3r8lnd8o",
    "summary": "\"I said from the start when I joined the club that that's what I had my eyes on.\"\n - It's official, Ollie Watkins is Aston Villa's record Premier League goalscorer.",
    "date": "2025-05-10T21:27:15",
    "source": "BBC"
  },
  {
    "title": "'Best stand in the world'? Fulham take fan experience to new levels",
    "url": "https://www.bbc.com/sport/football/articles/cx272pe5154o",
    "summary": "Against a backdrop of fan unrest about ticket prices, Fulham are embracing elite hospitality - without being too bothered about the match.",
    "date": "2025-05-10T22:32:15",
    "source": "BBC"
  },
  {
    "title": "Hearts to make approach for Kilmarnock's McInnes",
    "url": "https://www.bbc.com/sport/football/articles/cp3n9x3led9o",
    "summary": "Hearts will make an official approach to Kilmarnock on Monday in a bid to secure Derek McInnes as their new manager.",
    "date": "2025-05-10T18:32:28",
    "source": "BBC"
  },
  {
    "title": "'Moments to remember' - Bompastor savours 'special' season",
    "url": "https://www.bbc.com/sport/football/articles/c8xge8xd98zo",
    "summary": "Chelsea's trophies continue to pile up and so do their records as they finish the WSL season unbeaten - a 'special' achievement for manager Sonia Bompastor.",
    "date": "2025-05-10T17:22:05",
    "source": "BBC"
  },
  {
    "title": "Top five 'still in our hands' - Guardiola after Man City held by Southampton",
    "url": "https://www.bbc.com/sport/football/videos/ce8g8p0ek7no",
    "summary": "Manchester City boss Pep Guardiola says a top-five finish and Champions League qualification is still in his side's hands after being held to a goalless draw by relegated Southampton.",
    "date": "2025-05-10T16:56:50",
    "source": "BBC"
  },
  {
    "title": "Villa 'managed' game better than Bournemouth - Iraola",
    "url": "https://www.bbc.com/sport/football/videos/c5ygy03ddq9o",
    "summary": "Bournemouth head coach Andoni Iraola says Aston Villa \"managed\" the game better than his side in the visitors' 1-0 Premier League win at Vitality Stadium.",
    "date": "2025-05-10T19:50:37",
    "source": "BBC"
  },
  {
    "title": "Chelsea can get even better - Bompastor",
    "url": "https://www.bbc.com/sport/football/videos/cz70jrdwn7po",
    "summary": "Chelsea manager Sonia Bompastor says her team can get \"even better\" after ending their league season unbeaten and wining their sixth consecutive WSL title.",
    "date": "2025-05-10T16:11:58",
    "source": "BBC"
  },
  {
    "title": "'Play like this against Barca and Arsenal will be punished'",
    "url": "https://www.bbc.com/sport/football/articles/c5ygwkjz2xxo",
    "summary": "Four goals scored, three points earned, second place secured, one huge game left for Arsenal this season.",
    "date": "2025-05-10T15:56:14",
    "source": "BBC"
  },
  {
    "title": "Arne Slot focusing on players Liverpool will still have after Alexander-Arnold",
    "url": "https://www.theguardian.com/football/2025/may/10/arne-slot-focusing-on-players-liverpool-will-still-have-after-alexander-arnold",
    "summary": "<ul><li>Manager has hopes for Bradley and likes finding answers</li><li>‘I’m very, very, very happy about Virgil and Mo extending’</li></ul><p>Arne Slot is planning to turn Trent Alexander-Arnold’s Anfield departure into a positive for Liverpool, the head coach has said. The right-back will leave Merseyside this summer for Real Madrid on a free transfer, meaning the Dutchman will need to find a way of replacing him.</p><p>Conor Bradley is set to start Sunday’s Premier League meeting with Arsenal at Anfield as preparations continue for next season with the title secured. Slot might have to look outside the club for someone to challenge the Northern Ireland international for the right-back berth.</p> <a href=\"https://www.theguardian.com/football/2025/may/10/arne-slot-focusing-on-players-liverpool-will-still-have-after-alexander-arnold\">Continue reading...</a>",
    "date": "2025-05-10T21:30:04",
    "source": "Guardian"
  },
  {
    "title": "Rúben Dias rips into Southampton’s negative tactics but Guardiola disagrees",
    "url": "https://www.theguardian.com/football/2025/may/10/ruben-dias-rips-into-southamptons-negative-tactics-but-guardiola-doesnt-agree",
    "summary": "<ul><li>Defender blasts Saints’ time-wasting: ‘It kills the game’</li><li>‘They can do whatever they want,’ responds City manager</li></ul><p>Rúben Dias tore into Southampton for what he felt were anti-football tactics, laying bare his frustration after Manchester City <a href=\"https://www.theguardian.com/football/2025/may/10/southampton-manchester-city-premier-league-match-report\">were held to a 0-0 draw</a> here. Southampton had just two shots – both off target – and 28% of the ball as they ground out a result that means City are still not assured of a top-five finish and Champions League qualification.</p><p>Dias raged about Southampton’s use of the dark arts, including time-wasting, although his manager, Pep Guardiola, had no complaints, saying it was simply up to City to find a way through. “It’s frustrating,” Dias said. “In a moment like this every point matters. And it is frustrating to play against a team like this.</p> <a href=\"https://www.theguardian.com/football/2025/may/10/ruben-dias-rips-into-southamptons-negative-tactics-but-guardiola-doesnt-agree\">Continue reading...</a>",
    "date": "2025-05-10T18:06:22",
    "source": "Guardian"
  },
  {
    "title": "Spurs are on their way to Bilbao – but no plans to record a new cup final song",
    "url": "https://www.theguardian.com/football/2025/may/10/spurs-are-on-their-way-to-bilbao-but-no-plans-to-record-a-new-cup-final-song",
    "summary": "<ul><li>Postecoglou unmoved by idea of a new ‘Ossie’s Dream’</li><li>Spurs face Manchester United in Europa League final</li></ul><p>Ange Postecoglou has played down the prospect of his Tottenham squad recording a cup final song before their Europa League final with Manchester United.</p><p>The record ‘<a href=\"https://www.youtube.com/watch?v=ROSh5wU_ddY\">Ossie’s Dream</a>’ by Chas and Dave – in reference to the former midfielder Ossie Ardiles – is synonymous with Spurs’ history after being recorded with the squad to commemorate reaching the 1981 FA Cup final. However, Postecoglou insisted no repeat would occur with the class of ‘25, who secured a place in Bilbao with a <a href=\"https://www.theguardian.com/football/2025/may/08/bodo-glimt-tottenham-europa-league-semi-final-match-report\">5-1 aggregate victory</a> over Bodø/Glimt.</p> <a href=\"https://www.theguardian.com/football/2025/may/10/spurs-are-on-their-way-to-bilbao-but-no-plans-to-record-a-new-cup-final-song\">Continue reading...</a>",
    "date": "2025-05-10T22:35:03",
    "source": "Guardian"
  },
  {
    "title": "Rasmus Højlund eager to ‘show myself’ at highest level with Manchester United",
    "url": "https://www.theguardian.com/football/2025/may/10/rasmus-hojlund-manchester-united-premier-league-football",
    "summary": "<ul><li>Forward admits ‘hard times’ during difficult campaign</li><li>‘We are in a good position now to win a European trophy’</li></ul><p>Rasmus Højlund is determined to prove himself “on the biggest stage” with Manchester United, although the centre-forward admits his 21-match scoring drought earlier in the season was a test of character.</p><p>Højlund’s goal in Thursday’s <a href=\"https://www.theguardian.com/football/2025/may/08/manchester-united-athletic-bilbao-europa-league-semi-final-match-report\">4-1 defeat of Athletic Bilbao</a> was only his 10th in 48 games, a return that has prompted some criticism. But the 22-year-old Dane is clear he can turn his form around. “I know what this football club is all about,” Højlund said. “It’s a lot of pressure, but that’s why I’m here. I want to show myself on the biggest stage.”</p> <a href=\"https://www.theguardian.com/football/2025/may/10/rasmus-hojlund-manchester-united-premier-league-football\">Continue reading...</a>",
    "date": "2025-05-10T21:30:05",
    "source": "Guardian"
  },
  {
    "title": "Ollie Watkins sinks Bournemouth as 10-man Aston Villa boost top-five hopes",
    "url": "https://www.theguardian.com/football/2025/may/10/bournemouth-aston-villa-premier-league-match-report",
    "summary": "<p></p><p>It was a fraught episode that could yet determine Aston Villa’s season. In the final minute of stoppage time, the big screens showed 94 minutes and 13 seconds when Emiliano Martínez made a magnificent save to thwart Antoine Semenyo and Matty Cash ended up crashing into the Villa net to successfully spook the Bournemouth substitute Daniel Jebbison, who headed over from a couple of yards out. Amadou Onana instantly rushed to Cash, grabbing his cheeks by way of congratulations.</p><p>While Martínez embarked on a round of high-fives with his defenders and clenched both fists overhead as if parading a trophy, Cash was still in a heap, clinging to the polypropylene Villa net after the pair combined to eke out a priceless victory in their push to qualify again for the Champions League. The Villa full-back seemed as perplexed as anyone as to how Jebbison contrived to miss.</p> <a href=\"https://www.theguardian.com/football/2025/may/10/bournemouth-aston-villa-premier-league-match-report\">Continue reading...</a>",
    "date": "2025-05-10T18:43:31",
    "source": "Guardian"
  },
  {
    "title": "Antonio Conte is a title machine but the Awkward One leaves Napoli’s fans cold | Jonathan Wilson",
    "url": "https://www.theguardian.com/football/2025/may/10/antonio-conte-title-machine-leaves-napoli-fans-cold-serie-a",
    "summary": "<p>Murals of McTominay in Naples? Don’t rule that out with the volatile manager who never stays long despite serial success</p><p>There’s always a Tottenham exception. Since leaving Siena in 2011, since he got his first break with a club that had a realistic chance of winning trophies, Antonio Conte has won league titles with Juventus, Chelsea and Inter. Going into Sunday’s matches, with three games remaining, his Napoli lead Inter by three points. In a decade and a half he has won a trophy with every club he has managed, apart from Tottenham.</p><p>Maybe Tottenham simply aren’t a club that had a realistic chance of winning trophies. Certainly it’s not as familiar to them as it is to Juventus, Chelsea and Inter. Napoli were Serie A title winners <a href=\"https://www.theguardian.com/football/2023/may/04/napoli-win-first-serie-a-title-for-33-years-after-osimhen-earns-1-1-draw-at-udinese\">the season before last</a>. Conte led Tottenham for 17 months and although he has the fifth-best win record of any Spurs manager, although he took them to fourth in his first season, <a href=\"https://www.theguardian.com/football/2021/nov/01/nuno-sacked-by-tottenham-after-only-17-matches-as-manager\">having replaced Nuno Espírito Santo in the November</a>, and although they were fourth when <a href=\"https://www.theguardian.com/football/2023/mar/26/antonio-conte-departs-tottenham-after-breakdown-in-relations-with-club\">he left in March 2023</a>, by the end the situation was so toxic as to be unsustainable.</p> <a href=\"https://www.theguardian.com/football/2025/may/10/antonio-conte-title-machine-leaves-napoli-fans-cold-serie-a\">Continue reading...</a>",
    "date": "2025-05-10T19:00:02",
    "source": "Guardian"
  },
  {
    "title": "Watch highlights of Saturday's Premiership action",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002c793",
    "summary": "Highlights from the afternoon's fixtures in the Scottish Premiership.",
    "date": "2025-05-10T19:30:25",
    "source": "BBC"
  },
  {
    "title": "Alonso 'one of the best in the world' - Ancelotti",
    "url": "https://www.bbc.com/sport/football/articles/cp8ymjvjpn2o",
    "summary": "Carlo Ancelotti calls Xabi Alonso \"one of the best in the world\" amid rumours the Spaniard will replace him as Real Madrid manager.",
    "date": "2025-05-10T16:17:33",
    "source": "BBC"
  },
  {
    "title": "Pop duo Milli Vanilli and their lip-syncing scandal",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002c5zt?at_mid=gF53hYOsvp&at_campaign=Milli_Vanilli&at_medium=display_ad&at_campaign_type=owned&at_audience_id=SS&at_product=iplayer&at_brand=m002c5zt&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Milli_Vanilli&at_bbc_team=BBC",
    "summary": "The untold story surrounding the pop duo Milli Vanilli and their lip-syncing scandal.",
    "date": "2025-05-10T23:05:14",
    "source": "BBC"
  }
]