[
  {
    "title": "Premier League predictions: How accurate were BBC Sport pundits?",
    "url": "https://www.bbc.com/sport/football/articles/c7061z3znlzo",
    "summary": "Last summer, 30 BBC pundits were asked to pick which teams would finish in the Premier League's top four, and in which order. How did they get on?",
    "date": "2025-05-26T08:32:59",
    "source": "BBC"
  },
  {
    "title": "Who takes your Premier League season awards?",
    "url": "https://www.bbc.com/sport/football/articles/cwy70xe45l0o",
    "summary": "Now the 2024-25 Premier League campaign is over, cast your votes in BBC Sport's end-of-season awards.",
    "date": "2025-05-26T07:01:03",
    "source": "BBC"
  },
  {
    "title": "Test of nerve as Ross County & Livingston fight for top flight",
    "url": "https://www.bbc.com/sport/football/articles/cgmjz1wkekdo",
    "summary": "A night of mountainous drama lies ahead as Ross County host Livingston in the Scottish Premiership play-off decider, writes Jonathan Sutherland.",
    "date": "2025-05-26T08:32:13",
    "source": "BBC"
  },
  {
    "title": "'We have no right to argue' - Man Utd fly to Asia on post-season tour",
    "url": "https://www.bbc.com/sport/football/articles/ce8206834q3o",
    "summary": "Manchester United have taken a 32-man squad, including many first-team players, to Asia for two post-season friendlies.",
    "date": "2025-05-26T07:53:19",
    "source": "BBC"
  },
  {
    "title": "'Chronic pain' forces Scotland captain Corsie to retire",
    "url": "https://www.bbc.com/sport/football/articles/cx27l9gg924o",
    "summary": "Scotland captain Rachel Corsie will retire next week after living in \"chronic pain\" with a knee injury that kept her out for the majority of the season.",
    "date": "2025-05-26T07:02:05",
    "source": "BBC"
  },
  {
    "title": "Listen: Reaction to cup finals & Kettlewell to Killie?",
    "url": "https://www.bbc.co.uk/sounds/play/p0ldg7pg",
    "summary": "We discuss both Scottish Cup Finals and Stuart Kettlewell likely becoming Kilmarnock boss.",
    "date": "2025-05-26T07:00:00",
    "source": "BBC"
  },
  {
    "title": "French Open LIVE! Raducanu in first-round action at 10am",
    "url": "https://www.skysports.com/tennis/live-blog/12040/13374400/emma-raducanu-vs-wang-xinyu-at-french-open-score-updates-from-first-round-match-at-roland-garros",
    "summary": "",
    "date": "Mon, 26 May 2025 09:30:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Scotland captain Corsie announces retirement",
    "url": "https://www.skysports.com/football/news/12040/13373362/rachel-corsie-scotland-captain-announces-retirement-from-football-following-nations-league-matches",
    "summary": "Scotland captain Rachel Corsie will retire from football following the upcoming Nations League matches against Austria and Netherlands.",
    "date": "Mon, 26 May 2025 08:00:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Dallaglio: I played to honour my sister - it led to unforgettable Lions memories",
    "url": "https://www.skysports.com/rugby-union/news/12040/13368951/british-and-irish-lions-recollections-lawrence-dallaglio-on-playing-to-honour-his-sisters-memory-and-unforgettable-lions-memories",
    "summary": "For many fans of the British & Irish Lions, the most memorable tour dates back to 1997 and the titanic clashes with then world champions South Africa as part of a stunning 2-1 series success.",
    "date": "Mon, 26 May 2025 07:00:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Windsor hosts afternoon card before Shoemaker Mile showdown",
    "url": "https://www.skysports.com/racing/news/12040/13373803/today-on-sky-sports-racing-windsor-hosts-afternoon-card-before-shoemaker-mile-showdown",
    "summary": "Indian Creek and Amazonian Dream are set to do battle at Windsor in the feature of seven contests - live on Sky Sports Racing.",
    "date": "Mon, 26 May 2025 07:00:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Nicklaus on Scheffler-McIlroy rivalry: I see myself in Scottie",
    "url": "https://www.skysports.com/golf/news/12040/13373432/jack-nicklaus-discusses-scottie-scheffler-and-rory-mcilroy-rivalry-amid-blessed-period-for-golf",
    "summary": "Golfing icon Jack Nicklaus admits he sees some of himself in Scottie Scheffler and has welcomed the world No 1's growing rivalry with Rory McIlroy during a \"blessed\" period for the sport.&#160;",
    "date": "Mon, 26 May 2025 07:00:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Cabrera rallies past Harrington to win Senior PGA Championship",
    "url": "https://www.skysports.com/golf/news/12040/13374768/senior-pga-championship-angel-cabrera-rallies-past-padraig-harrington-to-win",
    "summary": "Angel Cabrera won his second senior major in a week, shooting a three-under 69 and rallying for a one-stroke victory in the Senior PGA Championship.",
    "date": "Sun, 25 May 2025 23:50:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Villa's Rogers controversially denied opening goal against Man Utd",
    "url": "https://www.skysports.com/watch/video/13374697/man-utd-v-aston-villa-was-morgan-rogers-goal-wrongly-disallowed",
    "summary": "Aston Villa's Morgan Rogers was controversially denied a goal after referee Thomas Bramall ruled he fouled Altay Bayindir, blowing the whistle before the ball hit the net, preventing VAR from intervening.",
    "date": "Mon, 26 May 2025 00:00:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Clarke: I'd take that Whyte fight straight away",
    "url": "https://www.skysports.com/boxing/news/12040/13374719/frazer-clarke-id-take-that-dillian-whyte-fight-straight-away-im-ready-if-hes-ready",
    "summary": "Frazer Clarke feels ready for Dillian Whyte after blasting out Ebenezer Tetteh in last month's comeback bout.",
    "date": "Mon, 26 May 2025 07:00:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Iwai wins Mexico Riviera Maya Open for first LPGA title",
    "url": "https://www.skysports.com/golf/news/12040/13374757/mexico-riviera-maya-open-chisato-iwai-wins-by-six-shots-for-first-lpga-title",
    "summary": "Chisato Iwai made five birdies in her opening six holes for a six-under 66 and a six-shot victory in the Mexico Riviera Maya Open for her first LPGA title.",
    "date": "Sun, 25 May 2025 22:31:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Full Fight: James Dean Fury v Kieran McDaid",
    "url": "https://www.skysports.com/watch/video/13374736/james-dean-fury-v-kieran-mcdaid-full-fight",
    "summary": "Watch the full fight of James Dean Fury and Kieran McDaid.",
    "date": "Sun, 25 May 2025 21:36:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Palou beats Ericsson to win maiden Indy 500",
    "url": "https://www.skysports.com/f1/news/12040/13374709/indy-500-alex-palou-beats-marcus-ericsson-to-win-indycars-biggest-event-at-indanapolis-for-first-time",
    "summary": "Alex Palou beat Marcus Ericsson to become the first Spanish driver to win the Indy 500 after a hard-fought battle at Indianapolis on Sunday.",
    "date": "Sun, 25 May 2025 21:50:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Villa make official complaint to PGMOL after referee howler costs them CL",
    "url": "https://www.skysports.com/football/news/12040/13374607/aston-villa-to-make-complaint-over-referee-selection-as-champions-league-bid-ends-after-controversial-decision-vs-man-utd",
    "summary": "Aston Villa have made an official complaint to the PGMOL over the selection of referee Thomas Bramall for their Premier League final-day match against Man Utd, which Champions League-chasing Villa lost after having a goal controversially ruled out.",
    "date": "Sun, 25 May 2025 19:50:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Hamilton left confused by radio call | Ferrari boss: Lewis not upset at all",
    "url": "https://www.skysports.com/f1/news/12040/13374292/lewis-hamilton-ferrari-driver-left-confused-by-this-is-our-race-radio-message-in-no-mans-land-monaco-gp",
    "summary": "Lewis Hamilton said he was in \"no man's land\" on the way to fifth place during a frustrating Monaco Grand Prix.",
    "date": "Sun, 25 May 2025 15:30:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Liverpool finally lift the Premier League in front of jubilant Anfield",
    "url": "https://www.skysports.com/football/news/12040/13373551/liverpool-lift-2024-25-premier-league-trophy-in-front-of-packed-anfield-crowd",
    "summary": "Liverpool's players were finally able to lift the Premier League trophy in front of their supporters at Anfield on the final day of the season, the first time that has happened since 1990 and as expected, there were joyous scenes.",
    "date": "Sun, 25 May 2025 19:45:00 BST",
    "source": "SkySports"
  },
  {
    "title": "'People can write what they want' - Norris responds to critics with 'perfect' Monaco",
    "url": "https://www.skysports.com/f1/news/12040/13374289/monaco-gp-mclaren-driver-lando-norris-responds-to-critics-with-perfect-weekend",
    "summary": "Lando Norris says his critics can \"write what they want\" after a \"perfect\" Monaco Grand Prix weekend, where he converted pole position into victory.",
    "date": "Sun, 25 May 2025 19:35:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Premier League Finals Night: All you need to know as Littler looks to go back-to-back",
    "url": "https://www.skysports.com/darts/news/12040/13372674/premier-league-finals-night-format-schedule-prize-fund-as-luke-littler-luke-humphries-nathan-aspinall-gerwyn-price-battle-for-glory",
    "summary": "Ahead of Premier League Finals Night, we take you through everything you need to know as the competition reaches its climax...",
    "date": "Mon, 26 May 2025 07:00:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Griffin digs in to win Charles Schwab Challenge",
    "url": "https://www.skysports.com/golf/news/12040/13374770/charles-schwab-challenge-ben-griffin-hangs-on-at-colonial-through-tough-final-round-to-win-title",
    "summary": "Ben Griffin won his first individual PGA Tour victory at the Charles Schwab Challenge, beating Matti Schmid by one shot at Colonial.",
    "date": "Sun, 25 May 2025 23:39:00 BST",
    "source": "SkySports"
  },
  {
    "title": "'Backfired', 'ugly' - F1 drivers hit out at new Monaco rules",
    "url": "https://www.skysports.com/f1/news/12040/13374287/monaco-gp-formula-1-drivers-criticise-new-rules-in-ugly-race-that-had-more-focus-on-pitting",
    "summary": "Formula 1 drivers were critical of the sport's new regulations for the Monaco Grand Prix after a chaotic but controversial Sunday, with Carlos Sainz insisting the shake-up \"backfired\" and Max Verstappen equating it to \"Mario Kart\".",
    "date": "Sun, 25 May 2025 19:30:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Ange: Why am I even being questioned on my Spurs future?!",
    "url": "https://www.skysports.com/football/news/12040/13374249/ange-postecoglou-questions-weird-talk-over-his-spurs-future-as-chairman-daniel-levy-fails-to-provide-clarity",
    "summary": "Tottenham boss Ange Postecoglou is bemused at the \"weird\" speculation over his future as Spurs chairman Daniel Levy failed to provide clarity on his position in his end-of-season message.",
    "date": "Sun, 25 May 2025 19:54:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Where Liverpool's 2024/25 PL title win ranks in history",
    "url": "https://www.skysports.com/football/news/12040/13373559/where-liverpools-2024-25-title-win-ranks-in-premier-league-history",
    "summary": "Liverpool drew 1-1 with Crystal Palace at Anfield on Sunday as Arne Slot's champions ended the Premier League season on 84 points - but where does that rank among the competition's 32 previous winners?",
    "date": "Sun, 25 May 2025 19:15:00 BST",
    "source": "SkySports"
  },
  {
    "title": "Premier League 2024-25 review: players of the season",
    "url": "https://www.theguardian.com/football/2025/may/26/premier-league-2024-25-review-players-of-the-season",
    "summary": "<p>Eberechi Eze has come into his own at Crystal Palace while Villa’s Morgan Rogers has shown what he is really capable of</p><p>Pedants may protest that Eze’s sublime FA Cup form (quarter-final and semi-final screamers <a href=\"https://www.theguardian.com/football/2025/may/17/crystal-palace-manchester-city-fa-cup-final-match-report\">before a winner at Wembley</a>) is inadmissable evidence in a Premier League review. But he was already one of the players of the season long before helping Crystal Palace win their first major trophy. Always capable of the spectacular, Eze’s stay at Selhurst Park had been characterised by inconsistency, but his finest season has come after he finished 2023-24 in red-hot form and earned a place in England’s Euros squad. The 26-year-old south Londoner has matured into a relentless menace to opposing defences who is downright unplayable at times. His eight Premier League goals and eight assists <a href=\"https://www.theguardian.com/football/2025/may/20/crystal-palace-wolves-premier-league-match-report\">helped Palace to mid-table</a> respectability under Oliver Glasner despite a worryingly slow start; they were winless in their opening eight league games. Playing in front of Adam Wharton, English football’s answer to Andrea Pirlo, certainly hasn’t hurt: is the former QPR player Eze now poised to follow Michael Olise and join one of Europe’s super-clubs? The romance of a European campaign under Glasner may prove more alluring but, regardless, his potential looks unlimited.</p> <a href=\"https://www.theguardian.com/football/2025/may/26/premier-league-2024-25-review-players-of-the-season\">Continue reading...</a>",
    "date": "2025-05-26T07:00:52",
    "source": "Guardian"
  },
  {
    "title": "Premier League 2024-25 review: flops of the season",
    "url": "https://www.theguardian.com/football/2025/may/26/premier-league-2024-25-review-flops-of-the-season",
    "summary": "<p>Managers, teams and players who have disappointed over the campaign – including the reigning footballer of the year</p><p>Ruben Amorim’s average points tally of a point per league game since arriving at Manchester United in early November puts him just above Malky Mackay’s record at Cardiff or Paul Jewell’s overall Premier League record with Bradford, Wigan and Derby. While Sporting have won the Primeira Liga title without Amorim, United have fallen down the table to 15th since the Portuguese took the reins from the interim coach, Ruud van Nistelrooy. Much of the ire towards United has been directed at the owners but on the pitch Amorim has failed to adapt his squad of expensive, experienced internationals into anything approaching a cohesive unit. The Europa League final defeat by Tottenham showed how much work is left to do.</p> <a href=\"https://www.theguardian.com/football/2025/may/26/premier-league-2024-25-review-flops-of-the-season\">Continue reading...</a>",
    "date": "2025-05-26T09:00:53",
    "source": "Guardian"
  },
  {
    "title": "Straight-talking Slegers lifted Arsenal to glory – now club must back her vision",
    "url": "https://www.theguardian.com/football/2025/may/26/arsenal-barcelona-womens-champions-league-wcl",
    "summary": "<p>Head coach stands out for her impressive lack of flourish and WCL triumph will make Gunners a destination club for the world’s best young players</p><p>The levels of content are, quite frankly, off the charts. Content-wise, Arsenal have come to Lisbon, eaten and left no crumbs. Katie McCabe sliding on her belly along the dressing room floor through a pool of champagne. Alex Scott and Jess Glynne in their retro tops. Managing to drop the F-bomb on live teatime television, not once but twice. McCabe recreating the moment she threw a ball at Chloe Kelly’s head during a Women’s Super League game, only this time with the Champions League trophy.</p><p>And then, in their more reflective moments, thoughts turn to the past. To where they came from. To the journey, those who came, and those who couldn’t make it all the way. Laia Codina wraps herself in the Catalan flag. Leah Williamson and her father share an embrace. Beth Mead thinks about her late mother. Kelly reminisces about her academy days, getting the train from Finsbury Park to Potters Bar with Lotte Wubben-Moy. Because nobody ever gets themselves to a Champions League final. You are delivered, like stones in a river, by the forces and influences that shaped you.</p> <a href=\"https://www.theguardian.com/football/2025/may/26/arsenal-barcelona-womens-champions-league-wcl\">Continue reading...</a>",
    "date": "2025-05-26T07:00:52",
    "source": "Guardian"
  },
  {
    "title": "'It missed us by inches': Witnesses describe car driving into crowd at Liverpool title parade",
    "url": "https://www.bbc.com/news/articles/cy0jvepd1p2o",
    "summary": "An off-duty BBC reporter who was attending the parade called it \"hell on Earth\".",
    "date": "2025-05-26T22:13:49",
    "source": "BBC"
  },
  {
    "title": "'Poor' decision by PGMOL to pick Bramall - Hackett",
    "url": "https://www.bbc.com/sport/football/articles/cgle170wgp6o",
    "summary": "The referees' body made a \"poor management decision\" in appointing Thomas Bramall to officiate Aston Villa's defeat by Manchester united, says former referees' boss Keith Hackett.",
    "date": "2025-05-26T19:42:45",
    "source": "BBC"
  },
  {
    "title": "Brazil 'best team in the world' - new boss Ancelotti",
    "url": "https://www.bbc.com/sport/football/articles/c5y5jnq4v13o",
    "summary": "New Brazil coach Carlo Ancelotti says he is \"honoured and proud to lead the best team in the world\" and targets winning the 2026 World Cup.",
    "date": "2025-05-26T20:25:53",
    "source": "BBC"
  },
  {
    "title": "Man Utd close to signing Wolves' Cunha",
    "url": "https://www.bbc.com/sport/football/articles/cjwq7gdp9gwo",
    "summary": "Matheus Cunha's transfer to Manchester United is at an advanced stage as the Wolves forward nears a £62.5m move to Old Trafford.",
    "date": "2025-05-26T13:48:03",
    "source": "BBC"
  },
  {
    "title": "Martindale changes narrative to drive Livingston revival",
    "url": "https://www.bbc.com/sport/football/articles/c308607ym2zo",
    "summary": "David Martindale's Livingston is a different proposition this season after winning Premiership play-off final.",
    "date": "2025-05-26T23:00:34",
    "source": "BBC"
  },
  {
    "title": "'Like nothing I've ever felt' - AFC Wimbledon boss Jackson on play-off win",
    "url": "https://www.bbc.com/sport/football/articles/cyvm6z13m9eo",
    "summary": "AFC Wimbledon boss Johnnie Jackson says it was \"like nothing he's ever felt\" to win promotion at Wembley.",
    "date": "2025-05-26T18:41:40",
    "source": "BBC"
  },
  {
    "title": "Who has made Troy's Premier League team of the season?",
    "url": "https://www.bbc.com/sport/football/articles/cvgv0q4qkgjo",
    "summary": "Troy Deeney has been picking his team of the week throughout 2024-25 - so who makes his Premier League team of the season?",
    "date": "2025-05-26T15:05:43",
    "source": "BBC"
  },
  {
    "title": "Man City want Milan midfielder Reijnders - Tuesday's gossip",
    "url": "https://www.bbc.com/sport/football/articles/cwy6d007ypyo",
    "summary": "Manchester City move for £55m midfielder, Manchester United and Newcastle eye Premier League forwards and a Bellingham could be off to Germany - according to the gossip column.",
    "date": "2025-05-26T21:37:11",
    "source": "BBC"
  },
  {
    "title": "Who were 'superb'? Who were an 'utter shambles'? McNulty's season review",
    "url": "https://www.bbc.com/sport/football/articles/cg71de2edkgo",
    "summary": "BBC Sport chief football writer Phil McNulty reviews the Premier League season - and looks back to his August predictions.",
    "date": "2025-05-26T11:04:09",
    "source": "BBC"
  },
  {
    "title": "Wilson considered taking own life during childhood",
    "url": "https://www.bbc.com/sport/football/articles/c1deq9g6303o",
    "summary": "Newcastle United striker Callum Wilson says football was his \"saviour\", having contemplated taking his own life as a child.",
    "date": "2025-05-26T12:49:52",
    "source": "BBC"
  },
  {
    "title": "'I kept saying \"do you believe in magic?\" - and magic delivered'",
    "url": "https://www.bbc.com/sport/football/articles/c5yge9g2450o",
    "summary": "Leah Williamson says \"magic delivered\" for Arsenal as 10,000 fans join the squad in celebrating their Women's Champions League triumph.",
    "date": "2025-05-26T13:43:07",
    "source": "BBC"
  },
  {
    "title": "'Simply sublime' - Arsenal youngster Dowman scores brilliant goal",
    "url": "https://www.bbc.com/sport/football/videos/cn05r698y24o",
    "summary": "Arsenal youngster Max Dowman scores a sensational individual goal to open the scoring for England against Czechia in the UEFA European Under-17 Championship.",
    "date": "2025-05-26T19:34:43",
    "source": "BBC"
  },
  {
    "title": "England exit U17 Euros despite winning six-goal thriller",
    "url": "https://www.bbc.com/sport/football/videos/cwy3r9nr47eo",
    "summary": "England suffer a heartbreaking exit from the UEFA European Under-17 Championship on goal difference despite winning a six-goal thriller against Czechia.",
    "date": "2025-05-26T20:53:11",
    "source": "BBC"
  },
  {
    "title": "Arsenal celebrate Women's Champions League win with trophy and fans",
    "url": "https://www.bbc.com/sport/football/videos/cm23dk4kl3yo",
    "summary": "Watch Arsenal celebrate their Women's Champions League triumph with fans and the trophy in London.",
    "date": "2025-05-26T13:07:09",
    "source": "BBC"
  },
  {
    "title": "Crystal Palace celebrate FA Cup victory",
    "url": "https://www.bbc.com/sport/football/videos/c0lnk5pryg4o",
    "summary": "Crystal Palace celebrate their FA Cup triumph with a victory bus parade and trophy lift at Selhurst Park.",
    "date": "2025-05-26T15:36:21",
    "source": "BBC"
  },
  {
    "title": "Chelsea captain Bright withdraws from England squad",
    "url": "https://www.bbc.com/sport/football/articles/c4grjvnpldlo",
    "summary": "Chelsea captain Millie Bright withdraws from the England squad for the Uefa Nations League matches in June.",
    "date": "2025-05-26T13:19:53",
    "source": "BBC"
  },
  {
    "title": "Alonso declares 'start of new era' at Real Madrid",
    "url": "https://www.bbc.com/sport/football/articles/cm2kzpe8kmvo",
    "summary": "Xabi Alonso declares the start of a new era as he is unveiled as the new manager of Real Madrid.",
    "date": "2025-05-26T13:11:37",
    "source": "BBC"
  },
  {
    "title": "Ex-Man Utd manager Ten Hag named Leverkusen boss",
    "url": "https://www.bbc.com/sport/football/articles/c4g39ex04d8o",
    "summary": "Former Manchester United boss Erik ten Hag signs a two-year contract to succeed Xabi Alonso as Bayer Leverkusen head coach.",
    "date": "2025-05-26T09:45:57",
    "source": "BBC"
  },
  {
    "title": "Smith replaces injured Harvey-Clifford in NI squad",
    "url": "https://www.bbc.com/sport/football/articles/c0j7qyx4zw9o",
    "summary": "Teenage Lisburn Rangers goalkeeper Kate Smith is called into the Northern Ireland squad in place of the injured Maddy Harvey-Clifford for the upcoming Women's Nations League games against Poland and Bosnia-Herzegovina.",
    "date": "2025-05-26T15:24:36",
    "source": "BBC"
  },
  {
    "title": "Walsall are moving forward despite defeat - Sadler",
    "url": "https://www.bbc.com/sport/football/articles/c4grqw0ny65o",
    "summary": "Walsall boss Mat Sadler says his side have \"moved forwards\" this season despite missing out on promotion having previously held a 12-point lead at the top of League Two.",
    "date": "2025-05-26T18:47:08",
    "source": "BBC"
  },
  {
    "title": "Mbappe wins European Golden Shoe for first time",
    "url": "https://www.bbc.com/sport/football/articles/cdr562z5xdmo",
    "summary": "Kylian Mbappe won the European Golden Shoe for the first time after scoring twice in Real Madrid's 2-0 defeat of Real Sociedad on Saturday.",
    "date": "2025-05-26T09:29:58",
    "source": "BBC"
  },
  {
    "title": "Rosicky expects full recovery after heart issue",
    "url": "https://www.bbc.com/sport/football/articles/cq695j843qro",
    "summary": "Former Arsenal midfielder Tomas Rosicky expects to make a full recovery after being admitted to intensive care with a heart-related issue.",
    "date": "2025-05-26T11:04:49",
    "source": "BBC"
  },
  {
    "title": "Bloom set for £10m Hearts stake after vote approval",
    "url": "https://www.bbc.com/sport/football/articles/c4grj3g5nzgo",
    "summary": "Tony Bloom is set to take up a 29% stake in Hearts after the club's majority shareholder group votes in favour of his £10m investment offer.",
    "date": "2025-05-26T17:09:24",
    "source": "BBC"
  },
  {
    "title": "County stunned as Livingston romp back to win play-off final",
    "url": "https://www.bbc.com/sport/videos/c8xgrxdejgxo",
    "summary": "Watch the highlights as Livingston come from two goals down in Dingwall to beat Ross County 4-2 on the night and 5-3 on aggregate in the Scottish Premiership play-off final.",
    "date": "2025-05-26T23:06:25",
    "source": "BBC"
  },
  {
    "title": "A day of joy and celebration for Liverpool turned into one of horror",
    "url": "https://www.theguardian.com/uk-news/2025/may/26/a-day-of-joy-and-celebration-for-liverpool-turned-into-one-of-horror",
    "summary": "<p>About 500,000 people were watching the Premier League winners’ trophy parade when a car ploughed into crowds</p><ul><li><p><a href=\"https://www.theguardian.com/uk-news/2025/may/26/man-arrested-car-crowd-liverpool-fc-football-fans\">Dozens injured as car ploughs into Liverpool victory parade crowd</a></p></li></ul><p>The Strand had been a scene of sheer euphoria 25 minutes earlier.</p><p>At 5.41pm the open-top bus parading the Liverpool team had passed by the Royal Liver Building and a huge crowd broke into a powerful rendition of You’ll Never Walk Alone to celebrate the new Premier League champions.</p> <a href=\"https://www.theguardian.com/uk-news/2025/may/26/a-day-of-joy-and-celebration-for-liverpool-turned-into-one-of-horror\">Continue reading...</a>",
    "date": "2025-05-26T22:30:06",
    "source": "Guardian"
  },
  {
    "title": "Fifa ‘more poorly governed today than 10 years ago’, open letter to organisation claims",
    "url": "https://www.theguardian.com/football/2025/may/27/fifa-more-poorly-governed-open-letter-football-politics",
    "summary": "<ul><li><p>Letter calls on Fifa to ‘address key structural flaws’</p></li><li><p>Decade after arrests of officials on corruption charges</p></li></ul><p>A decade after the arrests of seven of its senior officials on corruption charges, Fifa is “arguably more poorly governed today than it was 10 years ago”, figures from across the world of football have argued in <a href=\"https://fairsq.org/fifa-joint-statement/\">an open letter</a> to the organisation.</p><p>The anniversary of the arrests at the Baur au Lac hotel in Geneva has prompted ­non-­governmental organisations, legal figures, ­academics and supporter groups to call on Fifa to “address the key structural flaws” at the root of many of its ­governance problems, “most notably the deeply problematic power dynamic between the organisation’s executive branch and its member associations”.</p> <a href=\"https://www.theguardian.com/football/2025/may/27/fifa-more-poorly-governed-open-letter-football-politics\">Continue reading...</a>",
    "date": "2025-05-26T23:01:10",
    "source": "Guardian"
  },
  {
    "title": "James Milner opens up on nine-month absence: ‘I didn’t know if I could walk properly again’",
    "url": "https://www.theguardian.com/football/2025/may/26/james-milner-brighton-nine-month-injury-absence-fears-football",
    "summary": "<ul><li><p>Brighton midfielder returned to pitch in win over Spurs</p></li><li><p>The 39-year-old is in talks over a possible new contract</p></li></ul><p>James Milner has opened up over the freak knee surgery complication that left him unable to move his foot for months and fearing he would not walk normally, let alone return to football.</p><p>The 39-year-old Brighton midfielder made an emotional comeback as a late substitute <a href=\"https://www.theguardian.com/football/2025/may/25/tottenham-brighton-premier-league-match-report\">at Tottenham on Sunday</a> after nine months out – it took him to 638 Premier League ­appearances; Gareth Barry holds the competition record with 653.</p> <a href=\"https://www.theguardian.com/football/2025/may/26/james-milner-brighton-nine-month-injury-absence-fears-football\">Continue reading...</a>",
    "date": "2025-05-26T21:30:08",
    "source": "Guardian"
  },
  {
    "title": "Xabi Alonso sets out plan to make Real Madrid players ‘flourish’ in new era",
    "url": "https://www.theguardian.com/football/2025/may/26/xabi-alonso-real-madrid-jude-bellingham-la-liga",
    "summary": "<ul><li><p>‘I want players to play where they are most comfortable’</p></li><li><p>Manager reveals plans for Jude Bellingham’s midfield role</p></li></ul><p>The way Xabi Alonso told it, two things have to happen for someone to become Real Madrid coach: “First they have to want you, then you have to want to … and the latter normally does happen,” he said. So there he was at Valdebebas on a Monday afternoon in a classic dark suit and his first day in a new job – just 24 hours – or so he claimed – after he was told it was his.</p><p>Alonso’s appointment has been an open secret for weeks but Real had waited until the day before the end of the season to announce the <a href=\"https://www.theguardian.com/football/2025/may/23/carlo-ancelotti-bows-out-at-real-madrid-its-fundamental-to-be-respectful-and-be-respected\">departure of Carlo Ancelotti</a> and until the day after to announce the arrival of his successor. The following morning, there he was, keen to keep up the illusion. Alonso had been able to watch and analyse Real’s games, which must have taken some time, yet asked when he found out, he said: “Yesterday, when I saw the statement. It was evident then. How could I not find out?”</p> <a href=\"https://www.theguardian.com/football/2025/may/26/xabi-alonso-real-madrid-jude-bellingham-la-liga\">Continue reading...</a>",
    "date": "2025-05-26T17:13:54",
    "source": "Guardian"
  },
  {
    "title": "Chelsea ramp up push for new striker with talks over Delap and interest in Ekitike",
    "url": "https://www.theguardian.com/football/2025/may/26/chelsea-liam-delap-football-transfers-hugo-ekitike",
    "summary": "<ul><li><p>Ipswich striker Delap has a £30m release clause</p></li><li><p>Chelsea show firm interest in Ekitike and Sesko</p></li></ul><p>Chelsea are ramping up their pursuit of a new striker after qualifying for the Champions League, with further talks held over Ipswich’s Liam Delap and the club giving strong consideration to a move for Eintracht Frankfurt’s Hugo Ekitike.</p><p>Improving their options in attack is a priority for the club this summer and their hopes of landing their top targets has been boosted by finishing fourth in the Premier League.</p> <a href=\"https://www.theguardian.com/football/2025/may/26/chelsea-liam-delap-football-transfers-hugo-ekitike\">Continue reading...</a>",
    "date": "2025-05-26T21:16:26",
    "source": "Guardian"
  },
  {
    "title": "Arsenal revel in WCL celebrations at home: ‘The happiest I’ve been in my whole life’",
    "url": "https://www.theguardian.com/football/2025/may/26/arsenal-womens-champions-league-trophy-celebration-football-barcelona",
    "summary": "<p>In terms of women’s club football, in England, no trophy party comes close to the scenes in north London</p><p>The large trophy with its sweeping ribbon-like arms goes up, waves and waves of confetti shower over the 10,000-plus fans, red and white smoke erupts from behind the stage and the crowd sings. Arsenal, the new champions of Europe, were given a heroes’ welcome in north London two days <a href=\"https://www.theguardian.com/football/2025/may/24/arsenal-grab-womens-champions-league-final-glory-against-barcelona\">after their stunning victory</a> over Barcelona in the Champions League final.</p><p>The scenes in Armoury Square, outside the Emirates Stadium, were reminiscent of those in Trafalgar Square <a href=\"https://www.theguardian.com/football/2022/jul/31/queen-joins-sport-stars-and-politicians-to-share-joy-of-lionesses-euro-2022-win\">the day after the Lionesses lifted</a> their maiden European title in 2022, or those in the same N5 location when the Arsenal men’s team lifted the FA&nbsp;Cup in 2014 and 2015 (the 2017 occasion was cancelled by the Metropolitan police due to security risks in London, and Covid restrictions prevented a public celebration in 2020).</p> <a href=\"https://www.theguardian.com/football/2025/may/26/arsenal-womens-champions-league-trophy-celebration-football-barcelona\">Continue reading...</a>",
    "date": "2025-05-26T16:50:47",
    "source": "Guardian"
  },
  {
    "title": "Tears and cheers as Crystal Palace celebrate historic FA Cup win with parade",
    "url": "https://www.theguardian.com/football/2025/may/26/crystal-palace-celebrate-historic-fa-cup-win-with-parade",
    "summary": "<p>Thousands turned out on the wet streets of south London to catch a glimpse of the club’s first major trophy</p><p>Crystal Palace supporters had waited a lifetime for this moment. When the two buses carrying Oliver Glasner and his FA Cup winners rounded the corner of Holmesdale Road, red and blue smoke from flares filled the air as thousands of south Londoners showed their appreciation, with several shedding tears again.</p><p>In the days since Eberechi Eze’s <a href=\"https://www.theguardian.com/football/2025/may/17/crystal-palace-manchester-city-fa-cup-final-match-report\">winner against Manchester City</a> clinched Palace’s first major trophy, a sense of disbelief has been the overwhelming feeling for fans who are excitedly contemplating a foray into Europe next season.</p> <a href=\"https://www.theguardian.com/football/2025/may/26/crystal-palace-celebrate-historic-fa-cup-win-with-parade\">Continue reading...</a>",
    "date": "2025-05-26T16:54:14",
    "source": "Guardian"
  },
  {
    "title": "AFC Wimbledon relish reaching League One after edging out Walsall in playoff final",
    "url": "https://www.theguardian.com/football/2025/may/26/afc-wimbledon-walsall-league-two-playoff-final-match-report",
    "summary": "<p>This was another triumphant day for south London at Wembley. Sunday brought Charlton promotion to the Championship and on Monday AFC Wimbledon headed back to League One after three years away, a thump from Myles Hippolyte in first-half stoppage time enough to deny Walsall.</p><p>The contest was low on thrills but style is not what makes this occasion grand. Until Hippolyte found the bottom right corner, it had looked a match heading for extra time or penalties, likely to be decided by either Tommy Simkin or Owen Goodman, two impressive young goalkeepers. And while Walsall were shaken into action in the second half, Wimbledon’s solidity shone through with an impenetrable defence. They celebrated victory and a clean sheet, just like they had done at this venue nine years ago against Plymouth, just like the Crazy Gang in 1988.</p> <a href=\"https://www.theguardian.com/football/2025/may/26/afc-wimbledon-walsall-league-two-playoff-final-match-report\">Continue reading...</a>",
    "date": "2025-05-26T16:05:09",
    "source": "Guardian"
  },
  {
    "title": "Liverpool hold talks over record Florian Wirtz deal in ‘busy’ summer plans",
    "url": "https://www.theguardian.com/football/2025/may/26/liverpool-hold-talks-over-record-florian-wirtz-deal-in-busy-summer-plans",
    "summary": "<ul><li><p>Chair Tom Werner says transfer plans have already begun</p></li><li><p>Van Dijk delighted to have been given trophy by Hansen</p></li></ul><p>The Liverpool chair, Tom Werner, has confirmed the club’s busy summer has already begun with the Premier League champions in talks over the record transfer of Florian Wirtz and close to wrapping up a deal for his Bayer Leverkusen teammate Jeremie Frimpong.</p><p>Liverpool are favourites to sign Wirtz after he turned down a move to Bayern Munich and Manchester City pulled out of the running. Negotiations have started over a fee with Leverkusen, who want £126m for the Germany international. That would comfortably eclipse Liverpool’s record transfer, <a href=\"https://www.theguardian.com/football/2022/jun/14/liverpool-confirm-darwin-nunez-signing-in-85m-deal\">the £85m that brought Darwin Núñez from Benfica </a>in 2022, but the club hope to structure a deal with Leverkusen accepting a lower initial fee plus achievable add-ons.</p> <a href=\"https://www.theguardian.com/football/2025/may/26/liverpool-hold-talks-over-record-florian-wirtz-deal-in-busy-summer-plans\">Continue reading...</a>",
    "date": "2025-05-26T11:55:40",
    "source": "Guardian"
  },
  {
    "title": "Premier League 2024-25 review: goals of the season",
    "url": "https://www.theguardian.com/football/2025/may/26/premier-league-2024-25-review-goals-of-the-season",
    "summary": "<p>Mitoma was Messi-like, Durán stunned his teammates, Wilson looped one in, Davis was left buzzing and Christie finished off a planned move</p><p>It took something special from Mitoma to bring down the raking long pass of the Brighton goalkeeper, Bart Verbruggen’. The Japan winger’s first touch as the ball came down over his head was sublime, each alternate angle proving better than the next, before he dribbled away from Trevoh Chalobah and curled a low shot past Filip Jörgensen. Mitoma has often received plaudits for his technical ability, but this one truly felt like one of his best. “The touch is as good as anything you will see in the Premier League this season. And the finish isn’t bad either,” said Jamie Carragher on Sky Sports. “That’s Messi-like and I don’t say that lightly. Pure genius.” <a href=\"https://www.youtube.com/watch?v=zJFVTvSK_XU\">Mitoma’s goal </a>started the rush against Chelsea, with Yankuba Minteh adding two goals <a href=\"https://www.theguardian.com/football/2025/feb/14/brighton-chelsea-premier-league-match-report\">in the 3-0 victory</a>. “I don’t know if I ever saw something like this as a coach from my own player,” said Fabian Hürzeler. “To coordinate everything – the speed of the ball, the height of the ball and your legs – is a special thing. We shouldn’t underestimate that he was in a full sprint. I wouldn’t try it at home, but he has a special talent.”</p> <a href=\"https://www.theguardian.com/football/2025/may/26/premier-league-2024-25-review-goals-of-the-season\">Continue reading...</a>",
    "date": "2025-05-26T08:30:52",
    "source": "Guardian"
  },
  {
    "title": "Premier League 2024-25 review: matches of the season",
    "url": "https://www.theguardian.com/football/2025/may/26/premier-league-2024-25-review-matches-of-the-season",
    "summary": "<p>We select a few contenders for the Premier League’s match of the season – and invite you to have your say</p><p>What is it about these two? Newcastle and Liverpool <a href=\"https://www.theguardian.com/football/2024/dec/04/fabian-schar-stuns-liverpool-to-snatch-late-newcastle-equaliser-in-thriller\">met in early December</a>, a precursor to March’s <a href=\"https://www.theguardian.com/football/2025/mar/16/newcastle-sink-liverpool-to-savour-taste-of-glory-after-decades-of-drought\">Carabao Cup final</a>. Liverpool were on a run of seven wins in all competitions, most recently over Real Madrid and Manchester City, but St James’ Park under the lights was still an ominous task. The Premier League’s two most potent forwards faced off and both delivered. Newcastle ‘s Alexander Isak scored a thunderous opener, leathering a shot into the top corner, while the Swede also provided an assist for Anthony Gordon. At 2-1 Mohamed Salah put on a clinic with two expertly taken goals and one assist. The Liverpool winger appeared unstoppable at this stage of the season – despite (or because of?) questions circling over his contract – and this game came in the middle of a run when Salah scored 12 goals in 11 games between November and January. A 90th-minute equaliser by Fabian Schär capped a brilliantly even game by two of the league’s outstanding sides.</p> <a href=\"https://www.theguardian.com/football/2025/may/26/premier-league-2024-25-review-matches-of-the-season\">Continue reading...</a>",
    "date": "2025-05-26T07:30:50",
    "source": "Guardian"
  },
  {
    "title": "Premier League 2024-25 review: gripes of the season",
    "url": "https://www.theguardian.com/football/2025/may/26/premier-league-2024-25-review-gripes-of-the-season",
    "summary": "<p>A rundown of the most infuriating things this year including the rise of the celebrity set-piece coach and more VAR madness</p><p>Even at its most infuriating, the video assistant review system doesn’t take as long to deliver a verdict as the independent commission tasked with sifting through the three months of legal argument conducted at London’s International Dispute Resolution Centre and deciding whether Manchester City are guilty of any or all of <a href=\"https://www.theguardian.com/football/2023/feb/06/manchester-city-premier-league-charges-key-questions-answered\">the famous 100-plus charges</a> of financial chicanery levelled at them by the Premier League. The club was further charged with failing to cooperate with the investigation into their conduct, which began over six years ago. More than two years have passed since the Premier League charged City and the club’s hearing concluded in December, but the season has now ended without the announcement of a verdict, despite speculation it would come in early spring. While no deadline has been set, it is now expected to come in the summer and whatever the outcome, even those connected with City must be eager to see a line drawn under this saga, despite the potentially seismic repercussions for a club that has always protested its innocence of any wrongdoing.</p> <a href=\"https://www.theguardian.com/football/2025/may/26/premier-league-2024-25-review-gripes-of-the-season\">Continue reading...</a>",
    "date": "2025-05-26T10:30:55",
    "source": "Guardian"
  },
  {
    "title": "Aston Villa’s Champions League miss wasn’t just about one bad call | Jonathan Wilson",
    "url": "https://www.theguardian.com/football/2025/may/26/villas-champions-league-miss-wasnt-just-about-one-bad-call",
    "summary": "<p>Unai Emery’s team will have to make do with the Europa League next season but they were culpable for many of the steps that led them there</p><ul><li><p><a href=\"https://www.theguardian.com/football/2023/jul/20/sign-up-for-soccer-with-jonathan-wilson-his-free-weekly-newsletter-on-european-soccer\"><strong>Sign up for Soccer with Jonathan Wilson here</strong></a></p></li></ul><p>A season reduced to a single moment – in Aston Villa’s case, perhaps even more than a season. The Manchester United goalkeeper Altay Bayindir slid out to gather the ball. He fumbled, slightly, allowing Morgan Rogers to poke the ball away from him. The referee Thomas Bramall thought Bayindir had had the ball under control and blew for a free-kick just before Rogers knocked the ball into the empty net. Replays showed decisively that Bayindir never had the ball under control. But because Bramall had stopped the game before Rogers put the ball over the line, the goal could not be given by the video assistant referee.</p><p>Three minutes later, Amad Diallo put United ahead, his team went on to win, and Villa finished sixth in the Premier League, meaning they <a href=\"https://www.theguardian.com/football/2025/may/25/manchester-united-aston-villa-premier-league-match-report\">are out of next season’s Champions League</a>. Given how close Villa have pushed the line on Profit &amp; Sustainability Rules (PSR), that could have significant ramifications.</p><p><em>This is an extract from Soccer with Jonathan Wilson, a weekly look from the Guardian US at the game in Europe and beyond. <a href=\"https://www.theguardian.com/football/2023/jul/20/sign-up-for-soccer-with-jonathan-wilson-his-free-weekly-newsletter-on-european-soccer\">Subscribe for free here.</a> Have a question for Jonathan? Email <a href=\"mailto:soccerwithjw@theguardian.com?utm_term=64e374e957bc66de2eba0d88db18746b&amp;amp;amp;amp;utm_campaign=SoccerwithJonathanWilson&amp;amp;amp;amp;utm_source=esp&amp;amp;amp;amp;utm_medium=Email&amp;amp;amp;amp;CMP=soccerwithjonathanwilson_email&amp;amp;amp;amp;utm_term=64ff1d6da46fdfa0ee94e9584bcde874&amp;amp;amp;amp;utm_campaign=SoccerwithJonathanWilson&amp;amp;amp;amp;utm_source=esp&amp;amp;amp;amp;utm_medium=Email&amp;amp;amp;amp;CMP=soccerwithjonathanwilson_email&amp;amp;amp;amp;utm_term=650857e42d6de1edacd87a4ce777e357&amp;amp;amp;amp;utm_campaign=SoccerwithJonathanWilson&amp;amp;amp;amp;utm_source=esp&amp;amp;amp;amp;utm_medium=Email&amp;amp;amp;amp;CMP=soccerwithjonathanwilson_email\">soccerwithjw@theguardian.com</a>, and he’ll answer the best in a future edition.</em></p> <a href=\"https://www.theguardian.com/football/2025/may/26/villas-champions-league-miss-wasnt-just-about-one-bad-call\">Continue reading...</a>",
    "date": "2025-05-26T14:22:28",
    "source": "Guardian"
  },
  {
    "title": "Rayo Vallecano celebrate banner night: ‘25 years later, Europe sees us again’",
    "url": "https://www.theguardian.com/football/2025/may/26/rayo-vallecano-la-liga-back-in-europe-25-years-later",
    "summary": "<p>A Conference League place is a monumental achievement, made all the better by how out of place it all feels</p><p>Rayo Vallecano’s fans rolled out the banner at 10.46pm on the last Saturday of the season and rolled it away again a minute later. There had been a sneak glimpse of the message they hoped to stretch across the one end of a ground that is actually an end and not just a wall at risk of falling down, but it wasn’t quite time for the big reveal. For now all they wanted was to pull 40 metres of fabric into place, huge white letters proudly painted on a red background, ready for when, if, it actually was. They certainly didn’t intend to tempt fate; it wasn’t done yet, history still not made and, God knows, if there is a place where anything can go wrong, where football and life isn’t always kind but is always lived, it is here.</p><p>There was though a brief look before the banner was hidden again behind the back row – something about years, Europe and us – and they were close now. There were 10 minutes plus added time left and the side from the Independent People’s Republic of Vallekas, the last of the neighbourhood teams, not just <em>in</em> the <em>barrio</em> <a href=\"https://www.theguardian.com/football/blog/2012/feb/27/ray-vallecano-la-liga-blog\">but </a><em><a href=\"https://www.theguardian.com/football/blog/2012/feb/27/ray-vallecano-la-liga-blog\">of</a></em><a href=\"https://www.theguardian.com/football/blog/2012/feb/27/ray-vallecano-la-liga-blog\"> the </a><em><a href=\"https://www.theguardian.com/football/blog/2012/feb/27/ray-vallecano-la-liga-blog\">barrio</a></em>, were on the verge of qualifying for the Conference League. All they had to do was beat Real Mallorca and it turned out they wouldn’t even have to do that: they had taken 28 shots without scoring but it still didn’t matter because up in Vitoria, the team that could take the place from them hadn’t scored either, Osasuna losing 1-0 to Alavés.</p> <a href=\"https://www.theguardian.com/football/2025/may/26/rayo-vallecano-la-liga-back-in-europe-25-years-later\">Continue reading...</a>",
    "date": "2025-05-26T12:17:02",
    "source": "Guardian"
  },
  {
    "title": "Manchester United were lucky not to be relegated, admits Christian Eriksen",
    "url": "https://www.theguardian.com/football/2025/may/26/manchester-united-christian-eriksen-lucky-relegation-premier-league",
    "summary": "<ul><li><p>‘Next season it has to be better,’ says departing Dane</p></li><li><p>Thanks supportive fans after difficult season</p></li></ul><p>Christian Eriksen believes that Manchester United were lucky to avoid relega­tion from the Premier League and has thanked the club’s fans for not ­causing “chaos” when performances&nbsp;were poor.</p><p>A dire campaign came to an end with United <a href=\"https://www.theguardian.com/football/premierleague/table\">finishing 15th</a> in the ­Premier League, a record low, winning 11 games and ending with a goal difference of minus 10. They collected 42 points, 17 better than third-bottom Leicester, and Eriksen was frank in assessing his final season at the club.</p> <a href=\"https://www.theguardian.com/football/2025/may/26/manchester-united-christian-eriksen-lucky-relegation-premier-league\">Continue reading...</a>",
    "date": "2025-05-26T13:10:39",
    "source": "Guardian"
  },
  {
    "title": "Premier League 2024-25 review: young players of the season",
    "url": "https://www.theguardian.com/football/2025/may/26/premier-league-2024-25-review-young-players-of-the-season",
    "summary": "<p>From Lucas Bergvall to Leny Yoro, these five talents all made a big impact and have bright futures ahead</p><p>It was tempting to exclude Bergvall from consideration for this list simply because he played in Spurs’ 4-0 <a href=\"https://www.theguardian.com/football/2025/feb/06/liverpool-tottenham-carabao-cup-semi-final-second-leg-match-report\">League Cup semi-final defeat</a> at Anfield, as cowardly a display as could possibly exist. Overall, though, he’s enjoyed a fine debut season, especially as, when he joined Spurs from Djurgården, there was little sense he’d establish himself so soon. But with a little help from injuries and incompetence, he forced his way into consideration and is now a fixture in Ange Postecoglou’s starting XI – with good reason. In this era of attacking and defensive prefixes, Bergvall is that rarity: a midfielder who plays in the middle of the field. Clever enough to create, calm enough to score, physical enough to tackle and athletic enough to harry, perhaps his best quality is his decision-making, especially notable for a player of his age. If he continues improving, this will not be the last time his name makes a list of this ilk.</p> <a href=\"https://www.theguardian.com/football/2025/may/26/premier-league-2024-25-review-young-players-of-the-season\">Continue reading...</a>",
    "date": "2025-05-26T10:00:54",
    "source": "Guardian"
  },
  {
    "title": "Premier League 2024-25 review: signings of the season",
    "url": "https://www.theguardian.com/football/2025/may/26/premier-league-2024-25-review-signings-of-the-season",
    "summary": "<p>Dean Huijsen’s form earned him a move to Real Madrid while Ipswich’s Liam Delap should remain in the Premier League</p><p>Nottingham Forest had a huge problem with defending set pieces last season and Nuno Espírito Santo demanded a centre-back who could dominate in the air. The club were efficient in their business, signing the brick-headed Serb from Fiorentina for £10m. It was a bargain and the centre-back fitted in immediately alongside the Brazilian Murillo as the club created one of the best defences in the league. The pair complement one another perfectly and, along with Matz Sels, created the foundation for Forest’s tilt at qualifying for the Champions League by <a href=\"https://www.theguardian.com/football/2025/jan/14/nottingham-forest-liverpool-premier-league-match-report\">dominating some of the best strikers in the world</a>. After missing the opening match of the season against Bournemouth through suspension, Milenkovic, 27, has played every single minute in the Premier League. It is rare that an outfield player is an ever-present but the centre-back has been integral and his consistency cannot be underestimated, helping Murillo thrive. It is often the Brazilian who gets the most credit as he is the more flamboyant of the two but Milenkovic deserves just as much praise for what Forest have achieved this season.</p> <a href=\"https://www.theguardian.com/football/2025/may/26/premier-league-2024-25-review-signings-of-the-season\">Continue reading...</a>",
    "date": "2025-05-26T09:30:53",
    "source": "Guardian"
  },
  {
    "title": "Juve do just enough to reach Champions League. Will Conte join them there? | Nicky Bandini",
    "url": "https://www.theguardian.com/football/2025/may/26/juventus-serie-a-champions-league-antonio-conte-igor-tudor",
    "summary": "<p>There are interesting pieces to build on, but it appears unlikely Igor Tudor will be taking team forward</p><p>Serie A’s title race <a href=\"https://www.theguardian.com/football/2025/may/24/antonio-conte-napoli-serie-a-title-italy-football-scudetto\">ended on Friday night</a>, but the drama certainly didn’t. Still to be decided were the final qualifiers for all three European competitions and which teams would join Monza in dropping out of the top division. The six games that could affect those outcomes kicked off simultaneously on Sunday. Within 70 seconds, Daniel Fila had given 19th-placed Venezia the lead over fourth-placed Juventus. A tone-setter for an evening of twists and turns.</p><p>Juventus thought they had equalised almost immediately at the Stadio Pier Luigi Penzo, Alberto Costa driving a brilliant half-volley in from the edge of the area. But he handled in the buildup. Roma took the lead away to Torino. One point behind the <em>Bianconeri</em> at the start of play, they were on course for the last Champions League spot.</p> <a href=\"https://www.theguardian.com/football/2025/may/26/juventus-serie-a-champions-league-antonio-conte-igor-tudor\">Continue reading...</a>",
    "date": "2025-05-26T10:21:32",
    "source": "Guardian"
  },
  {
    "title": "Premier League final-day drama and a Sunderland hangover: Football Weekly - podcast",
    "url": "https://www.theguardian.com/football/audio/2025/may/26/premier-league-final-day-drama-and-a-sunderland-hangover-football-weekly-podcast",
    "summary": "<p><a href=\"https://bsky.app/profile/maxrushden.bsky.social\">Max Rushden</a> is joined by <a href=\"https://bsky.app/profile/did:plc:i55lfvhkg573wfmby5sdnvq6\">Barry Glendenning</a>, <a href=\"https://bsky.app/profile/did:plc:blz3nivl5rf5wtbaalspq473\">Jonathan Wilson</a>, and <a href=\"https://bsky.app/profile/did:plc:udhe3gvm3aq645kpzmre7gnm\">Robyn Cowen</a> to unpack the final day of the Premier League season</p><p><strong>Rate, review, and share on <a href=\"https://itunes.apple.com/podcast/football-weekly-the-guardian/id188674007?mt=2\">Apple Podcasts</a>, <a href=\"https://soundcloud.com/guardianfootballweekly\">Soundcloud</a>, <a href=\"https://audioboom.com/channel/football-weekly\">Audioboom</a>, <a href=\"https://www.mixcloud.com/guardianfootballweekly/\">Mixcloud</a>, <a href=\"https://www.acast.com/footballweekly\">Acast</a> and <a href=\"http://www.stitcher.com/podcast/guardianuk/football-weekly\">Stitcher</a>, and join the conversation on <a href=\"https://www.facebook.com/GuardianPodcasts/\">Facebook</a>, <a href=\"https://twitter.com/guardianaudio\">Twitter</a> and <a href=\"mailto:footballweekly@theguardian.com\">email</a>.<br /><br /></strong>On the podcast today: the Premier League wraps with a subdued scramble for fifth, but there’s outrage at Old Trafford as Aston Villa’s disallowed goal prompts <a href=\"https://www.theguardian.com/football/2025/may/25/aston-villa-referee-thomas-bramall-manchester-united-premier-league-football\">a formal complaint to the PGMOL</a>. Despite Emi Martínez’s error and red card, Villa’s Champions League hopes are dashed, while <a href=\"https://www.theguardian.com/football/2025/may/25/newcastle-everton-premier-league-match-report\">Newcastle</a>, <a href=\"https://www.theguardian.com/football/2025/may/25/blue-is-the-colour-maresca-turns-on-his-critics-after-chelsea-secure-fourth-place\">Chelsea</a>, and <a href=\"https://www.theguardian.com/football/2025/may/25/fulham-manchester-city-premier-league-match-report\">Manchester City</a> secure their spots.</p><p>Elsewhere, <a href=\"https://www.theguardian.com/football/2025/may/25/nottingham-forest-chelsea-premier-league-match-report\">Forest fall to Chelsea</a> and slide into the Conference League, <a href=\"https://www.theguardian.com/football/2025/may/24/arne-slot-springsteen-salah-inspire-liverpool-title-repeat\">Liverpool celebrate Salah’s golden season</a>, and <a href=\"https://www.theguardian.com/football/2025/may/25/tottenham-brighton-premier-league-match-report\">Brighton crush Spurs in a final flourish</a>. There’s love for <a href=\"https://www.theguardian.com/football/2025/may/24/aberdeen-end-35-year-wait-for-scottish-cup-glory-with-shootout-win-over-celtic\">Aberdeen’s Scottish Cup triumph</a>, <a href=\"https://www.theguardian.com/football/2025/may/25/arsenal-chloe-kelly-double-euro-champion-womens-champions-league\">Arsenal’s Women’s Champions League glory</a>, and <a href=\"https://www.theguardian.com/football/2025/may/25/trent-alexander-arnold-liverpool-premier-league-fans\">a curtain call for Trent Alexander-Arnold at Anfield</a>. Plus: <a href=\"https://www.theguardian.com/football/2025/may/25/southampton-appoint-will-still-as-manager-on-three-year-contract\">Will Still’s Saints</a>, <a href=\"https://www.theguardian.com/football/2025/may/25/wolves-brentford-premier-league-match-report\">Wolves’ Sunday League special</a>, and Football Weekly’s very own end-of-season awards – with a healthy dose of <a href=\"https://www.theguardian.com/football/2025/may/24/sunderland-underdog-championship-playoff-final-sheffield-united\">Black Cats joy</a>.<br /><br />\n Support the Guardian <a href=\"https://theguardian.com/euro-support\">here</a>.</p> <a href=\"https://www.theguardian.com/football/audio/2025/may/26/premier-league-final-day-drama-and-a-sunderland-hangover-football-weekly-podcast\">Continue reading...</a>",
    "date": "2025-05-26T12:30:22",
    "source": "Guardian"
  },
  {
    "title": "Premier League 2024-25 review: managers of the season",
    "url": "https://www.theguardian.com/football/2025/may/26/premier-league-2024-25-review-managers-of-the-season",
    "summary": "<p>Arne Slot’s first season could not have gone any better while Wolves fans drank to Vítor Pereira’s arrival</p><p><a href=\"https://www.theguardian.com/football/2025/apr/27/liverpool-tottenham-premier-league-match-report\">By winning the league</a>, the Dutchman surprised pretty much everyone. He faced the daunting task of succeeding Jürgen Klopp and inherited the German’s squad, adding only Federico Chiesa, who barely kicked a ball in anger. Not much changed from the previous year, except Ryan Gravenberch became the designated defensive midfielder as Slot’s Liverpool looked to get on the ball as much as possible. Slot was never going to be a personality who generated headlines like Klopp did, keeping his cards close to his chest, but he always comes across as someone who is very personable and has brought the players closer together. Slot made Liverpool an efficient winning machine – rarely thrashing teams, often winning by the odd goal or two – and that allowed them to race to a second Premier League title. No one could compete with the Reds, which was partly down to <a href=\"https://www.theguardian.com/football/2025/feb/22/arsenal-west-ham-premier-league-match-report\">rivals dropping their standards</a> but most of it can be attributed to the fact Slot made his team superior.</p> <a href=\"https://www.theguardian.com/football/2025/may/26/premier-league-2024-25-review-managers-of-the-season\">Continue reading...</a>",
    "date": "2025-05-26T08:00:51",
    "source": "Guardian"
  },
  {
    "title": "Erik ten Hag returns to management as new Bayer Leverkusen head coach",
    "url": "https://www.theguardian.com/football/2025/may/26/erik-ten-hag-returns-to-football-as-new-bayer-leverkusen-head-coach",
    "summary": "<ul><li><p>Former Manchester United manager signs two-year deal</p></li><li><p>Xabi Alonso left role at Leverkusen for Real Madrid job</p></li></ul><p>Erik ten Hag, the former Manchester United and Ajax coach, has been announced as Xabi Alonso’s replacement at Bayer Leverkusen. After <a href=\"https://www.theguardian.com/football/2025/may/25/xabi-alonso-appointed-real-madrid-manager-three-year-contract-bayer-leverkusen\">Alonso’s departure to Real Madrid</a>, with the Basque unveiled on Monday, Leverkusen, who finished second in the Bundesliga this season, have alighted on the Dutchman <a href=\"https://www.theguardian.com/football/2024/oct/28/manchester-united-sack-erik-ten-hag\">sacked by United in October</a>.</p><p>The 55-year-old has signed a contract until 2027 and previously worked in German football as a coach at Bayern Munich.</p> <a href=\"https://www.theguardian.com/football/2025/may/26/erik-ten-hag-returns-to-football-as-new-bayer-leverkusen-head-coach\">Continue reading...</a>",
    "date": "2025-05-26T09:17:43",
    "source": "Guardian"
  }
]